[
{"job_title": "Summer Program - Commercial Litigation Associate", "summary": "SUMMER PROGRAM Curtis’ small and highly selective New York Summer Associate Program is the foundation of our recruiting efforts. The majority of our entry…", "company": "Curtis Mallet-Prevost Colt & Mosle LLP", "location": "New York, NY 10016 (Murray Hill area)", "job_description": "SUMMER PROGRAMCurtis’ small and highly selective New York Summer Associate Program is the foundation of our recruiting efforts. The majority of our entry-level attorneys begin their careers at the firm as summer associates. Our summer program is designed to provide students with a realistic view of what working in a law firm is like. We immerse our summer associates in law firm life through constant contact with our attorneys, client projects, training seminars, and social events.ASSIGNMENTSWe pride ourselves on giving our summer associates the opportunity to do real work for actual clients. As a summer associate, you will be staffed on ongoing matters that are representative of the work that is currently being done in the firm. Through our dedicated team of assigning associates, you will receive substantive assignments from within your department, which are carefully selected to correspond with your interests and goals. Our first priority is to make sure our summer associates receive the same level of work we would give a first- or second-year associate.TRAINING AND DEVELOPMENTAt Curtis, we are dedicated to the education and training of our summer associates. As a summer associate you will have the chance to see our attorneys in action: you will attend client meetings, depositions, closings, and court appearances. In addition to the hands-on training, we also provide our summer associates with formal training in substantive areas which include but are not limited to legal writing, legal research, and taking depositions.Each year, Curtis interviews students at top law schools around the country for our summer program, seeking candidates we believe will be successful associates and ultimately develop into future partners of the firm. In addition to academic success, Curtis values an entrepreneurial spirit, integrity, leadership and maturity as well as strong interpersonal skills.MENTORINGEach summer associate is paired with a partner mentor, associate advisor, and an officemate from your department. These three individuals are not only meant to provide feedback and professional support but also serve as your guides in getting to know the firm culture and its people.Job Types: Full-time, TemporaryPay: $3,462.00 per weekSchedule:Monday to FridayWork Location: One location", "url": "https://www.indeed.com/viewjob?cmp=Curtis-Mallet--Prevost-Colt-%26-Mosle-LLP&t=Summer+Program&jk=0ca4ea5d8d655161&vjs=3"},
{"job_title": "newIn-House Counsel", "summary": "This is a full time position located at our Corporate Office in Manhattan.\nThe In House Counsel is directly responsible and accountable to the Executive Vice…", "company": "McAllister Towing & Transportation", "location": "New York, NY 10004 (Financial District area)", "job_description": "Description/Job SummaryThis is a full time position located at our Corporate Office in Manhattan. The In House Counsel is directly responsible and accountable to the Executive Vice President & General Counsel.Responsibilities/DutiesThe In House Counsel supports and implements strategies related to the Legal, Compliance and Sales Departments.Review, draft, and negotiate diverse legal documentation, including commercial contracts, corporate documentation, loan agreements, mortgages, construction contracts, leases, vessel charters, and towage agreements.Oversight and case management of general litigation, including employee practices liability, environmental claims, and contractual litigation. Actual litigation is outsourced.Coordination and collaboration with other company executives on compliance program upgrade and implementation.Responsibility for development, maintenance and implementation of employee manuals, corporate policies, and benefit plans.Coordinating with Sales Department regarding customer contracts and Company tariffs.Assisting company executives with media, customer, and government relations.Substantial interface between company management, outside counsel, and customers.Development and implementation of efficiencies and new cost controls in the administration of the business.Special projects as assigned by company Vice Presidents.Project Management for RFP's, both government and private sector. This involves but not limited to breaking down legal issues and risk exposure to managing VP's to answer specialized questions in their field of expertise. Performs final review of completed document for errors and risk assessment.Other duties as assigned.Required ExperienceMust have strong analytical, writing, and presentation skills.In depth knowledge of general contract and corporate law principles.Excellent negotiation skills and understanding of the economics of deal making.Knowledge of legal and regulatory requirements of marine transportation industry.General knowledge of Excel and general Office computer programs.Ability to act as a resource and advisor for other company managers on diverse management issues.*Required Education*Law degree and admission to practice law in New York required.Must have three to five years experience practicing law.*Details*We are an EEO Employer.Job Type: Full-timePay: $67,905.00 - $224,757.00 per yearSchedule:Monday to FridayLicense/Certification:Bar (Preferred)Work Location: Multiple Locations", "url": "https://www.indeed.com/viewjob?cmp=McAllister-Towing-%26-Transportation&t=House+Counsel&jk=c4fe64637d2dd6df&vjs=3"},
{"job_title": "newINDUSTRIAL SECURITY SPECIALIST", "summary": "Help This job is open to The public U.S. Citizens, Nationals or those who owe allegiance to the U.S. Clarification from the agency This announcement is…", "company": "US Defense Counterintelligence and Security Agency", "location": "Downers Grove, IL", "job_description": "Help\nThis job is open to\nThe public\nU.S. Citizens, Nationals or those who owe allegiance to the U.S.\nClarification from the agency\nThis announcement is open to: All U.S. Citizens", "url": "https://www.indeed.com/viewjob?jk=bc1c766f1131ea0f&from=serp&vjs=3"},
{"job_title": "Tax Lawyer", "summary": "100% employer-paid medical, dental and vision for employees.\nAnnual cost of living increase.\n22 days Paid Time Off.\nAfter 3 years, PTO increases to 29 days.", "company": "Corporate Tools", "location": "Hybrid remote in Post Falls, ID+2 locations", "job_description": "Overview:\nAs our Tax Lawyer your job will be to innovate, structure, and drive extremely complex world wide taxation strategies. GILTI should mean something to you, conservation easements shouldn’t be scary, and IP structuring is something you struggle to get out of your head at night. Economic Substance is a set of words that gives you nightmares. It doesn’t matter who is your President or what the regime is; you’ll make the best with what’s been given us in a timely fashion to exploit the cards we’ve been dealt. All in a thought out, well executed, disciplined approach. Also you’ve always dreamed of using a Purple calculator that’s taller than a human.\n\nThis position is coded as “Hybrid” which means after initial training and on-boarding which will take place in office, occasional remote work is available. However, this role will be expected to continue to work in our Post Falls, Idaho office 2-3 days/week.\n\n\nWage:\n$170,000\nBenefits:\n100% employer-paid medical, dental and vision for employees\nAnnual cost of living increase\nAnnual review with raise option\n22 days Paid Time Off\nAfter 3 years, PTO increases to 29 days. Employees transition to flexible time off after 5 years with the company—not accrued, not capped, take time off when you want.\nPaid Maternity and Paternity Leave\n4% company matching 401(k) with no vesting period\nQuarterly \"Work Wherever\" allowance\nUse to make your remote work wherever set up more comfortable, for continuing education classes, a plant for your desk, coffee for your coworker, a massage for yourself... really, whatever.\nCreative environment where you can make a difference\nNo dumb benefits like free dog walking on the weekends that snobby hipster places have to make you feel cool, but mathematically won't cost the company much money because you won't use it.\nTrail Mix Bar - oh yeah.\nResponsibilities:\nMake sure owners do not go to jail\nDrive our world wide, national, and local jurisdictional tax strategies\nExtremely complex corporate structuring\nUnderstand current tax laws and drive our future planning\nRequirements:\nCPA License\nLLM in Tax or equivalent\nWhere permitted by applicable law, must have received or be willing to receive the COVID-19 vaccine by date of hire, and to become fully-vaccinated within three weeks after date of hire, to be considered for the job.\nTax Lawyer\nPost Falls, ID", "url": "https://www.indeed.com/viewjob?jk=3c5a95ccaa2db777&from=serp&vjs=3"},
{"job_title": "Assistant General Counsel", "summary": "Yes. Masks, social distancing, enhanced cleaning and air filtering, and for on-site employees temporary remote work approved by supervisor.", "company": "U.S. Department of Education Office of General...", "location": "Remote", "job_description": "The full job description may be found here:https://www.usajobs.gov/job/621439800Job Type: Full-timePay: $132,552.00 - $199,300.00 per yearBenefits:Dental insuranceEmployee assistance programFlexible scheduleHealth insuranceLife insurancePaid time offParental leaveProfessional development assistanceVision insuranceSchedule:Weekend availabilitySupplemental Pay:Bonus payCOVID-19 considerations:Yes. Masks, social distancing, enhanced cleaning and air filtering, and for on-site employees temporary remote work approved by supervisor.License/Certification:Bar license (Required)Work Location: Remote", "url": "https://www.indeed.com/viewjob?cmp=U.S.-Department-of-Education-Office-of-General-Counsel&t=Assistant+General+Counsel&jk=192d4c8a1ee0cd06&vjs=3"},
{"job_title": "Associate - Remote Antitrust", "summary": "Discretionary merit bonuses may also be awarded.\nOur benefits include: Work-from-home setup allowance; Monthly wellness reimbursements; 24/7 emotional and…", "company": "Wilson, Sonsini, Goodrich & Rosati", "location": "+126 locationsRemote", "job_description": "Job ID: RE015\nPosition: Experienced Attorney\nLocation: Remote\nDepartment: Antitrust\nOpen Date: Monday, January 1, 0001\nJob Function: Legal\nJob Description:\nWe’re excited for you to join our world class Antitrust practice that tackles the largest, most complex, and most high-profile antitrust merger investigations – and does so with an unmatched record of success. Our practice includes complex deals involving market-leading companies in many of the most competitive sectors, including technology, life sciences, medial, energy, financial services, transportation and consumer product industries with a deal flow that is among the most robust in the legal industry. If you’re interested in joining our team, we’re looking for attorneys with at least 4-6 years of experience, with particular experience with mergers. Superior academic credentials, strong verbal, written and interpersonal skills required.\nThe compensation range and benefits for this role are described below.\nSalary range of $275,000 - $330,000, based on year classification.\nDiscretionary merit bonuses may also be awarded.\nOur benefits include: Work-from-home setup allowance; Monthly wellness reimbursements; 24/7 emotional and behavioral health support and virtual counseling; Vacation with billable hour credit; Healthcare coverage for you and your same- or opposite-sex spouse/domestic partner and children up to age 26; Family-building benefits including IVF, adoption, surrogacy, and egg-freezing; Paid parental leave; Parenting support concierge and telemedicine; Parents and caregivers resource group; Career coaching for working parents; In-home and center-based back-up childcare; Tutoring and college coach for older children; Health Savings Accounts with firm contribution; Flexible spending accounts; 401(k) retirement plan; Pretax commuter and parking benefits; Basic and supplemental life insurance; Short and long-term disability; Voluntary long term care insurance; Voluntary critical illness, hospitalization, and accident insurance; Relocation assistance; Firm-paid CLE, bar review fees, and bar dues.\nJob Requirements:", "url": "https://www.indeed.com/viewjob?jk=2b03239290cd8352&from=serp&vjs=3"},
{"job_title": "School Resource Officer", "summary": "Full-time/Part-time: Full Time.\nHigh School Diploma/Equivalent: Yes.", "company": "Sarasota County Schools", "location": "Sarasota County, FL", "job_description": "LOCATION: SAFETY & SECURITY/SCHL POLICE\nPOSITION: School Resource Officer\nJOB DESCRIPTION:\nSchool Resource Officer\n\nLocation: School Police, Safety and Security\n\nCost Center: School Police, Safety and Security\n\nFull-time/Part-time: Full Time\n\nHours Per Day: 0\n\nShift:\n\n\nContract Months: 10\n\nDays Posted: 0\n\nPosting Closing Time: 5:00 PM\n\nTitle I: No\n\nRequire Test: No\n\nHigh School Diploma/Equivalent: Yes\n\nSalary Lane: SSP13\n\nSalary Schedules: Salary Schedules\n\nDAYS:\n\n\nSTART DATE: Jan 04, 2021", "url": "https://www.indeed.com/viewjob?jk=3cfeb23bdd4d20e8&from=serp&vjs=3"},
{"job_title": "newFront-End and UX Developer (Remote Position)", "summary": "U.S. Figure Skating, the National Governing Body (NGB) for the sport of figure skating, located in Colorado Springs, Colorado, is accepting applications for the…", "company": "U.S. Figure Skating", "location": "Remote in Colorado Springs, CO", "job_description": "U.S. Figure Skating, the National Governing Body (NGB) for the sport of figure skating, located in Colorado Springs, Colorado, is accepting applications for the contract position of Front-End and UX Developer. U.S. Figure Skating is a member of the United States Olympic & Paralympic Committee (USOPC) and the International Skating Union (ISU).\nU.S. Figure Skating is an Equal Opportunity Employer and does not discriminate on the basis of race, color, religion, national origin, gender, gender identity or expression, sexual orientation, age, disability, or any other status or characteristic protected by law or regulation. We are committed to building and sustaining a diverse team by maintaining hiring and recruiting processes that are free from bias.\nResponsibilities Include:\nDetermining the structure and design of web pages.\nEnsuring user experience determines design choices.\nDeveloping features to enhance the user experience.\nStriking a balance between functional and aesthetic design.\nEnsuring web design is optimized for smartphones.\nBuilding reusable code for future use.\nOptimizing web pages for maximum speed and scalability.\nUtilizing a variety of markup languages to write web pages.\nMaintaining brand consistency throughout design.\nQualifications:\nBachelor’s Degree in Computer Science or computer related field.\nUnderstanding of key design principles.\nProficiency with HTML, CSS (and JS) Frameworks / Preprocessing, JavaScript Frameworks and jQuery, Bootstrap, Telerik, Kendo. Proficiency with vue.js.\nProficiency with typescript.\nUnderstanding of server-side CSS.\nExperience in drawing, wire-framing, doing lo-fi and hi-fi mockups, tap-responsive prototypes, and sometimes even coded prototypes.\nProficiency with UX design tools such as Figma. Experience with graphic design applications is a plus.\nExperience with responsive and adaptive design.\nGood knowledge of designing UX/UI with persona method\nGood problem-solving skills.\nKnowledge of MVC Razor is a plus.\nFigure Skating experience is a plus.\n\n\nClassification: Full-time, Independent Contractor\nReporting Requirement: Reports to the IT Development Team Lead\nPay: Commensurate with experience; Salary Range $40 -$60 / Hour", "url": "https://www.indeed.com/viewjob?jk=877f8b86942e4d23&from=serp&vjs=3"},
{"job_title": "Unity Developer", "summary": "*Gameplay*: Accessible games start and end with delightful UX/UI.\n*Product Intuition: * Should have an eye for UI/UX; comfortable using wireframes and filling…", "company": "Tales", "location": "Remote", "job_description": "Tales is creating a modern publishing platform. We connect writers to data, upgrade their monetization, and give them the tools to create new storytelling formats. Think Roblox for fiction writers. Join us and together we’ll connect storytellers with consumers, cut out the gatekeepers, and build the next Netflix powered by creators in the process.About YouDevelopers at Tales will do a little bit of everything to deliver great experiences to our readers and writers. We expect you to have launched multiple web apps and touched a large variety of systems. We’re looking for leaders who can clear the way for their colleagues. Responsive web clients? Piece of cake. Data-driven systems? Obviously. Tools that empower the team? You’ve lost track of how many things you’ve built to help others or yourself save time. You have your choice of which companies to work for but you’re strongly driven by mission and values.Your ResponsibilitiesGameplay: Accessible games start and end with delightful UX/UI. You'll have the opportunity to add deeper gameplay mechanics that will bring stories to life.Reading: We're reinventing the reading process for a mobile-native world. Gutenberg was great but you've got ideas on how to make books better.Recommendations: Similar to Netflix, our job is to get the perfect story to the right consumer. You'll be working on systems that will surface great content in unexpected ways.Your SkillsLanguage:  Fluency with C# and Unity.Product Intuition:  Should have an eye for UI/UX; comfortable using wireframes and filling in the gaps.Experience:  Must have completed a game-jam or shipped a mobile game.Bonus: Knowledge of DevOps (e.g. build automation) and cloud-based SDK integration.Top Five Reasons You Should Join TalesMission: Only 5% of published fiction is written by people of color. We’re democratizing access to publishing by removing the traditional gatekeepers.Innovation: Build content creation tools creatives have never seen. Top creators from TellTale, BioWare, Wattpad, and Twitch have already started creating original franchises on our platform.Impact: Be the hero of creators who will be able to make a sustainable living on our platform. When they succeed in creating household names, you’ll know you had an integral part in bringing that to life.Upside: Being an early team member means you get to shape our journey in meaningful ways. Economically, you’ll own a piece of a more engaging and democratized version of Kindle or Netflix.Fun: The journey may be long but you’re working at the intersection of media and technology. This isn’t a payment processor (nothing wrong with that if that’s your cup of tea – but here there be games!).LocationRemote, accepting worldwide candidates.Required to overlap 3-4 hours with Californian (GMT-8) time zones.Job Type: Full-time", "url": "https://www.indeed.com/viewjob?cmp=Tales-Writer&t=Unity+Developer&jk=4cffe30f7280a42d&vjs=3"},
{"job_title": "newAssistant Town Clerk", "summary": "Town benefits include health, dental, vision and life insurance, 10 paid vacation days, 12-13 paid holidays per year.\nBacks up other Town administrative staff.", "company": "Town of Mooresville", "location": "Mooresville, NC 28115", "job_description": "At the Town of Mooresville, our vision is to create a safe, vibrant, and diverse community that is inclusive to all.Mooresville is located near Lake Norman, about 25 miles North of Charlotte and is home to about 40,000 residents. The Town of Mooresville and its employees strive to enhance the quality of life in our community by providing high quality services and directing well-planned growth while encouraging inclusion and belonging.Town employees enjoy a great work/life balance and a generous benefits package. Town benefits include health, dental, vision and life insurance, 10 paid vacation days, 12-13 paid holidays per year. Town employees also receive a 5% employer contribution to their 401(k) along with being enrolled in the Local Government Retirement System (LGERS).As an employee you will have several career development opportunities including tuition assistance and training programs. If you are a detailed-oriented and collaborative individual with creativity and professionalism, we look forward to hearing from you.Description: Performs duties of and acts as the Town Clerk in the Clerk’s absence including preparing and executing official documents. Attends assigned work sessions, committee, and board meetings, and prepares meeting minutes of which requires some evening work. Performs administrative duties as needed for the Town Manager, Mayor, and Board members by handling correspondence, public inquiries, and other administrative tasks. Receives and screens communications including telephone calls and email messages and provides assistance, using independent judgment to determine those requiring priority attention. Researches and compiles information as requested by the Town Clerk, Board, or Town Manager; performs special project work as requested and in the most appropriate manner; handles confidential information. Plans and coordinates meetings and special events. Prepares, composes, and types correspondence, letters, memorandums, and other directives for the Town Manager and other Town officials. Performs a variety of office support tasks to help the administrative offices function smoothly and keep all related Town departments informed of actions that have an impact on them. Backs up other Town administrative staff. Performs other duties as requested.Minimum Qualifications: An associate degree from an accredited community college in business or a related field and three to five years of experience in office management work, preferably including two years of experience in the safekeeping and care of public records and/or high-level executive assistant duties; or an equivalent combination of education and experience.Special Requirements: Possession of a valid North Carolina driver’s license. Ability to obtain Notary Public certification within one year of hire. Certification from the NC School of Government as Town Clerk or ability to obtain within three years of hire.How to Apply: Applications will be accepted on-line at www.mooresvillenc.gov/191/Employment-Opportunities . Resumes will NOT be accepted in lieu of a Town of Mooresville application. This position will be open until 2/20/2022Job Type: Full-timePay: $38,517.00 - $60,238.00 per yearBenefits:401(k)401(k) matchingDental insuranceEmployee assistance programFlexible spending accountHealth insuranceHealth savings accountLife insurancePaid time offProfessional development assistanceRetirement planTuition reimbursementVision insuranceSchedule:8 hour shiftWork Location: One location", "url": "https://www.indeed.com/viewjob?cmp=Town-of-Mooresville&t=Assistant+Town+Clerk&jk=403af2cbe643ce03&vjs=3"},
{"job_title": "newAssistant General Counsel, Digital Product", "summary": "The Chief Administrative Office (CAO) drives innovation in process, technologies, and services, while fueling NIKE with exceptional levels of support.", "company": "Nike", "location": "Beaverton, OR+7 locations", "job_description": "Become a Part of the NIKE, Inc. Team\nNIKE, Inc. does more than outfit the world’s best athletes. It is a place to explore potential, obliterate boundaries and push out the edges of what can be. The company looks for people who can grow, think, dream and create. Its culture thrives by embracing diversity and rewarding imagination. The brand seeks achievers, leaders and visionaries. At NIKE, Inc. it’s about each person bringing skills and passion to a challenging and constantly evolving game.\nNIKE, Inc.’s rapid pace of innovation demands a Legal team that is always on the offense. And they’re always on their game – with the mission to advance and guide Nike’s business through innovative, offense-minded counsel. Nike attorneys, paralegals and other specialists in law provide inventive approaches and superior counsel to Nike’s global business. As Nike changes the future of sport, the Nike Legal team drives competition, ingenuity and integrity in the marketplace.\nLike any winning team, NIKE relies on talented, ambitious individuals to thrive. The Chief Administrative Office (CAO) drives innovation in process, technologies, and services, while fueling NIKE with exceptional levels of support.\nWHO ARE WE LOOKING FOR?\nWe need an Assistant General Counsel, Digital Product to join us at NIKE’s World Headquarters in Beaverton, Oregon, to provide legal support to the Digital Product, Tech and Marketing organizations supporting Nike, Jordan and RTFKT brands. The best AGCs are results-driven, strong teammates, have a bias for action, and an ability to work cross-functionally within a multinational organization.\nWHAT WILL YOU WORK ON?\nOn any given day, you will be advising, counseling, and providing practical and strategic legal advice to business leaders supporting Nike, Inc.’s global consumer digital products and experiences across various consumer-facing channels, including Nike Virtual Studios and RTFKT. This will include identifying and addressing legal, regulatory, and privacy issues related to consumer digital products, including user experiences, technology tools and integrations, communications platforms, third-party digital platforms, and emerging digital technologies, including web3, Metaverse, NFTs, and blockchain technology. You will also be responsible for drafting, reviewing and negotiating a variety of commercial contracts in support of the Digital Product, Tech and Marketing organizations, including end user license agreements and terms, and platform partnerships. You will provide strategic analysis of global legal and brand risks and help set and drive policies and solutions to achieve business objectives efficiently. You will work on a dynamic team in a fast-paced environment and engage with cross-functional teammates and business clients from around the world.\nWHO WILL YOU WORK WITH?\nYou will report to the Sr. Counsel, Digital Product, and you will work closely with your legal colleagues in Marketing & Digital Product, Privacy, Intellectual Property and others, including those in other geographies, as well as with outside counsel. On the daily, you will provide legal support to Nike Virtual Studios, including RTFKT, Digital Product, Tech and Digital Design teams, where you will encounter business partners with a variety of communication styles and needs. People will appreciate your ability to be resourceful in the face of ambiguity and to find practical solutions.\n\nWhat you bring to nike\nJuris Doctorate degree\nMember, in good standing, of at least one U.S. State Bar and willingness to commit to membership in the Oregon State Bar\n5-7 years’ experience in the practice of law, with a significant focus on consumer digital products and experiences\nSubstantive knowledge of laws related to consumer protection and privacy\nProven experience representing corporations in commercial transactions and general business law\nExcellent verbal and written skills and the ability to communicate effectively at all levels\nResults driven; proven experience leading strategic projects\nLaw firm experience and experience in a corporate legal department of a consumer digital product organization is preferred\nExperience advising on business practices in a global company is preferred\nProficient in commercial transactions, including content, copyright and trademark licensing, and how specific contract clauses affect digital products and partnerships\nStrong teammate and ability to work cross-functionally in a complex organizational structure\nSound risk assessment capabilities in constantly evolving regulated areas\nDemonstrated ability to learn business requirements quickly, analyze legal and commercial risks, and propose creative, business-oriented solutions\nKnowledge and interest in emerging technologies, and consumer digital innovation, including web4, Metaverse, NFTs, blockchain technology, and virtual goods and gaming\nTechnology and Intellectual Property background a plus\n\nNike requires all applicants for this position to be vaccinated for COVID-19 as a condition of hire. As an equal opportunity employer, Nike will make accommodations to individuals who cannot be vaccinated in accordance with applicable law.\nNIKE, Inc. is a growth company that looks for team members to grow with it. Nike offers a generous total rewards package, casual work environment, a diverse and inclusive culture, and an electric atmosphere for professional development. No matter the location, or the role, every Nike employee shares one galvanizing mission: To bring inspiration and innovation to every athlete* in the world.\nNIKE, Inc. is committed to employing a diverse workforce. Qualified applicants will receive consideration without regard to race, color, religion, sex, national origin, age, sexual orientation, gender identity, gender expression, veteran status, or disability.", "url": "https://www.indeed.com/viewjob?jk=0a678563fdd1d1e8&from=serp&vjs=3"},
{"job_title": "newDepartmental Supervisor 12", "summary": "If so, then the Special Taxes Division may have a perfect career opportunity for you!\nOnline application must contain all detailed education and experience.", "company": "State of Michigan", "location": "Remote in Dimondale, MI", "job_description": "Job Description\nOnline application must contain all detailed education and experience. It will be used as the primary source for the initial review of your application.\nAre you looking for a career opportunity that offers continuous learning as well as a culture that rewards teamwork and initiative? If so, then the Special Taxes Division may have a perfect career opportunity for you!\nTreasury’s Special Taxes Division is looking for a self-motivated, resourceful, and confident individual with a positive attitude to join our team as the Supervisor of our Tobacco Tax Unit. Desired skills are the ability to multi-task, oversee business processes, and supervise employees whose primary function is to review Tobacco Tax returns and applications, as well as provide customer service to Tobacco Taxpayers through verbal and written communication. Familiarity with the Tobacco Tax Act (TPTA) is desirable. Supervisory experience is also desirable since you will oversee the daily activities of the Unit by assigning work to staff, setting priorities, directing work, sponsoring accountability, and encouraging employee ideas. The area is dedicated to engaging employees while fostering growth and providing learning and development opportunities. Special Taxes is comprised of a motivated, innovative, hard-working, and inclusive group.\nIf you are interested in joining our team, please click on the link below to learn more.\nPosition Description (Download PDF reader)\nDepartment of Treasury-Why it's a great place to work. (Download PDF reader)\n\nRequired Education and Experience\nEducation\nEducational level typically acquired through completion of high school.\n\nExperience\nOne year of experience equivalent to a Departmental Supervisor 11 or experienced-level professional; or two years equivalent to a Departmental Supervisor 10, Office Supervisor 11 and 12, Secretary Supervisor 11, experienced-level technician or paraprofessional; or three years equivalent to an Office Supervisor 10, Secretary Supervisor 10, Emergency Dispatch Supervisor 10, or Human Resources Customer Service Supervisor 10.\nAdditional Requirements and Information\nMichigan Department of Treasury is proud to be an equal employment workplace that values inclusion & diversity. In an effort to minimize implicit bias, Treasury is removing/protecting applicant personal identifying information. For best results include detailed education and experience in the online application for review. Do not put “see resume” instead of listing duties under your work experience.\nThis position is eligible for remote work, up to two days per week, however selected candidate must have a safe and appropriate designated workspace or workstation for performance of work and secure and sufficient internet access of commercial cable or wireless broadband with minimum speeds of 25 Mbps download and 5 Mbps upload.\nWork must be performed in the state of Michigan. If you currently reside outside of Michigan, you must relocate to Michigan to perform the duties of this position. Relocation expenses are not reimbursed.\nThe Michigan Department of Treasury participates in E-Verify and will provide the federal government with your form I-9 information to confirm that you are authorized to work in the U.S.\nInterviews will likely occur virtually using Microsoft Teams. No prior experience with Teams is necessary, as instructions and tips will be provided to all candidates scheduled for an interview.\nThis position has a FTIFNPRINT sub-class code. The sub-class code indicates the position has access to Federal Tax Information (FTI) and requires passing of a fingerprint-based background check per IRS Publication 1075.\nView the job specification at: http://www.michigan.gov/documents/DepartmentalSupervisor_12524_7.pdf (Download PDF reader)", "url": "https://www.indeed.com/viewjob?jk=3d3aa5eb4bb3c430&from=serp&vjs=3"},
{"job_title": "Document Clerk", "summary": "This position is responsible for organizing and maintaining pertinent confidential client records.\nThe ideal candidate will have strong customer service skills,…", "company": "Emery Reddy", "location": "Seattle, WA 98101 (Denny Triangle area)", "job_description": "Emery Reddy is a boutique law firm seeking an entry level Document Clerk in our Downtown Seattle office. We are a thriving firm that specializes in plaintiff litigation in the fields of workers’ compensation, employment law, and injury claims. We are passionate about serving our clients and we enjoy doing it! This position is responsible for organizing and maintaining pertinent confidential client records. The ideal candidate will have strong customer service skills, dependability, great attention to detail, and a desire to learn and grow with the firm.\nJob Type: Full-time, In Person\nSalary: $23 per hour\nJob Location: Seattle, WA\nDuties Include:\nOpen, scan, distribute mail\nFile documents electronically\nMaintain organization of electronic files\nRequest medical and public records\nProvide reception back up as needed, answering and directing calls\nOther tasks as assigned by attorneys, case managers, and paralegals\nQualifications Include:\nAssociate or bachelor’s Degree\nHigh attention to detail, strong organizational skills and ability to prioritize\nAbility to work efficiently and independently\nBenefits Include:\nPaid time off\nComprehensive benefit package including medical, dental, vision and 401(k)\nInternal promotions", "url": "https://www.indeed.com/viewjob?jk=a5663d45ed7d759e&from=serp&vjs=3"},
{"job_title": "newQuality Engineer I", "summary": "Develops, modifies, applies and maintains quality standards and protocol for processing materials into partially finished or finished materials product.", "company": "Medtronic", "location": "North Haven, CT 06473+6 locations", "job_description": "Careers that Change Lives\n\nA Day in the Life\nResponsibilities may include the following and other duties may be assigned.\nDevelops, modifies, applies and maintains quality standards and protocol for processing materials into partially finished or finished materials product.\nCollaborates with engineering and manufacturing functions to ensure quality standards are in place.\nDevises and implements methods and procedures for inspecting, testing and evaluating the precision and accuracy of products and production equipment.\nDesigns or specifies inspection and testing mechanisms and equipment; conducts quality assurance tests; and performs statistical analysis to assess the cost of and determine the responsibility for products or materials that do not meet required standards and specifications.\nEnsures that corrective measures meet acceptable reliability standards and that documentation is compliant with requirements.\nMay specialize in the areas of design, incoming material, production control, product evaluation and reliability, inventory control and/or research and development as they apply to product or process quality.\nMust Have: Minimum Requirements\nBachelors degree required\n0 years of experience required\n\nAbout Medtronic\n\n\nTogether, we can change healthcare worldwide. At Medtronic, we push the limits of what technology, therapies and services can do to help alleviate pain, restore health and extend life. We challenge ourselves and each other to make tomorrow better than yesterday. It is what makes this an exciting and rewarding place to be.\n\nWe want to accelerate and advance our ability to create meaningful innovations - but we will only succeed with the right people on our team. Let’s work together to address universal healthcare needs and improve patients’ lives. Help us shape the future.\n\nPhysical Job Requirements\n\nThe physical demands described within the Responsibilities section of this job description are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. For Office Roles: While performing the duties of this job, the employee is regularly required to be independently mobile. The employee is also required to interact with a computer, and communicate with peers and co-workers. Contact your manager or local HR to understand the Work Conditions and Physical requirements that may be specific to each role. (ADA-United States of America)", "url": "https://www.indeed.com/viewjob?jk=b20d584d6ac8351e&from=serp&vjs=3"},
{"job_title": "Associate Counsel, NBA G League", "summary": "While Basketball Operations runs the league’s on-court activities, other departments manage relationships with television and digital media partners, develop…", "company": "the NBA", "location": "New York, NY 10022 (Midtown area)", "job_description": "At the NBA, we’re passionate about growing and celebrating the game of basketball. Through the intensity of the game and the amazing athletic skill of our players, we deliver excitement to hundreds of millions of fans around the world.\nAs a global sports and media business, the NBA is so much more. While Basketball Operations runs the league’s on-court activities, other departments manage relationships with television and digital media partners, develop marketing partnerships with some of the world’s most recognizable companies, oversee the licensing of NBA merchandise, and handle a wide range of responsibilities that drive the NBA’s success.\nThe NBA is committed to providing a safe and healthy workplace. To safeguard our employees and their families, our visitors, and the broader community from COVID-19, and in consideration of recommendations from health authorities and the NBA’s own advisors, any individual working onsite in our New York and New Jersey offices must be fully vaccinated against COVID-19. The NBA will discuss accommodations for individuals who cannot be vaccinated due to a medical reason or sincerely held religious belief, practice, or observance.\nPosition Summary: This position will primarily support the NBA G League's commercial businesses, reporting to the G League General Counsel. The position will be responsible for a variety of matters, including negotiating and drafting sponsorship, media, marketing, licensing, event and services agreements, and providing legal and business support to the NBA G League and its teams generally (including with respect to collective bargaining).\nMajor Responsibility:\nDraft and negotiate league-level sponsorship, media, marketing, licensing, event and services agreements and other agreements supporting the commercial business of the NBA G-League.\nDraft and negotiate technology services agreements and other vendor agreements relating to the business of the NBA G League.\nAdvise in-house clients and G League teams, and draft appropriate communications, on various legal and business matters including IP usage and general compliance with league rules, standards and policies.\nProvide support for (i) the collective bargaining process with the Basketball Players Union, and (ii) general CBA compliance and enforcement.\nPerform special projects and other assignments as requested by G League senior management.\nRequired Skills/Knowledge:\n3-5 years of experience at a leading law firm and/or corporate legal department\nOutstanding written and oral business communication skills\nStrong drafting and negotiating skills\nExperience with commercial transactions\nAbility to work in a fast-paced environment; flexibility and effective time management skills to balance multiple priorities\nCreative problem-solving skills to assist in meeting business needs and seizing new opportunities, while mitigating risk and managing key relationships\nStrong commitment to quality work product and organizational ethics, integrity and compliance\nEducation: Law degree and admission to practice in the State of New York\nWe Consider Applicants For All Positions On The Basis Of Merit, Qualifications And Business Needs, And Without Regard To Race, Color, National Origin, Religion, Sex, Gender Identity, Age, Disability, Alienage Or Citizenship Status, Ancestry, Marital Status, Creed, Genetic Predisposition Or Carrier Status, Sexual Orientation, Veteran Status, Familial Status, Status As A Victim Of Domestic Violence Or Any Other Status Or Characteristic Protected By Applicable Federal, State, Or Local Law.", "url": "https://www.indeed.com/viewjob?jk=a6d9c7542991820d&from=serp&vjs=3"},
{"job_title": "newCorporate Counsel, Cybersecurity", "summary": "The Customer Security & Trust (CST) team’s Digital Security Unit (DSU) is looking for a cybersecurity attorney with experience in cybersecurity, threat…", "company": "Microsoft", "location": "Redmond, WA 98052 (Overlake area)+10 locations", "job_description": "The Customer Security & Trust (CST) team’s Digital Security Unit (DSU) is looking for a cybersecurity attorney with experience in cybersecurity, threat intelligence, and incident response. DSU is a part of Microsoft’s Corporate, External, and Legal Affairs (CELA) organization and leads much of Microsoft’s work to ensure that our customers are protected from the actions of advanced and persistent adversaries. This role will provide expert counsel on a range of advanced cybersecurity issues for legal and security specialist teams inside Microsoft, and in support of teams inside the CST organization.\n\nIn this role, the attorney will work closely with legal teams advising many of the cybersecurity organizations at Microsoft and specialist legal teams, as a resource and subject matter expert on a wide range of cybersecurity laws and best practices. The attorney will also partner with the Microsoft Threat Intelligence Center (MSTIC) on legal issues involving nation state and advanced actor attacks, as well as other MSTIC-related activities. The attorney will provide counsel on advanced incidents for the Microsoft Security Response Center (MSRC) and to teams involved in incidents where deep cybersecurity legal expertise is needed. The attorney will also help document best practices and legal guidance, as well as provide training to other attorneys and teams.\nResponsibilities\nResponsibilities\n\nLegal Advice and Counsel\nActs as the primary legal contact (generalist or subject matter expert) for assigned clients; executes routine to moderate-impact legal matters; provides support (e.g., revises templates, answers client questions about legal process) to higher-level attorneys.\nCollaborate with advanced security teams on projects and agreements that help advance security and trust at Microsoft.\nInteracts with outside counsel or other service providers to address and resolve project-specific issues.\nConducts, reviews, interprets, and analyzes legal information; maintains a basic understanding of legal principles within his or her primary legal practice area.\nServe as a subject matter expert on cybersecurity threat intelligence and incident response for legal teams across Microsoft in the product and services space, as well as for government affairs teams worldwide.\nProvide guidance on commercial agreements and business issues around the world that require advanced cybersecurity legal expertise and scalable approaches.\nSupport DSU work to lead the legal community at Microsoft towards common approaches around threat intelligence and incident response and concerns that mitigate risks and anticipate future challenges.\nCollaborate with clients on the legal implications of technical activities, private sector engagements, government engagements, standards development, and other security related activities.\nSupport engagements with industry and government on advanced cybersecurity issues and challenges, driving resolutions that foster trust in Microsoft’s products, services, and practices.\nReview and provide recommendations on the development of security approaches and laws involving threat intelligence, information sharing, incident response, and other advanced security issues.\nProvide counsel on sophisticated cybersecurity incidents in partnership with the Microsoft Security\nResponse Center and the Microsoft security response community.\nOperational Excellence\nProvide input and continuous feedback to improve process efficiencies within role; identifies opportunities and tools to increase operational efficiency and effectiveness.\nCommunication\nCollaborate effectively within Legal and Corporate Affairs work group and direct business clients.\nOrganize issues and ideas in written and verbal communication.\nOther\nEmbody our culture and values\nQualifications\nRequired/Minimum Qualifications:\nJuris Doctorate Degree or Equivalent International Degree OR Completion of a Legal Apprenticeship.\nActive license to practice law in a jurisdiction and capable of meeting admission requirements in relevant jurisdiction.\n3+ years experience as a practicing attorney with at least 2 years’ experience in cybersecurity or cybersecurity law OR equivalent practice of law.\nU.S. citizen\nAdditional or Preferred Qualifications\n2+ years’ experience with cybersecurity law, incident response, and/or threat intelligence\nCuriosity to understand Microsoft’s security products and services\nSound and practical business judgment, ability to think strategically, and desire to establish a “trusted advisor” relationship with key clients\nHighly motivated, independent, self-starter able to multitask and constantly prioritize in an ever-changing legal and regulatory environment\nAbility to creatively problem-solve with a focus on achieving results that both benefit our business and maintain the trust of our customers and partners\nDesire and ability to work with diverse, global teams and flexibility to occasionally work across time zones other than where the position is based\nU.S. Government security clearance\nThis role may eventually involve domestic and international travel and is based in our Redmond, Washington campus.\nIf hired for this position, the team you would be joining is part of our Cloud organization and/or works with government contracts and as such has a unique background check requirement, detailed below. Please note you will be provided with steps for completing the check if you accept a role on the team.\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\nCitizenship Verification: This position requires verification of US Citizenship to meet federal government security requirements.\nCitizenship Verification: This position requires verification of US Citizenship to meet federal government security requirements.\n#CELA\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.\nBenefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.", "url": "https://www.indeed.com/viewjob?jk=5b67ab72d981214f&from=serp&vjs=3"},
{"job_title": "newData Entry Clerk", "summary": "Under the direction of the Director of Information & Assistance Management and in accordance with GOEA regulations position provides data entry services into…", "company": "EAST BATON ROUGE COUNCIL ON AGING", "location": "Baton Rouge, LA 70806 (Goodwood area)", "job_description": "Position Characteristics:\nUnder the direction of the Director of Information & Assistance Management and in accordance with GOEA regulations position provides data entry services into the NAPIS software.\n\nDuties and Responsibilities:\nReviews Care Manager in-home assessments paperwork for entry into Wellsky/SAMS.\nPrint out completed initial assessment, re-assessments and congregate assessments from Wellsky/SAMS.\nEnsure accurate data is entered into various agency systems including but not limited to Wellsky/SAMS, Senior Stat, Power to Care, etc.\nComplete data entry for senior clients in the Senior Stat system that receive congregate meals and ensures creation of a Senior Stat Card.\nReviews NAPIS inputs for accuracy and informs Director of Information and Assistance Management of any problems regarding workflow or compliance.\nDirectly manages the file maintenance program for Information and Assistance and conducts periodic audits to insure compliance.\nPrepares route sheets and reconcile meals for Meals on Wheels.\nHelps in cleaning up computer files and resolving duplicates.\nPrepares membership lists.\nPerforms data entry for assessments, utility assistance, chores, shopping, Meals on Wheels, etc.\nChecks reports, data input and records for accuracy.\nFiles and indexes programs, operating manuals, machine instructions, diagrams and flow charts, and other materials related to the computer.\nPerforms miscellaneous clerical tasks relating to system procedures such as filing and coding.\nProvides daily, weekly, monthly and quarterly reports as required to the Director of Information and Assistance Management, Director of Operations, Executive Director and required governmental officials on the status of Information and Assistance programs.\nAny other duties deemed necessary.\n\nKnowledge, Skills and Abilities:\n\nKnowledge of and orientation to the philosophy of EBRCOA as presented in Mission/Philosophy statement.\nAbility to establish and maintain a positive and professional relationship with co-workers, clients and visitors; cultural sensitivity and ability to relate well and effectively in diverse workplace and with a diverse client population. Able to comfortability and respectfully serve the special needs of an elder client population.\nAbility to communicate and interact both verbally and written.\nAbility to work in a fast-paced work environment.\nAbility to follow oral and written instructions.", "url": "https://www.indeed.com/viewjob?jk=92cce8b581f78805&from=serp&vjs=3"},
{"job_title": "newContract Specialist", "summary": "The DC Office of Contracting and Procurement (OCP) provides contracting services for client agencies and offices in the District.", "company": "Government of the District of Columbia", "location": "Washington, DC+1 location", "job_description": "Join a dynamic public agency proudly serving the over 700,000 residents of the District of Columbia. The DC Office of Contracting and Procurement (OCP) provides contracting services for client agencies and offices in the District. The mission of OCP is to partner with vendors and District agencies to purchase quality goods and services in a timely manner and at a reasonable cost, while ensuring that all purchasing actions are conducted fairly and impartially. OCP manages the acquisition of over $5.7 billion in goods, services, and construction annually on behalf of 79 District agencies. OCP is powered by a diverse team of innovative professionals committed to helping our client agencies reach their goals and accomplish their missions. In addition to contracting and procurement services, OCP’s Surplus Property Division collects, manages, and reuses District-owned and federal surplus property.\nOCP’s most important resource is our people. We are committed to attracting the best and brightest talent and support them by creating an environment that allows them to do their best work.\nThe Office of Contracting & Procurement supports the District with acquisition support services and may support positions in the following functions:\nHealth & Human Services (HHS) seeks to empower every District resident to reach their full potential by providing meaningful connections to work opportunities, economic assistance and varying supportive services for the health & welfare of our District residents.\nOffice of Chief Technology Officer (OCTO) develops, implements, and maintains the District’s IT and telecommunications infrastructure; develops and implements major citywide applications; establishes and oversees IT enterprise architecture and website standards for the District; and advises District agencies on technology solutions to improve services to businesses, residents and visitors in all areas of District government. Persons in this area would support the District purchasing efforts.\nGovernment Operations supports a wide range of commodities and services throughout the District. Persons working in this area will interface with the key stakeholders not limited to the Office of the Mayor, City Administrator, and the Wilson Building.\nPublic Safety provides collaborative support to Metropolitan Police (MPD), Fire & Emergency Medical Service (FEMS), Homeland Security & Emergency Management Agency and Office of Unified Communications (OUC) to name a few with purchases of supplies, equipment and other service needs.\nThe Department of Transportation & Infrastructure cluster is committed to providing environmentally sustainable transportation solutions. DDOT continues to practice and promote environmental excellence as it fulfills its mission to enhance the quality of life for the District of Columbia residents and visitors by ensuring that people, goods and information move efficiently and safely, with minimal adverse impacts on residents and the environment.\nThe Education cluster provides collaborative support to the Office of the State Superintendent (OSSE) and the Department of Employment Services (DOES) in the procurement of supplies, equipment and other service needs.\nThis announcement will be used for both current and future vacancies. The positions may be in various offices, units and/or procurement services bureaus of the Office of Contracting and Procurement and work under the direct supervision of the Supervisory Contract Specialist.\nDuties and Responsibilities:\nThe incumbent will apply a wide range of contracting methods and contract types to plan and carry out pre-award and post-award procurement actions including cost/price analysis using techniques such as cost estimating to evaluate a contractor’s proposal and prepare a pre-negotiation position. Incumbents will have knowledge of the 27 DCMR, Federal contracting procedures, small purchasing procedures and procedures for negotiated services contracts. Incumbent will use automated procurement support systems to process actions.\nQualifications and Education:\nMust have a bachelor’s degree OR at least 24 semester hours in any combination of the following fields: accounting, business, finance, law, contracts, purchasing, economics, industrial management, marketing, quantitative methods, or organization and management\nAND\nOne (1) year of specialized experience equivalent to the CS-09 grade level. Specialized experience is defined as experience that has provided the knowledge, skills, and abilities to successfully perform the work of the position.\nLicenses and Certifications:\nNone\nWorking Conditions/Environment:\nThe work environment includes an office setting and the work area is adequately lighted, heated, and ventilated.\nThe Government of the District of Columbia values the safety of our employees, our residents, and our visitors. In support of these values, if you are selected for this job you must be fully vaccinated against COVID-19, except when vaccination is not medically advised or violates your sincerely held religious beliefs. If you are invited to join our team, you must submit proof that you are fully vaccinated against COVID-19 to the HR Representative or you must request an exemption from your representative.\nOther Significant Facts:\nTour of Duty: Monday – Friday 8:30am to 5:00pm\nPromotion Potential: Career Progression to Grade 12\nCollective Bargaining Unit: This position is covered by a Collective Bargaining Agreement.\nDuration of Appointment: Career Service Full-Time\nPay Plan, Series and Grade: CS-1102-11\nPosition Designation: This position has been deemed Security Sensitive under the guideline of the DC Personnel Manual. Incumbents of this position are subject to enhanced suitability screening pursuant to Chapter 4 of DC personnel regulations. Accordingly, incumbents must successfully pass a criminal background and consumer credit check as a condition of employment and will be subject to periodic criminal background checks for the duration of their tenure.\nEEO Statement: The District of Columbia Government is an Equal Opportunity Employer. All qualified candidates will receive consideration without regard to race, color, religion, national origin, sex, age, marital status, personal appearance, sexual orientation, family responsibilities, matriculation, physical handicap, or political affiliation.", "url": "https://www.indeed.com/viewjob?jk=df2d1dd7e3e1265a&from=serp&vjs=3"},
{"job_title": "newAWS Cloud Computing Specialist + Apprentice", "summary": "In this role, you will help companies seamlessly migrate information and service into the cloud utilizing Amazon Web Services (AWS).", "company": "New Apprenticeship", "location": "Remote in Richardson, TX+3 locations", "job_description": "AWS Cloud Computing SpecialistIn this role, you will help companies seamlessly migrate information and service into the cloud utilizing Amazon Web Services (AWS). You will be responsible for supporting the company’s cloud adoption, suggesting operational/security improvements, and promoting additional AWS services that will benefit the company. The Cloud Computing Specialist ensures client satisfaction and uncovers additional areas of AWS consumption/services opportunities.This opportunity is for early-career starters interested in breaking into the tech industry while gaining real-world experience. We believe in the earn-while-you-learn model, so you will work full-time with an AWS partner company while also participating in NEW's AWS Cloud Apprenticeship program. The apprenticeship is 100% remote and offers small cohorts, learning hands-on from industry experts, certifications, portfolio building, career coaching, mentoring, plus the ability to earn additional credits towards a bachelor's degree. As part of your employment benefits with our partner company, you can complete the apprenticeship at no cost to you.For more information about this opportunity visit our page here: https://hubs.la/Q013zm8b0Eligibility Requirements: Experience with Microsoft Office tools, creating/maintaining excel spreadsheetsAttention to detail and problem-solving abilityAbility to analyze data and communicate ideas clearlyPrior experience with Python or the ability to learn quicklyDemonstrated interest in IT and/or cloudImportant Note: Our apprenticeship is designed to provide a pathway to a successful tech career where opportunities traditionally do not exist. Therefore, we must insist that all applicants have not yet completed their Bachelor’s degree.Job Responsibilities:  May vary based on individual roles. These may include but are not limited to:Debug existing software and correct defects.Assist in seamless information migration to the cloud platformProvide recommendations for improving documentation and software development process standardsDevelop simple data queries for existing or proposed databases or data repositories.Integrate existing software into new or modified systems or operating environments, to include Cloud technologies.Serve as the cloud platform point-of-contact for reactive post sales cloud platform activities.Coordinating customer onboarding company portal and cloud consoleReview Cloud account management & governance best practices for at risk customersUncovering areas of future Cloud growth and position AWS capabilitiesProvide assistance in defining cloud platform account strategy based on company business goalsDrive services activity & pipeline by understanding customer needs and positioning relevant AWS solutions and servicesNew Apprenticeship: In addition to working with one of our partner companies, the right candidate will spend 10-15 hrs per week participating in the New Apprencticeship's AWS Cloud Apprenticeship program. Apprentices receive accelerated Cloud upskilling through expert training, mentoring, and coaching. There is no cost for the apprenticeship program. It is included as a benefit of employment.Why become an Apprentice: As an apprentice, you'll start with a cohort of around ten apprentices and complete the program over 12 months. You will also receive support from top industry coaches and mentors to progress through your personal and professional goals, skills roadmap, while also demonstrating new knowledge and competencies through hands-on application with your portfolio project.You'll complete milestones along the way like earning digital certifications to validate your skills, module portfolio projects, individual portfolio projects, while also working with other apprentices to participate in ongoing training and development focused on your professional and technical skills.Best of all, you are a contributing member of your cohort team, putting forward ideas, taking on responsibilities, and making choices about how you will make the apprenticeship experience your own all while applying what you learn weekly in your new role.Interview Process: All applicants will go through the New Apprenticeship interview process, which includes an application, a short project (if applying without prior Python experience), and an interview with a graduate of the program.Accepted candidates will have an additional interview directly with our partner company's hiring managerJob Type: Full-timePay:  $35,000.00 - $50,000.00 per yearBenefits: It will vary depending on the hiring companySchedule: 8-hour shiftJob Type: Full-timePay: $35,000.00 - $50,000.00 per yearSchedule:8 hour shiftMonday to FridayWork Location: One location", "url": "https://www.indeed.com/viewjob?cmp=New-Apprenticeship&t=Aws+Cloud+Computing+Specialist+Apprentice&jk=b8b8ac2c050fa722&vjs=3"},
{"job_title": "newParking Enforcement Officer", "summary": "Full Time / Part Time Available*.\nCome join the elite squad of parking enforcement professionals and make great money booting vehicles in the Atlanta area.", "company": "Empire Parking Services", "location": "Atlanta, GA", "job_description": "Overnight Parking Enforcement Officer Overnight Parking Enforcement Officer Full Time / Part Time AvailableWe have morning, evening, and overnight positions available. Since we operate 24/7, our scheduling is very flexible. You inform us of your availability, and we plug you into our schedule, simple as that. Come join the elite squad of parking enforcement professionals and make great money booting vehicles in the Atlanta area. Empire Parking Services is a professional parking enforcement company that enforces parking regulations on private property. We immobilize (boot) vehicles that park illegally on private property and charge the vehicle owner a fee to remove the immobilization device.Military Veterans or Active Military, Law Enforcement, Correctional Officer, Vehicle Towing , Security Guards, Parking Enforcement Officer experience is a plus.Receive complete training, uniform, and all equipmentFlexible Hours - allows you to be in control of the amount of money you make.MUST HAVE:Valid Driver’s LicenseReliable TransportationMust be able to handle stressful situations in a professional mannerCannot be a convicted felon or charged with a felony.What is the Booting Process? A vehicle immobilization device, also known as a “boot”, is a wheel clamp that can be easily applied and removed only by a parking enforcement technician.When a vehicle is booted, the technician will also apply an orange sticker on the driver side window to alert the vehicle’s owner that it has been immobilized. The Empire Parking 24-hour call center phone number is located on the orange sticker. When the parking violator calls the number, our call service operator will dispatch a technician to the location to remove the boot for the designated fee. Once the boot is removed, the parking violator leaves the premises and has learned a valuable lesson without emptying their wallet. Other potential parking violators also notice the boot and orange sticker and this acts as a visual deterrent to notify them not to park and leave the property.Job Types: Full-time, Part-timePay: Up to $60.00 per hourBenefits:Flexible scheduleSchedule:8 hour shiftMonday to FridayNight shiftOvertimeWeekend availabilitySupplemental Pay:Commission payExperience:Military: 1 year (Preferred)Security: 1 year (Preferred)License/Certification:Driver's License (Required)Work Location: Multiple Locations", "url": "https://www.indeed.com/viewjob?cmp=Empire-Parking-Services&t=Parking+Enforcement+Officer&jk=f07f37bfb49e2b05&vjs=3"},
{"job_title": "Employee Information Systems Clerk - (Immediate Opening)", "summary": "Years of experience: 1-3 years of experience in a technical customer support role preferred.\nIDEA Public Schools is seeking an Employee Information Systems…", "company": "IDEA Public Schools", "location": "Remote in Weslaco, TX+6 locations", "job_description": "Position Overview:\nIDEA Public Schools is seeking an Employee Information Systems Clerk to join our growing Information Systems team. As an Employee Information Systems Clerk, you will report to the Absence & Time Management Application manager and support the Absence & Time Management team to ensure the reliable operations of our Absence & Time Management application, Frontline. The Employee Information Systems Clerk will support the setup, maintenance, reporting, and configuration of Frontline. Further, the Employee Information Systems Clerk will support by providing end user customer service through Zendesk in support of Frontline.\nAs a member of the national team, you will support 11 regions across 5 states to achieve customer service and service level agreement goals while maintaining a high degree of data accuracy. You will be a subject matter expert in the support of Absence & Time Management applications and serve as a steward to stakeholders across the organization.\nThis is a full-time, immediate opening based in Texas. While this is a remote role, preference will be given to candidates who live in Austin, El Paso, Greater Houston, Permian Basin, Rio Grande Valley, San Antonio, or Tarrant County, or who are willing to relocate.\nCompensation & Benefits:\n Compensation for this role is set at an hourly rate ranging between $14.56 for 0 years of experience and $18.20.\nAdditionally, we offer medical, dental, vision, and supplemental benefits as well as retirement plans and a generous vacation package. You can find more information about our benefits at https://ideapublicschools.org/careers/benefits/.\nIn this role you will:\nSupport the maintenance, configuration, permissions, and reporting of our Absence Management, and Time & Attendance Platforms\nTrack customer service tickets to identify trends and develop training to address those trends\nTroubleshoot application issues for specific employee or employee groups and work with the vendor and internal stakeholders to resolve issues\nProvide Tier 1 Support, in partnership with the Help Desk Clerk, for the Absence and Time & Attendance applications by processing all tickets within 2 business days including, but not limited to: assigning manager visibility, assigning employee types to visibility profiles, reviewing leave balances, sending absence reports for employee groups, managing COVID leave balances and absences\nCreate new hire employee profiles in Frontline via import and feeds between Tyler Munis and Frontline\nAllocate leave balances for all employees as part of the new hire set up and rollover process\nVerify that personnel changes are entered on time and accurately\nResponsible for day-to-day management of employee access & permissions\nAssist the Application Manager and Application Administrator with the annual employee rollover, including adjusting leave balances for new year accruals, updating system calendars, and conducting audits\nCommunicate service impact incidents and support the development of action plans to identify and address root causes\nPartner and collaborate with the Application Manager and external organizations, such as our substitute management vendor, to define and execute processes and system setup and day to day operations\nSetup and maintain substitutes in Frontline, ensuring that they have the access and knowledge they need to pick up assignments in support of our substitute fill rate goal\nHere’s what we hope you’ll bring:\nEducation: Bachelor’s degree preferred. Relevant experience or an equivalent combination of education and experience is also acceptable\nCertifications: Frontline Absence Management or Frontline Time & Attendance Certification preferred\nYears of experience: 1-3 years of experience in a technical customer support role preferred\nRequired technology: Proficient in Microsoft Office, advanced Microsoft Excel experience preferred\nGoals:\nIndividual Contributor Language – As part of the Employee Information Systems team, you will contribute to reaching the following ambitious goals:\n95% Customer Satisfaction for Frontline tickets in Zendesk\n95% of Zendesk tickets are responded to within 1 business day and resolved within 2 business days\n95% of New Hires will be processes within 2 business days of the effective date or 2 business days, whichever is later\n95% Employee Data Accuracy as measured by quarterly audits\n95% SLA Compliance\nDiversity, Equity, and Inclusion\nAt IDEA we recognize that racism, bias, and privilege exist in society. We are committed to an organizational culture that promotes awareness, kindness, and inclusivity for our students and staff, and supports their path to positively impact our broader society. We are committed to recognizing the impact of racism and privilege, and commit as an organization to have equitable practices, policies, and structures.\nVisit https://ideapublicschools.org/dei/ to learn about IDEA’s Diversity, Equity, and Inclusion Anti-Racist and Anti-Bias commitment.", "url": "https://www.indeed.com/viewjob?jk=de192c1c357d5c35&from=serp&vjs=3"},
{"job_title": "newVerification Specialist", "summary": "Work hours: Full-time, 40 hours weekly, Monday-Friday 930 am-6pm.\n1 Year Experience in a healthcare field, customer service, telemarketing, or call center…", "company": "Texas Health Resources", "location": "Remote in Arlington, TX", "job_description": "Verification Specialist\nWe’re looking for a qualified Verification Specialist like you to join our Texas Health family.\nPosition Highlights\nWork location: 612 East Lamar Blvd, Arlington, TX 76011 (Remote)\nWork environment: Office & Clerical\nWork hours: Full-time, 40 hours weekly, Monday-Friday 930 am-6pm\nSalary range: Min $15.57 – Max $25.08 per hour (based on relevant experience)\nAt Texas Health Resources, our mission is “to improve the health of the people in the communities we serve.”\nWe are one of the largest faith-based, nonprofit health systems in the United States with a team of more than 23,000 employees of wholly owned/operated facilities plus 2,200 employees of consolidated joint ventures in the greater Dallas Fort Worth area. Our career growth and professional development opportunities are top-notch and our benefits are equally outstanding.\nQualifications\n1 Year Experience in a healthcare field, customer service, telemarketing, or call center environment Req\nWorking knowledge of Medical Terminology Req\nInsurance verification knowledge Pre\n1-year Experience in Radiology Authorizations Pre\nLicenses and Certifications\nCHAA - Certified Healthcare Access Associate Upon Hire Req\nSkills\nRequires good written, oral, and telephone communication skills.\nRequires knowledge of general office equipment, PCs, and associated software packages.\nAbility to type 35 WPM corrected for errors preferred.\nGeneral knowledge of medical terminology preferred.\nPosition Responsibilities\nCompletes verification and pre-certification processes for pre-admitted/admitted/discharged patient accounts in compliance with productivity and accuracy requirements set forth by Patient Access leadership.\n\nCommunicates with patients, Utilization Review, Financial Counselors, etc. regarding out of network coverage, inactive benefits, or items requiring special attention.\n\nUtilizes tools such as VoiCert, PixCert, Monitored Call, NEBO, ECARE, etc. to complete verifications, precertifications, and notifications as required and ensure the system maxims revenue for the account.\n\nStays abreast of and complies with applicable regulations, entity and/or system policies and procedures. Maintains customer service and/or productivity guidelines set forth by applicable leadership.\n\nCompletes other duties as assigned.\nWhy Texas Health\nAt Texas Health, our people make this a great place to work every day. Our inclusive, supportive, people-first, excellence-driven culture makes it a great place to work.\nHere are a few of our recent awards:\n2021 FORTUNE Magazine’s “100 Best Companies to Work For®” (7th year in a row)\nBecker's Healthcare \"150 Great Places to Work in Healthcare\" (4 years running)\n“America’s Best Employers for Diversity” list by Forbes\nA “100 Best Workplaces for Millennials\" by Fortune and Great Place to Work®\nExplore our Texas Health careers site for info like Benefits, Job Listings by Category, recent Awards we’ve won and more.\nDo you still have questions or concerns? Feel free to email your questions to recruitment@texashealth.org", "url": "https://www.indeed.com/viewjob?jk=97f8f24510e85e12&from=serp&vjs=3"},
{"job_title": "newCare Management Assistant - Scheduling - Part Time - REMOTE", "summary": "Flexible hours - Monday-Friday *approximately 4 hours per day*, but start and end time is flexible to your schedule!\nHigh school or equivalent (Preferred).", "company": "Welcome Home House Calls", "location": "Remote in Arizona", "job_description": "WHO WE ARE: Welcome Home House Calls (Welcome Home) is an innovative company providing in-home care to patients recently discharged from a hospital setting. Our Nurse Practitioners ensure the transition back home and return to daily activities is done with a focus on patient health. Our patients enjoy the convenience and privacy of in-home care while they transition back to their routine care providers.WHAT WE DO: By sending our incredible team of dedicated professionals into the homes of those most in need, we are able to significantly improve the quality of care and recovery of each of our patients.WHAT WE NEED: A dedicated professional with strong communication skills and a desire to help people improve their health. We are looking for someone trustworthy and accountable, capable of independently accomplishing a daily goal.PRIMARY RESPONSIBILITIES Conduct welcome calls to introduce new patients to our programCommunicate with patients and families to schedule patient visitsUse scheduling software to optimize provider schedules and ensure appropriate patients are seenProvide updates and directions to community agenciesJOB DESCRIPTION Flexible hours - Monday-Friday approximately 4 hours per day, but start and end time is flexible to your schedule!Remote work - This position is primarily remote, but some pre-scheduled office time will be required.DESIRED QUALIFICATIONS Strong interpersonal and communication skillsAbility to work independently2+ years healthcare or scheduling experienceCertification, Associates, or Bachelors in related field a plusCOMPENSATION $16-$20 per hour DOEBenefits available, with company subsidized health insurance and a wide selection of plansIf you believe you are a match for this position, and want to join an exciting healthcare organization, apply today!Job Type: Part-timePay: $16.00 - $20.00 per hourBenefits:401(k)401(k) matchingDental insuranceDisability insuranceFlexible scheduleHealth insuranceLife insurancePaid time offVision insuranceSchedule:Monday to FridayCOVID-19 considerations:Remote position. Work from home!Education:High school or equivalent (Preferred)Experience:Customer service: 1 year (Required)Healthcare: 1 year (Preferred)Living/Working in Phoenix-Metro Area: 1 year (Required)Work Location: Multiple Locations", "url": "https://www.indeed.com/viewjob?cmp=Social-Work-Associates-LLC&t=Care+Management+Assistant&jk=c3424765f65cf1b1&vjs=3"},
{"job_title": "Administrative Clerk - NASA Balloon Ground Station Monitorin...", "summary": "The Columbia Scientific Balloon Facility is hiring temporary workers for ground station monitoring.\nThe position will require passing the NASA background check.", "company": "Peraton", "location": "Palestine, TX", "job_description": "Peraton Overview\n\nPeraton drives missions of consequence spanning the globe and extending to the farthest reaches of the galaxy. As the worlds leading mission capability integrator and transformative enterprise IT provider, we deliver trusted and highly differentiated national security solutions and technologies that keep people safe and secure. Peraton serves as a valued partner to essential government agencies across the intelligence, space, cyber, defense, civilian, health, and state and local markets. Every day, our employees do the cant be done, solving the most daunting challenges facing our customers.\nResponsibilities\n\nThe Columbia Scientific Balloon Facility is hiring temporary workers for ground station monitoring. Once a balloon is launched the ground station monitoring begins and runs 24/7 until the mission is terminated. The position will require passing the NASA background check. The work requires performing a series of routine tasks to monitor the balloon.\nQualifications\n\nRequires High School level reading, writing, and analytical skills. 0 to 1 year of experience.\n\nNASA Balloon Operations GSE Monitor\nProvide support in monitoring ground station equipment.\nShifts: 1 st , 2 nd and 3 rd\nJob will start as on-call and lead into continuous support for the duration of the balloon campaign.\nComputer knowledge required.\nHS diploma or equivalent required.\nBackground check required.\nFor Colorado Residents\nColorado Salary Minimum: $21,132.80\nColorado Salary Maximum: $45,177.60\n\nThe estimate displayed represents the typical salary range for this position, and is just one component of Peraton's total compensation package for employees. Other rewards may include annual bonuses, short- and long-term incentives, and program-specific awards. In addition, Peraton provides a variety of benefits to employees.", "url": "https://www.indeed.com/viewjob?jk=86951e97d40e93e7&from=serp&vjs=3"},
{"job_title": "Clinical Data Specialist (Remote)", "summary": "Pay Rate: $37.80/hr*.\nNewkleo is hiring a Clinical Data Specialist for one of their clients in Trenton, NJ*.\nFamiliar with Electronic Lab Reporting (ELR).", "company": "Newkleo LLC", "location": "Remote in Trenton, NJ", "job_description": "Title: Clinical Data Specialist (Remote)Pay Rate: $37.80/hrLocation: Trenton, NJ (Remote)Type: Contract 6 monthsHours: 35 hrs/wk Newkleo is hiring a Clinical Data Specialist for one of their clients in Trenton, NJWork Experience Required: Familiar with Electronic Lab Reporting (ELR)Health data analysis experience, health data entry skills, understanding of laboratory results and familiarity with different lab methodologies.Experience with Microsoft Excel and/or other data analysis softwareDuties: Acts as a liaison with COVID-19 vaccine providers.Provides updates and information regarding data systems on provider calls, to local health agencies, and to office of commissioner.Disseminate information to providers regarding the systems including registration information, initial access/login information, and system instructions.Coordinate and lead meetings with providers and other stakeholders.Education Required: Master degree required.Job Types: Full-time, ContractPay: $36.00 - $37.00 per hourSchedule:Monday to FridayEducation:Master's (Preferred)Work Location: One location", "url": "https://www.indeed.com/viewjob?cmp=Newkleo-LLC&t=Clinical+Data+Specialist&jk=ac0beac8cc1a19ee&vjs=3"},
{"job_title": "newCorporate Counsel", "summary": "Sentral is establishing a new category in urban living that reimagines the way people live, travel, and work.\nThis position is remote based in the United States…", "company": "Sentral", "location": "Remote", "job_description": "Company Overview\nSentral is establishing a new category in urban living that reimagines the way people live, travel, and work. This new category, called Home+, combines the comforts of home with the adventure of travel. Offering both designer furnished and unfurnished homes with flexible lengths of stay, Sentral enables residents to live or visit stylish buildings in the nation's most coveted cities for any period of time, whether a night, a month or multiple years. Qualifying residents can also monetize their homes through Sentral's managed home share program, enabling them to offset 25 percent or more of their total rent while they travel and explore the world.\nOur core values reflect our commitment to our employees, as we elevate humanity and make one another better. We strongly believe in continuous personal improvement, career growth, and diversity in our workforce. With ongoing learning & development offerings, leadership coaching and mentorship programs, we foster an empowered environment rooted in empathy and growth. Our colleagues are curious explorers who never stop learning and who strive for great outcomes.\nCore Values (our what)\nElevate Humanity\nMake each other better\nGreat outcomes matter most\nService Pillars (our how)\nEmpowerment\nEmpathy\nExploration\nhttps://www.sentral.com/\nPosition Overview\nAt Sentral, we are building a team of people-first focused individuals who thrive on going above and beyond. Ideal candidates will exemplify a good sense of humor, a positive attitude, a growth mindset, and an entrepreneurial drive. Sentral seeks a Corporate Counsel with a multifamily or hospitality background and demonstrated interest in technology and innovation, coupled with a strong desire to execute management plans across a national portfolio. The ideal candidate possesses an entrepreneurial drive, self-awareness, and the ability to thrive in a dynamic environment with limited structure.\nThis team member will assist with all aspects of the Legal Department, with a focus initially on Landlord/Tenant Law. This position is remote based in the United States. This role would be ideal for someone looking for an opportunity to work in an entrepreneurial high growth company. Success in this role involves the ability to learn quickly and support the execution of business plans while continuing to take on increased responsibility. The position reports to the Associate General Counsel but the position's key customer is our Operations group.\nRepresentative Responsibilities:\nProvide legal advice and service by combining skill and knowledge in multifamily and hospitality, real estate law, and corporate law with sound business acumen and judgement of business goals and objectives of the company or assigned business units\nProvide guidance and advice on legal aspects of leasing and other general real estate matters\nProvide general legal advice related to leasing and property operation matters that may arise from time to time\nEngage with cross functional departments to meet goals. Pursue details and achieve closure on transactions and various matters and projects. Provide excellent client service\nEnsure legal and regulatory compliance for short-term and long-term rental operations\nUse business and legal judgment to balance an appropriate level of risk against the business needs in a particular situation. Operate within the framework of allowable corporate behavior and governance, and legal and regulatory compliance\nSupervise and actively direct outside counsel and any local governmental lobbying efforts\nParticipate in the development and interpretation of company operating policies and procedures\nWork closely with business clients and outside counsel to ensure adherence to important corporate and regulatory policies\nDraft templates and write, review or revise contract documents. May analyze legislation that impacts the company and assist the company in responding to inquiries from Congress and government agencies\nPrepare and manage a due diligence budget. Coordinate with internal departments to ensure proper tracking and accounting of legal due diligence expenses\nSkills and Experience:\nBachelor's Degree and a JD from accredited universities with strong academic performance\nLicensed to practice law in at least one state\n5+ years of related experience with multifamily or hospitality preferred\nExperience providing coordination and oversight of outside counsel\nExperience working independently in fast-paced environment\nExperience communicating with clients and building trusted advisor relationships\nExperience working in a collaborative legal or business environment\nExemplary computer skills with a demonstrated ability to learn new technologies\nAbility to multi-task with exceptional time management, prioritization, and attention to detail\nExcellent verbal and written communication skills to various audiences\nExtremely high integrity, dependability, accountability, and respect. Takes ownership of tasks and pride in work product\nSentral's compensation package includes base salary, robust health & wellness insurance, travel program, paid time off, and much more.\nAt Sentral we serve a diverse set of communities. We welcome and encourage applicants from all backgrounds to apply.\n#LI-AA1\n#LI-Remote", "url": "https://www.indeed.com/viewjob?jk=2d81e653e2d71a12&from=serp&vjs=3"},
{"job_title": "Technology Companies Corporate Associate", "summary": "Candidate must have general experience both working in teams and in managing substantial components of transactions independently, along with specific…", "company": "Goodwin Procter LLP", "location": "New York, NY+94 locations", "job_description": "Goodwin seeks a highly qualified class of 2016 - 2014 associate to join our Technology Companies group. Candidate must have general experience both working in teams and in managing substantial components of transactions independently, along with specific experience representing technology companies in a broad range of corporate and transactional matters, including early and late-stage venture financings, mergers and acquisitions, and private and public offerings.", "url": "https://www.indeed.com/viewjob?jk=d35bccf69a5e3cd7&from=serp&vjs=3"},
{"job_title": "IT SUPPORT SPECIALIST I", "summary": "Associates degree, or 60+ hours towards a Bachelor’s degree or accredited trade school, or equivalent education and experience.", "company": "City of Richardson, TX", "location": "Richardson, TX", "job_description": "Job Title: IT SUPPORT SPECIALIST I\nDepartment: INFORMATION TECHNOLOGY\nPositions Available: 1\n\nSalary Growth Range (monthly): $4261.00 to $6277.00\nSalary Growth Range (hourly): $24.58 to $36.21\nCivil Service Type: Civil Service\n\nDescription Summary\n\nAssociates degree, or 60+ hours towards a Bachelor’s degree or accredited trade school, or equivalent education and experience. Valid Texas driver’s license, Class “C”, required. Prefer one (1) year experience installing and supporting PC hardware/software in a Windows environment, working with computers, network equipment, or similar technology.", "url": "https://www.indeed.com/viewjob?jk=bcb1ffce94b8589a&from=serp&vjs=3"},
{"job_title": "newR&D Engineer II", "summary": "As R&D Engineer II, you will be part of our Electrophysiology catheter research and development team focused on delivering the future in diagnostic, imaging,…", "company": "Abbott Laboratories", "location": "Plymouth, MN+6 locations", "job_description": "Abbott is a global healthcare leader that helps people live more fully at all stages of life. Our portfolio of life-changing technologies spans the spectrum of healthcare, with leading businesses and products in diagnostics, medical devices, nutritionals, and branded generic medicines. Our 109,000 colleagues serve people in more than 160 countries.\nR&D Engineer II – Electrophysiology Plymouth, MN\nLeading an active lifestyle is important to the many people we serve. In Abbott’s Electrophysiology division, we’re advancing the treatment of heart and vascular disease through breakthrough medical technologies, allowing people to restore their health and get on with their lives.\nAs R&D Engineer II, you will be part of our Electrophysiology catheter research and development team focused on delivering the future in diagnostic, imaging, and ablation therapy catheters. This role may involve a range of responsibilities including but not limited to 3D CAD models and documentation, design analysis, material research, prototype design, build and bench testing, design of test fixtures and test method development, preclinical testing, manufacturing support and interface with the R&D and cross functional product development team\nDuties and Responsibilities:\nUtilize multidisciplinary engineering knowledge and experience to design and develop new products specific for catheter-based technology.\nProvides guidance for the design and development of company products.\nWorks closely with product development team to establish product development goals while ensuring market compatibility\nPlan, schedule and coordinate project tasks and activities.\nEffective communication skills with cross functional and R&D team members.\nUtilize structured problem-solving approaches to resolve design investigations during development\nConceive and build working prototypes.\nRun empirical and experimental analysis utilizing various analytical design tools.\nWork with outside consultants, vendors, machinists and the medical community.\nSupport bench / animal testing and clinical evaluations.\nEstablish product requirements and specifications.\nEstablish test methods and conduct model development, as needed\nCreate and maintain 3D CAD models, assemblies and prints\nEnsure compliance with procedural and documentation requirements of Abbott, FDA , ISO and other regulatory bodies.\nExperience and Education Requirements:\nBachelor’s degree in Mechanical Engineering/related degree\n2+ years of engineering experience, preferably in Research & Development engineering in medical device or other highly regulated industry/ Master’s degree may substitute for one year of experience\nStrong verbal and written communications with ability to effectively communicate at multiple levels in the organization\nAbility to work within a team and as an individual contributor in a fast-paced, changing environment.\nAbility to work in a highly matrixed and geographically diverse business environment.\nAbility to multitask, prioritize and meet deadlines in timely manner.\nStrong organizational skills, as well as attention to detail.\nPreferred Qualifications\nMasters degree in Mechanical Engineering/related degree (May substitute for experience) with 1+ years of engineering experience\nPhD in Mechanical Engineering/related degree, or equivalent years of experience\nExperience with a variety of manufacturing processes and designing for manufacturability.\nExperience collaborating with suppliers in the design and procurement of development contracts\nAbility to leverage and/or engage others to accomplish projects\nExperience in designing and testing electrophysiological, mapping & catheter ablation, or related medical devices.\nExperience working in a broader enterprise/cross-division business units model\nExperience in designing electro-mechanical devices.\nAcademic GPA: 3.0 plus\nWHAT WE OFFER\nAt Abbott, you can have a good job that can grow into a great career. We offer:\nTraining and career development, with onboarding programs for new employees and tuition assistance\nStudent Loan Repayment Program\nFinancial security through competitive compensation, incentives and retirement plans\nHealth care and well-being programs including medical, dental, vision, wellness and occupational health programs\nPaid time off\n401(k) retirement savings with a generous company match\nThe stability of a company with a record of strong financial performance and history of being actively involved in local communities\nLearn more about our benefits that add real value to your life to help you live fully: www.abbottbenefits.com\nFollow your career aspirations to Abbott for diverse opportunities with a company that provides the growth and strength to build your future. Abbott is an Equal Opportunity Employer, committed to employee diversity. Connect with us at www.abbott.com, on Facebook at www.facebook.com/Abbott and on Twitter @AbbottNews and @AbbottGlobal.", "url": "https://www.indeed.com/viewjob?jk=835bee81ca97d3a3&from=serp&vjs=3"},
{"job_title": "newManufacturing Process Engineer", "summary": "Whether you are involved in the design and development of manufacturing processes for products or supporting maintenance and reliability, engineering is vital…", "company": "Pfizer", "location": "Sanford, NC+4 locations", "job_description": "Why Patients Need You\nWhether you are involved in the design and development of manufacturing processes for products or supporting maintenance and reliability, engineering is vital to making sure customers and patients have the medicines they need, when they need them. Working with our innovative engineering team, you'll help bring medicines to the world even faster by imagining what’s possible and taking action.\nWhat You Will Achieve\nThe incumbent will be knowledgeable of process equipment and systems, manufacturing operations, and automation control (Delta V, etc) and provide direct production support during processing operations. Services include review of process requirements and evaluation of equipment and systems to ensure deliverables meet or exceed process specifications and manufacturing requirements. The incumbent will assist with production planning and provide / support coordinating production activities working with the Manufacturing Area Leads. The incumbent will provide technical guidance and systems and automation training to production colleagues.\nThe position of Manufacturing Process Engineer requires direct production support on second shift (6 pm – 6am) as determined by the manufacturing processes.\nThe incumbent provides process engineering support of cGMP clinical and /or commercial manufacturing processes and equipment. Provides direction of process engineering support to ensure operational success of the maintenance coverage program. Analyzes repeated issues with equipment.\nConducts all activities and makes decisions that are in accordance with Company policies & SOPs, Pfizer Values, & global regulatory guidelines (including cGMP/cGLP/cGCP), environmental guidelines, as appropriate, etc. Advise management of non-conformance issues and opportunities for continuous improvement via data trend analysis, interpretation of data, gap analysis and implementation of corrective activities. Provides input on decisions for SOP’s, batch records, forms or other cGMP related documents developed or revised to support continuous improvement efforts, investigation corrective actions, process descriptions, manufacturing operations, automation control (DeltaV, etc.) and regulatory audit commitments.\nHow You Will Achieve It\nSpends majority of time on the production floor to proactively identify areas for improved efficiencies and ensure that product quality is maintained through all phases of production including operational parameters of manufacturing equipment, automation control, processing dynamics, and integrated utilities to identify and resolve quality, and technical, risk to manufacturing. Serve as the areas technical SME and develops expertise in various manufacturing operations and processes including automation controls that operate and monitor the processes.\n\nRequires general knowledge of scientific principles, technical knowledge of production equipment, automation control systems, processing requirements and any related procedural requirements with emphasis on assigned production area.\n\nCapable of identifying technical problems and solving them with minimal guidance. Ability to analyze operational process issues and automation challenges to recommend / initiate appropriate corrective and preventative actions. Acts as a departmental liaison with primary support groups such as engineering, technical services, quality control, quality assurance, development and utilities. The incumbent will manage / implement process, equipment, and automation changes in support of manufacturing operations.\n\n\nKey responsibilities\nPrimary point of contact for operator support and issue resolution\nResponsible for problem diagnosis / root cause(s) determination (automation, mechanical, documentation, training, etc)\nCoordinate activities with PCS to resolve automation issues and changes\nCoordinate activities with maintenance to resolve mechanical issues\nSME of process, equipment, and automation change requests for prioritization\nWorks with PCS to develop detailed automation design(s) and specifications\nCoordinates activities necessary to test and qualify equipment and automation changes in the production environment\nUses scientific and OE tools/techniques to identify areas to optimize yield and/or and improve efficiencies\nWorks with Tech Services, Engineering, Automation, QA, etc to ensure robust manufacturing processes:\nContribute to P&IDs, PFDs and process descriptions\nTranslate process descriptions instructions to meet production equipment / system capabilities\nReview and contribute to applicable documentation (i.e. MBRs, SOPs, etc)\nEnsure equipment requirements can meet processing needs\nReview P&IDs and provide support as needed\nPer guidance from Tech Services establish process parameters, timers, run rates, material flow, etc as needed\nDetermine area/equipment interlocks\nEstablish equipment synchronization requirements\nParticipates in process operational improvements\nQualifications:\nEDUCATION AND EXPERIENCE\nBS degree in Life Science (e.g. Biology or Chemistry) or Engineering with minimum 3 years of manufacturing experience in a FDA regulated industry is preferred.\nDESIRABLE:\nWorking knowledge of vaccine or biotechnology product manufacturing in a cGMP environment, including a working knowledge of microbial fermentation and/or purification, Ultrafiltration /diafiltration, aseptic techniques and filtration processes.\nPHYSICAL/MENTAL REQUIREMENTS\nCapable of sitting and/or standing for extended periods of time during the work shift. Be able to support 24/7 manufacturing operation.\nNON-STANDARD WORK SCHEDULE, TRAVEL OR ENVIRONMENT REQUIREMENTS\nThe position of Manufacturing Process Engineer requires direct production support on second shift (6 pm – 6am) as determined by the manufacturing processes.\nOther Job Details:\nLast Date to Apply: Feb 17th, 2022.\nPfizer requires all U.S. new hires to be fully vaccinated for COVID-19 prior to the first date of employment. As required by applicable law, Pfizer will consider requests for Reasonable Accommodations.\nSunshine Act\nPfizer reports payments and other transfers of value to health care providers as required by federal and state transparency laws and implementing regulations. These laws and regulations require Pfizer to provide government agencies with information such as a health care provider’s name, address and the type of payments or other value received, generally for public disclosure. Subject to further legal review and statutory or regulatory clarification, which Pfizer intends to pursue, reimbursement of recruiting expenses for licensed physicians may constitute a reportable transfer of value under the federal transparency law commonly known as the Sunshine Act. Therefore, if you are a licensed physician who incurs recruiting expenses as a result of interviewing with Pfizer that we pay or reimburse, your name, address and the amount of payments made currently will be reported to the government. If you have questions regarding this matter, please do not hesitate to contact your Talent Acquisition representative.\nEEO & Employment Eligibility\nPfizer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Pfizer also complies with all applicable national, state and local laws governing nondiscrimination in employment as well as work authorization and employment eligibility verification requirements of the Immigration and Nationality Act and IRCA. Pfizer is an E-Verify employer.\nManufacturing\n#LI-PFE", "url": "https://www.indeed.com/viewjob?jk=a3618dc0d1e8f916&from=serp&vjs=3"},
{"job_title": "Junior Engineer/Assistant Engineer/Associate Civil Engineer", "summary": "Duties below are performed at the entry engineer level for Junior Engineer, for the Assistant Engineer the duties are performed at the mid-level engineer…", "company": "City of San Rafael", "location": "San Rafael, CA+1 location", "job_description": "Description\nJunior Engineer/Assistant Engineer/\nAssociate Civil Engineer\n(One position available – Level upon appointment dependent upon experience/qualifications)\n$6,319 - $7,681 per month (Junior Engineer)\n$7,871 - $9,568 per month (Assistant Engineer)\n$8,689 - $10,562 per month (Associate Civil Engineer)\nPlus excellent benefits\n\nDEADLINE: Apply by Monday, January 3, 2022 for first consideration\n\nThe City of San Rafael is seeking a full-time Junior Engineer, Assistant Engineer or Associate Civil Engineer (one position available – level will depend upon experience/qualifications) for the San Rafael Sanitation District. This position will perform field and office professional civil engineering work in the planning, design, technical investigation, inspection and construction of projects in wastewater collection systems.\nPlacement of the individual at a particular level will be based on a combination of factors including education, years and type of experience, and designation or work in progress and the Professional Registration as a licensed civil engineer in California or Engineer in Training (EIT) certification.\nJunior Engineer: This is the entry level engineer classification. The position requires a BS degree in Civil Engineering and does not require any formal work experience or engineering certification.\nAssistant Engineer: This is the initial licensed classification which requires EIT and two years of Junior Engineer level experience (a master’s degree shall count for one year of post degree engineering experience. This position performs engineering work in the design, plan review, investigation, inspection and construction of wastewater collection systems, and performs related duties as assigned. This position may oversee the work of contractors for assigned projects and may act as the lead engineer in administrative or technical support performing tasks on the same assigned projects.\nAssociate Civil Engineer: This is the journey level classification which requires registration as a licensed civil engineer and four years of responsible post degree engineering experience (a master’s degree shall count for one year of post degree engineering experience). This position performs difficult and complex engineering work and may serve as a supervisor to a small group of engineers and/or paraprofessional engineering staff. This position calls for a high degree of initiative, technical proficiency, and judgment and is normally responsible for all phases of multiple projects or programs.\nESSENTIAL DUTIES AND RESPONSIBILITIES (may include but are not limited to the following). Duties below are performed at the entry engineer level for Junior Engineer, for the Assistant Engineer the duties are performed at the mid-level engineer requiring more independence and judgment utilizing knowledge and work experience; for Associate Civil Engineer, the professional and licensed civil engineer duties are performed at the full journey level.\nDevelops Requests for Qualifications (RFQs) and participate with other department staff in the selection of consulting engineers.\nPrepares and/or assists in the preparation of plans, specifications and estimates pertaining to construction projects.\nInterprets plans and specifications.\nMakes engineering calculations, completes design drawings, makes and revises maps, charts and diagrams.\nConducts pre-construction meetings with contractors to establish job requirements, i.e. timing, noise level, traffic impact.\nPerforms field inspections of various sewer construction projects, in progress and upon completion.\nPrepares written reports on civil engineering issues/projects for the department.\nMeets with a variety of public and private officials, individually and/or in a group setting, on civil engineering matters.\nResearch and make recommendations on civil engineering issues/problems.\nPerforms project management on Capital Projects during the design, environmental, bidding, and construction phases of the project.\nPerforms Resident Engineer duties on Capital Projects during construction.\nPerforms inspection and enforcement duties to ensure compliance with applicable design standards, specifications, contracts and legal documents, codes and ordinances.\nMeets with State, Federal, and Local Districts, Agencies, consultants, and engineers to discuss project guidelines, design parameters, policies and procedures.\nPerforms work in accordance with local, State, and Federal standards and regulations.\nDesigns and prepares plans and specifications and cost estimates for wastewater collection system projects. Researches project design requirements, performs calculations, prepares estimates of time and materials costs and determines sequencing and detour requirements.\nServes as Project Engineer, including serving as design team leader, handling contract administration and providing design support for the inspector during construction.\nReview plans and maps submitted by private developers for conformity with laws, San Rafael Sanitation District Standards and Ordinances, and accepted professional standards with the goal of protecting the health, safety, and welfare community. Performs certain administrative duties associated with private development approvals such as preparing agreements, collecting fees, and coordinating with other agencies and City departments.\nInvestigates field problems affecting the public, property owners, contractors and maintenance operations; collects the necessary data or assigns the collection of data to technical personnel; develops recommendations and meets with the appropriate parties to discuss and implement recommendations.\nProvides engineering information, including District requirements related to sewer improvements, to the public and other City departments. Arranges and participates in conferences with other engineers, developers and the general public on engineering problems.\nAssigns investigation, design and drafting tasks to subordinates, reviews completed work and assists in the developing solutions to difficult problems.\nDevelops revised design and construction standards for wastewater collection facilities.\nResearches publications and industry information sources and attends conferences and continuing education courses to keep abreast of new developments in the field of wastewater engineering.\nPrepares special engineering studies and reports, including but not limited to construction diaries, progress payments, state and federal paperwork associated with permitting, staff reports and duties as assigned.\nParticipates in engineering inspection and survey activities.\nPrepares written recommendations, correspondence and reports on assigned projects.\nMay attend and present information at public meetings.\nPerforms related duties as required.\nKNOWLEDGE/ABILITY/SKILLS TO:\nKnowledge of principles and practices of civil engineering and surveying.\nKnowledge of basic methods and equipment used in civil engineering construction.\nThorough knowledge of principles and practices of civil engineering and surveying; and working methods and equipment used in civil engineering construction; pertinent Federal, State, and local rules, regulations and ordinances; and computer applications relating to civil engineering.\nKnowledge of modern civil engineering tools and equipment including a PC and related software, including but not limited to AutoCadd or similar drawing software.\nAbility to analyze engineering problems.\nAbility to present clear, concise written and verbal reports.\nAbility to deal effectively with other engineers, other City and agency staff, private contractors, and the general public.\nAbility to use modern civil engineering equipment including a PC and related software.\nAbility to communicate effectively with a wide range of citizens, other City and agency staff, private contractors both in oral and written format.\nAbility to analyze civil engineering problems, evaluate alternatives, and reach sound conclusions.\nAbility to prepare clear, concise, and accurate reports, records, and correspondence.\nAbility to complete mapping and drafting assignments.\nAbility to establish and maintain effective working relationships.\nAbility to inspect sewer construction projects.\nLANGUAGE/MATHEMATICAL/REASONING SKILLS:\nAbility to read, analyze, and interpret general business periodicals, professional journals, technical procedures, or governmental regulations.\nAbility to write reports, business correspondence, and procedure manuals.\nAbility to effectively present information and respond to questions from groups of managers, clients, customers, and the general public.\nAbility to work with mathematical concepts such as probability and statistical inference, and fundamentals of plane and solid geometry and trigonometry.\nAbility to apply concepts such as fractions, percentages, ratios, and proportions to practical solutions.\nAbility to solve practical problems and deal with a variety of concrete variables in situations where only limited standardization exists.\nAbility to interpret a variety of instructions furnished in written, oral, diagram, or schedule form.\nEDUCATION and/or EXPERIENCE:\nJunior Engineer:\nBachelor’s degree in Civil Engineering\nAssistant Engineer:\nBachelor’s degree in Civil Engineering, AND\nEIT and two years of Junior Engineer level experience (a master’s degree shall count for one year of post degree engineering experience).\nAssociate Civil Engineer:\nBachelor’s degree in Civil Engineering, AND\nRegistration as a Civil Engineer in the State of California, AND\nFour years of responsible post degree engineering experience (a master’s degree shall count for one year of post degree engineering experience).\nOTHER REQUIREMENTS (for all classifications):\nValid driver’s license.\nPHYSICAL DEMANDS:\nThe physical demands described here are the representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this job, the employee is regularly required to sit; use hands to finger, handle, or feel; talk or hear. The employee frequently is required to stand, walk, reach with hands and arms, and taste or smell. The employee is occasionally required to climb or balance and stoop, kneel, crouch, or crawl. The employee must frequently lift and/or move up to 50 pounds. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception, and ability to adjust focus.\nWORK ENVIRONMENT:\nThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Hazards are moderate, fairly predictable and protected against.\nAPPLICATION AND SELECTION PROCESS:\nCity of San Rafael application is required. Resumes do not substitute for the City application. Candidates should detail related education and experience on the application since this information will be used to determine who will be invited to participate in the next phase of the examination process. The examination process may include any or all of the following: Application appraisal, oral board examination, and written examination. The passing point for the oral and/or written examination final score will be 70%. Prior to appointment, candidate must pass a background check, DMV check, pre-employment physical/drug screen, and fingerprinting. To file an application, go to www.calopps.org. Select “Member Agencies”. Select “City of San Rafael”. For more information on the City of San Rafael, go to www.cityofsanrafael.org. Follow this link to submit your application: https://www.calopps.org/san-rafael/job-20187539\n\nReasonable Accommodation: The City of San Rafael will make reasonable accommodations in the exam process to accommodate disabled applicants. If you have a disability for which you require an accommodation, please contact us at 415-485-3474 no later than seven (7) calendar days b\n\nBenefits\nThe City of San Rafael offers an attractive compensation and benefits program. The salary range for this position is DOQ/DOE and a competitive benefits program including:\nRetirement: The City is a part of the Marin County Employee Retirement Association (MCERA) plan, which offers reciprocity between agencies in CalPERS (this is part of the 37 Act County System);\nClassic Employees - 2% @ at 55 formula, single highest year of compensation;\nPEPRA employees - hired after 1/1/13 or with 6-month break in service are eligible for a 2% at 62 formula, highest 3 year average compensation.\nHealth Insurance: Full flex cafeteria plan which can be applied to a health plan or converted to cash (Employee Only - $835.94; Employee+1 - $1,722.07; Employee+Family - $1,869.00; Waive Coverage $300.00)\nLife and Long Term Disability Insurance: $5,000 basic and long-term disability is two-thirds of the salary up to $1,000 per month\nDental Insurance: Fully paid premiums\nVision Insurance: Fully paid employee premium\nDeferred Comp: Participation is voluntary. City contributes 1%.\nAnnual Leave: Vacation 10 days (1-3 years of service/6.25 hours earned per month); 12 days per year; 11 holidays and 2 floating holidays.\nAnd more......\n\nRecruitment Contact\nContact phone:\n(415)485-3474\nContact email:\nrhonda.castellucci@cityofsanrafael.org", "url": "https://www.indeed.com/viewjob?jk=91a282e1f5188e78&from=serp&vjs=3"},
{"job_title": "Operations Officer", "summary": "All Directorate of Operations (DO) officers are hired at an entry level and train as they are expected to work – as one team.", "company": "Central Intelligence Agency", "location": "Washington, DC 20505 (Foggy Bottom area)+8 locations", "job_description": "Operations Officers clandestinely spot, assess, develop, recruit, and handle non-U.S. citizens with access to foreign intelligence vital to U.S. foreign policy and national security decision-makers.\nFull Time\nStarting salary: $64,012 - $97,430*Higher starting salary possible depending on experience level\nBachelor's degree\nForeign language bonus eligible\nForeign travel is required\n\nAbout the Job\n\nAs an Operations Officer for the CIA, you will focus on clandestinely spotting, assessing, developing, recruiting, and handling non-U.S. citizens with access to foreign intelligence vital to U.S. foreign policy and national security decision-makers. You will be expected to build relationships based on rapport and trust using sound judgment, integrity, and the ability to assess character and motivation.\n\nOperation Officers spend most of their careers serving in multi-year assignments in a variety of overseas locations. As such, all Operation Officers must be able to be medically cleared for world wide deployment. All Operations Officers address a highly diverse and dynamic set of intelligence requirements on country- and region-specific issues, as well as transnational issues such as counterterrorism, counter proliferation, and cyber.\n\nAll Directorate of Operations (DO) officers are hired at an entry level and train as they are expected to work – as one team. Operations Officers begin their careers spending one to two years learning the foundations of clandestine operational tradecraft via classroom training, practical exercises, and on-the-job experience gained through a series of interim assignments. Following successful completion of the foundational training, each DO officer will transition into advanced training activity to prepare them to serve effectively in their respective career occupational specialty.\n\nOur physical requirements for training are as follows:\n\nOperate a motor vehicle without second-party assistance in daytime and nighttime conditions;\nTraverse uneven terrain, to include climbing and descending staircases, over fixed minimum distances and in varying weather conditions;\nWork non-traditional or erratic schedules;\nMake reasoned decisions under time constraints.\n\nThis position requires a 5-year Contract Term Agreement.\n\nWho You’ll Work With\n\nAt the Central Intelligence Agency (CIA), we recognize our Nation’s strength comes from the diversity of its people. People from a broad range of backgrounds and viewpoints work at CIA, and our diverse teams are the reason we can keep our country safe.\n\nRead more about diversity and inclusion\n\nWhat You’ll Get\n\nOur benefits support every aspect of a working professional’s life, including health and wellness, time off, family, finances, and continuing education. Our programs include highly sought-after government health benefits, flexible schedules, sick leave, and childcare. In some cases, we also offer sign-on incentives and cover moving expenses if you relocate.\n\nAs a CIA employee, you’ll also get the satisfaction of knowing your work is part of something bigger than yourself. Our work is driven by one mission: to keep our Nation safe. Every day is an opportunity to enhance U.S. national security.\n\nLearn more about working at CIA\n\nMinimum Qualifications\nBachelor’s degree from an accredited institution (applicants within one year of earning a four-year degree will be considered); there is no preferred major or program of study (degrees from foreign academic institutions are accepted, but you are responsible for obtaining and providing CIA with a credential evaluation from an accredited firm confirming that the foreign degree is the equivalent of a BA/BS and/or MA/MS degree conferred by a U.S. college or university)\nAt least a 3.0 GPA on a 4-point scale is preferred\nPersonal integrity\nStrong interpersonal and communication skills (verbal and written)\nAction- and results-oriented\nAbility to work effectively as part of a team and independently\nFlexibility, adaptability, and commitment to the mission of the CIA and the Directorate of Operations\nAbility to meet the minimum requirements for joining CIA, including U.S. citizenship and a background investigation\nDesired Qualifications\nWillingness and ability to establish strong personal relationships\nAbility to “think on your feet” and develop creative yet practical solutions to anticipated and unanticipated problems\nInterest in seeking answers, learning foreign languages, and studying other cultures\nCross-cultural sensitivity and the ability to deal with individuals from all cultures and backgrounds\nWhat You’ll Need to Apply\n\nThe following items must be attached to your on-line application (PDF format preferred):\n\nResume\nUnofficial transcripts for all degrees\nCover letter: please describe your knowledge, skills, abilities, and aspirations not evident from your resume, that make you a good candidate for the Directorate of Operations (1 page).\n\nAt the time of application, DO applicants select specific DO occupational specialties (i.e. Collection Management Officer, Staff Operations Officer, Operations Officer, Targeting Officer). Competitive applicants will continue to be asked to identify their DO occupational specialty preference(s) at various stages in the hiring process. It is not unusual for applicants to adjust their preference as they progress and learn more about the expectations and requirements of each occupational specialty.\n\nImportant application instructions for this position:\nQualifications Supplement\n\nIn a separate PDF attachment address the following questions:\n\nWhy does a career in public service with the CIA appeal to you?\nWhy do you wish to work in the specific roles to which you are applying?\nDescribe one thing from your academic, military, professional, or personal background that has prepared you for success in the CIA.\nComplete this thought: “I do my best work when…”.\nOutside of the careers to which you are applying, what other careers have you considered?\nDescribe a time when you did not succeed, professionally or academically, and what you learned from that experience.", "url": "https://www.indeed.com/viewjob?jk=d670980cecd497f5&from=serp&vjs=3"},
{"job_title": "Attorney- Non Litigation", "summary": "All areas of law wanted, including Landlord/Tenant, Employment, Real Estate, General Consumer Law, and Business.\nNo need to bill or bring in clients.", "company": "Parker Stanbury LLP", "location": "Remote in Los Angeles, CA", "job_description": "Work at a Los Angeles law firm from anywhere in California. AV-rated downtown firm seeks CA lawyers for non-litigation non-traditional position. Can work from anywhere in the state. All areas of law wanted, including Landlord/Tenant, Employment, Real Estate, General Consumer Law, and Business. No need to bill or bring in clients. Full time, with part time opportunities for sole practitioners. Looking for someone with good communication skills.Job Types: Full-time, Part-time, ContractPay: $70,000.00 - $100,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceFlexible spending accountHealth insuranceHealth savings accountLife insurancePaid time offVision insuranceSchedule:8 hour shiftMonday to FridayLicense/Certification:Bar (Preferred)Work Location: One location", "url": "https://www.indeed.com/viewjob?cmp=Parker-Stanbury-LLP&t=Attorney&jk=980a99e2f025adce&vjs=3"},
{"job_title": "Counsel, Minors Immigration & Diligence", "summary": "We are responsible for setting and implementing global practices across the Netflix Studio to help our productions be thoughtful, innovative, and consistent…", "company": "Netflix", "location": "Los Angeles, CA+6 locations", "job_description": "Los Angeles, California\nContent Legal\nNetflix is the world's leading streaming entertainment service with 208 million paid memberships in over 190 countries enjoying TV series, documentaries and feature films across a wide variety of genres and languages. Members can watch as much as they want, anytime, anywhere, on any internet-connected screen. Members can play, pause and resume watching, all without commercials or commitments. Visit our culture memo and long-term view to learn more about our unique Netflix culture as well as the milestones we will achieve in the future.\nThe Opportunity:\nNetflix is seeking a Counsel to be part of the Minors, Immigration & Diligence (MInD) team within Employment Legal. The MInD team is unique to Netflix and handles a niche, yet important aspect of Netflix productions. We are responsible for setting and implementing global practices across the Netflix Studio to help our productions be thoughtful, innovative, and consistent with respect to global immigration requirements for cast and crew, minor protection, child labor compliance, and diligence (which can include background checks, psychological evaluations, and medical testing). In a culture that supports judgment and innovation as key competencies, this position will have the responsibility of managing and overseeing compliance with immigration, best practices/legal requirements for working with minors, as well as for diligence in relation to an assigned slate of Netflix owned projects.\nIn keeping with Netflix’s values, we are looking to innovate on our recruiting practices for this role. Instead of limiting our search to those with existing experience in immigration, child labor, or diligence, we want to create a unique opportunity for stunning professionals, regardless of field of expertise, to be considered for this role. We will provide the necessary onboarding and training in our practice areas to the right candidate who is incredibly smart, quick-learning, and would thrive in our culture.\nYour Responsibilities:\nAs MInD Counsel you will work with internal business partners to assess and recommend strategic approaches regarding immigration, child labor/minor protection, and diligence during the planning and production phases for Netflix projects.\nWe are on an exciting growth journey that involves a varied slate of productions that film in locations all around the world. You will be part of a team who works together to understand the relevant legal requirements in various countries, developing new workflows, sourcing new vendors, and educating cross-functional partners on the requirements and regulations in these countries.\nThis role will be responsible for providing end-to-end immigration support for Netflix productions, including liaising with outside counsel, third-party production partners, and talent reps; preparing and reviewing immigration documents; and advising key internal stakeholders throughout the visa journey.\nThis role will oversee child labor compliance and activities involving minors, including advising on all applicable local child labor regulations and union/guild rules, including outside of the U.S.; preparation and filing of all necessary child labor permit applications; tracking; and working with outside counsel and vendors, all in close partnership with other internal teams.\nThis role will provide minor court affirmation support to internal Business and Legal Affairs partners, including guidance on which countries allow minors to disaffirm, which countries have provisions by which employers can affirm or ratify contracts, and support throughout the process of affirmation/ratification, including preparation and filing of all necessary documentation.\nThis role will be responsible for overseeing diligence, including assessing the diligence needs on a given project and making recommendations to production; reviewing diligence reports; managing and sourcing vendors; maintaining databases to help keep all teams aligned; and keeping a constant flow of communication with internal stakeholders.\nWe are focused on efficiency and serving the needs of production. Part of that means evolving with the business as it grows, which will require this role to establish innovative processes and workflows and identify areas for improvement.\nTo be successful:\nYou have experience leading and advising through tricky situations that involve gray areas, nuanced analysis, and/or risk assessment.\nYou regularly exercise great judgment and can articulate sound reasoning for your decisions.\nYou have strong attention to detail, an ability to work well with changing information, and an ability to manage competing deadlines.\nYou possess excellent organizational, multi-tasking, and time management skills.\nYou are effective and concise in your communications.\nYou are a team player who acts with a sense of urgency and adapts to a fast-paced and ever-changing environment.\nYou are resourceful and take the initiative to seek internal and external resources when problem solving.\nPrior experience as an attorney in any field of at least 5-7 years. Previous work in immigration, child labor compliance, diligence, or for a network/studio is helpful, but is not required. As mentioned above, we are expanding our search for this role to those with experience outside of our practice areas. If you feel you meet the criteria above and have transferable skills, you are welcome to apply with a cover note explaining what transferable skills you possess.\nJ.D. and membership in good standing in at least one state bar is required.\nAPPLY NOW\nShare this listing:\nLINK COPIED", "url": "https://www.indeed.com/viewjob?jk=3782d705b903567a&from=serp&vjs=3"},
{"job_title": "newMailroom Associate", "summary": "Will be performed on-site in Springfield, MA.\nBenefits eligible day one & paid training.\nThe individual who fills this position will be responsible for…", "company": "Conduent", "location": "Springfield, MA+9 locations", "job_description": "Mailroom associate Will be performed on-site in Springfield, MASchedule: Mon-FridayBenefits eligible day one & paid trainingPay ranges from $14.25 - $16.25Would you like to be a part of a team that plays a vital role in supporting our business operations?Join our team today!About the Mailroom associate roleThe individual who fills this position will be responsible for processing, rejecting, and/or re-associating incoming mail daily. This position is considered a production-oriented position, which includes adherence to Client based service level agreement goals.You will be offered a competitive salary, benefits, and a supportive team environment.Requirements:Ability to work in fast paced environmentExperience with multi-taskingAttention to detail and organization skillsPerforms clerical task functions as neededHigh school diploma or GEDBe part of the futureAre you seeking an opportunity to make a real impact in a company that appreciates ideas and new ways of thinking? Come join us and grow with a team of people who will challenge and inspire you to be the best!At Conduent we value the health and safety of our associates, their families and our community. For US applicants while we DO NOT require vaccination for most of our jobs, we DO require that you provide us with your vaccination status, where legally permissible. Providing this information is a requirement of your employment at Conduent.Job Type: Full-timePay: $14.25 - $16.25 per hourWork Location:One locationWork Remotely:No", "url": "https://www.indeed.com/viewjob?jk=66feb83ba3f9b594&from=serp&vjs=3"},
{"job_title": "newData Entry Assistant – Seasonal", "summary": "With accuracy and speed, the Data Entry Associate will process new and renewing membership accounts by accurately inputting data under the direction of the Data…", "company": "Dallas Arboretum", "location": "Dallas, TX 75218 (East Dallas area)", "job_description": "With accuracy and speed, the Data Entry Associate will process new and renewing membership accounts by accurately inputting data under the direction of the Data Entry Lead or Manager.Location: 8525 Garland Road,Dallas,Texas 75218, Dallas, TX 75218Job Type: Temporary", "url": "https://www.indeed.com/viewjob?cmp=Dallas-Arboretum-and-Botanical-Garden&t=Data+Entry+Assistant+Seasonal&jk=d1d403742c51246a&vjs=3"},
{"job_title": "newCrime Response Specialist", "summary": "The eligible list created from this recruitment may be used to fill future vacancies that occur within the next six (6) months.", "company": "Dane County", "location": "Madison, WI", "job_description": "Dane County is currently recruiting for a full-time (1.0 FTE) Crime Response Specialist. The eligible list created from this recruitment may be used to fill future vacancies that occur within the next six (6) months.DEFINITIONUnder the general supervision of the Crime Response Manager and the direction of the Director of the Victim Witness Unit, incumbents provide crisis response to victims and witnesses of violent, threatening or trauma-inducing crime, their families in the early stages of the criminal investigation. Critical services will be offered regardless of arrest or prosecution status. Respond to the emotional, physical (including safety) and practical needs of the traumatized victim/witness in the immediate aftermath of crime. The overall goal of the Crime Response Program is to reach beyond mandated services to further empower crime victims, humanize the system and gain victim/witness cooperation by providing trauma-informed, culturally responsive, equitable and compassionate services to those who have experienced trauma as the result of crime.EXAMPLES OF DUTIESServe both in the office and field as trauma responder. Create and maintain after hours call schedule. Serve as point person to field trauma responders about outcomes and necessary follow up. Serve as back up to the Crime Response Manager to questions/concerns of responders in the field. Provide emergency back-up in the field. Review police reports and attend law enforcement briefings to assess the need for trauma services to crime victims, their families and witnesses of crime in the immediate aftermath of incidents of violent or threatening crime or in the early stages of the investigation. Contact those identified through reports with an offer of service to include: defusing, emotional support and stabilization, mobilization of personal resources, explanation of trauma symptoms and coping techniques as well as information about their victim rights and how to exercise those rights. Provide ongoing case status updates, information and referral, and follow-up. Advocate on behalf of victim/witness/family members and survivors of homicide with various parties including: employers; educational institutions; landlords; allied service providers and the criminal justice system (CJS). Assist with emergent needs for safety, food, shelter (emergency and short-term temporary), financial assistance, crime scene clean-up, pet welfare and privacy. Provide court support at the initial appearance in cases where the suspect is arrested and charged by the District Attorney’s Office. Coordinate service with assigned victim witness staff to make the transition between crisis and longer-term criminal justice support as seamless as possible. Work in concert with the assigned Victim Witness Case Manager to insure the victim understands and is afforded an opportunity for meaningful participation in the CJS. Maintain detailed information/data regarding service provision in the protect system. Assist in the completion of various reports required for Victims of Crime Act (VOCA) federal grant funding.EDUCATION, TRAINING AND EXPERIENCEMust possess a Bachelor’s Degree in social work, human services, criminal justice, or a closely related field. Individuals with a Bachelor’s Degree must also possess at least two (2) years of professional experience working with crime victims. OR: Individuals with a Master’s Degree in social work, human services, criminal justice, or a closely related field must also possess at least six (6) months of professional experience working with crime victims.SPECIAL REQUIREMENTSMust have a valid driver’s license, or access to reliable personal transportation, or equivalent. Must be able to work irregular hours, beyond 40 hours per week if needed. Time demands are constant.PHYSICAL AND ENVIRONMENTAL WORK REQUIREMENTSAbility to respond in the field on short notice. Must be highly adaptable and confident to the presenting circumstances and the intense emotions of those impacted. The field environment may be very fluid and chaotic requiring the ability to center oneself quickly and employ immediate problem solving skills. The office environment is a highly collaborative, high energy and fast paced law office employing about 100 professional employees. In both environments, the ability to vigorously advocate even in the face of pushback and/or apathy.KNOWLEDGE, SKILLS AND ABILITIESVictim centered, trauma informed and respectful of cultural diversity. Knowledge and skill in advocacy techniques, and service coordination. Ability to quickly and effectively problem solve in highly stressful situations. An appreciation of multi-disciplinary teaming in the interest of crime victims, witnesses and families. An understanding of the workings of the CJS. Ability to endure sensitive, tragic and sometimes violent and graphic case details. Ability to work with trauma and grief. Ability to work with sensitive crimes including, homicide, serious injury, violent assaults, child sexual assault and abuse. A commitment to mass violence preparedness. Ability to work outside the parameters of a traditional work week when crisis response work is needed. Ability to separate personal trauma from work performance. Excellent oral and written communication skills. Ability to maintain accurate records and effectively communicate with others orally and in writing. Extensive knowledge of resource and referral in areas including: mental health, medical, estate issues, grief resources, housing, energy assistance, counseling and/or other therapeutic interventions, crime victim compensation, privacy and protection from public or media intrusion.Job Type: Full-timePay: $30.77 - $36.75 per hourBenefits:Dental insuranceEmployee assistance programFlexible spending accountHealth insuranceHealth savings accountLife insurancePaid time offParental leaveRetirement planVision insuranceSchedule:8 hour shiftMonday to FridayOn callWork Location: Multiple Locations", "url": "https://www.indeed.com/viewjob?cmp=Dane-County&t=Crime+Response+Specialist&jk=8ccfec77c61b342b&vjs=3"},
{"job_title": "Employee Relations Specialist", "summary": "Bachelor’s degree in a related field.\n2+ years direct experience in employee relations, labor relations, or labor/employment law with an emphasis on labor and…", "company": "Amazon.com Services LLC", "location": "Arizona", "job_description": "\nBachelor’s degree in a related field\n2+ years direct experience in employee relations, labor relations, or labor/employment law with an emphasis on labor and employee relations work\nExperience in manufacturing/distribution/call center locations with hourly employee populations;\nUnderstanding of provincial employment & labor laws\nExperience in designing and delivering successful training programs\nTechnically proficient in MS Word, Excel, Access, & PowerPoint,\n\nThis position requires an individual who has previous employee and labour relations experience, subject matter knowledge, and strong communication (written/verbal) and interpersonal skills that enables the individual to work successfully on a broad spectrum of employee relations and site support issues and projects.\n\nThe position supports Amazon.com’s Operations network. The central objective of Amazon.com’s employee relations team is to ensure our organization’s treatment of employees is fair, respectful, and consistent with our framework of our core business values and objectives. To support that objective, this position will focus on site support activities that improve local and network employee relations.\n\nThe individual, for example, will work proactively to:\n\nCollect and analyze multiple levels of Associate and manager feedback, primarily through data analysis and site visits;\nPartner and engage with site and HR to identify and improve opportunities that affect the Associate experience including continuous improvement in communication vehicles and practices;\nAnalyze, diagnose, and audit people programs, policies, and practices to sustain positive employee relations;\nPrepare assessment reports including observations and analysis for senior level review\nConduct positive employee relations trainings;\nConduct and oversee employee relations and vulnerability assessment programs.\n\nThe individual may be required to work reactively on critical employee relations issues that are crisis-oriented and typically can only be successfully completed with limited time.\n\nThe position reports to the Employee Relations Principal within the Operations Human Resources group at Amazon.com. The resident location of the individual is limited to specific locations in their designated region, typically near clusters of FC and/or CS locations. This is a full-time position that will require significant travel, 40-60% of the time over the course of the year.\n\nThe pay range for this position in Colorado is $85,600 to $149,800 per year; however, base pay offered may vary depending on job-related knowledge, skills, and experience. A sign-on bonus and restricted stock units may be provided as part of the compensation package, in addition to a full range of medical, financial, and/or other benefits, dependent on the position offered. This information is provided per the Colorado Equal Pay Act. Base pay information is based on market location. Applicants should apply via Amazon's internal or external careers site.\n\n\nAdvanced degree, JD, or other specialized training in labor/employee relations\nTeam player with demonstrated strong written and oral communication skills; excellent public speaker\nStrong interpersonal and persuasion skills, enabling individual to establish partnerships working with senior leaders and across lines\nAble to handle confidential information in a mature and professional manner\nHighly analytical thinker and problem solver\nProven attention to detail; extremely organized\nActs with sense of urgency, bias for action, fast pace, and desire to thrive in a dynamically growing environment\nHigh-quality judgment and sound decision-making\nStrong project and time management skills with ability to multi-task and manage multiple projects to closure\nConfident and innovative thinker; isn’t satisfied with “checking the box” or just pulling out “what we did at my last job”\n\nThe pay range for this position in Colorado is $85,600 to $149,800 per year; however, base pay offered may vary depending on job-related knowledge, skills, and experience. A sign-on bonus and restricted stock units may be provided as part of the compensation package, in addition to a full range of medical, financial, and/or other benefits, dependent on the position offered. This information is provided per the Colorado Equal Pay Act. Base pay information is based on market location.\n\nApplicants should apply via Amazon's internal or external careers site.\nAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, visit https://www.amazon.jobs/en/disability/us", "url": "https://www.indeed.com/viewjob?jk=0168cf67a5f63346&from=serp&vjs=3"},
{"job_title": "University Council Secretary", "summary": "Proven ability to listen, advice and counsel at senior levels.\nAuditor, state audit, cabinet of ministers and any other.\nOf the University’s governance.", "company": "Zayed University", "location": "Council, ID", "job_description": "JOB PURPOSE SUMMARY\nThe University Secretary (Secretary) is responsible to the University Council, through the Chairman, to ensure effective and efficient operations of the University’s system of governance.\nThe Secretary supports the Chairman and University Council members in carrying out their responsibilities including the provision of information and advice, as required. The Secretary is the principle source of advice on university governance matters. The Secretary will alert the Chairman if any proposed actions exceed the University Council’s powers or are contrary to the provisions of legislation.\nThe Secretary works with the Chairman and Vice President to ensure the efficient management of University Council’s business.\nThe job requires effective organization, management and follow-up of University Council and Cabinet of Ministers relations affairs and development of policies and practices which ensure the University is adherent to government and other regulatory requirements in matters related to the University Council and its functions.\nKEY ACCOUNTABILITIES\nUnder the direction and guidance of the University Council Chairman, the Vice President, and the President, the University Secretary will have the following key accountabilities:\nUniversity Governance Framework:\n Coordinates, facilitates,\n and records the activities of the University Council committees, and\n other governing bodies to ensure effective and efficient operations\n of the University’s governance. The incumbent is also\n responsible for matters related to privacy and access to\n information, equity and University policy. Communicates regularly\n on the deliberations and actions approved by the Board of Directors.\n Facilitates the work of the\n University Council, including their adhoc and standing meetings,\n publications, directories, committee staffing and orientation for\n new members.\n Works closely with other\n departments and units, including Legal Counsel to support the\n University governance processes and efforts in line with\n market best practices.\n Anticipates substantive or\n procedural difficulties in the implementation of Council decisions\n and recommends the ways to avoid them.\n Remains well informed about\n all university policies and procedures and about the status of\n proposals as they proceed through the university decision-making process.\n Ensures that the University\n remains compliant within the appropriate legal framework, which\n defines its obligations and duties, and to support the governance of\n the University.\n Ensure the University\n Council members and executive management are kept upto date on\n their legal duties and responsibilities, recent developments in\n regulations and corporate governance practices,etc.\n Leads the development, seeks\n approval and ensures effective management of policies and\n procedures covering all areas of Council relations and corporate governance.\n Liaises with the external\n auditor, state audit, cabinet of ministers and any other\n regulatory/government bodies as and when needed.\n Verifies official\n publications (e.g., annual reports submitted to the Cabinet,\n press releases concerning the Chairman and governance matters,\n reports submitted to the MSCHE).\n Organizes meetings of\n Council and its standing committees. Ensures that agenda papers are\n developed and circulated in a timely and effective manner and the\n meeting minutes represent an accurate record of proceedings and decisions.\n Facilitates effective and\n appropriate communication between Council and other stakeholders in\n the University including students, staff and government.\n Monitors implementation of\n Council decisions. Ensures that Council protocols and relevant\n university policies and procedures are observed.\n Develops and implements\n training programs and workshops aligned to the University strategic\n plan and vision.\nAny other support as required by the Council Chairman, or the University management .\nDEGREE OF INDEPENDENCE/COMPLEXITY OF ENVIRONMENT\n Highly ambiguous, constantly\n changing environment with a diverse network of key stakeholders and\n policy makers.\n\n Must be able to deal with\n simultaneously occurring crisis which may compete for time and resources.\n\nWORKING RELATIONSHIPS/IMPACT OF INTERACTIONS\n Interacts extensively with\n senior management to educate, influence, and build awareness of key\n issues and propose solutions.\n Influences and negotiates\n with external parties for the benefit of the University.\n\nEDUCATION & EXPERIENCE REQUIREMENTS\nMust be a UAE National with a minimum of a Master’s degree from an accredited institution with 10 years of experience in legal, general audit, risk management and governance function or an equivalent combination of education and experience. Expert level knowledge of institutional governance and legal concepts, practices and procedures in a complex environment are highly desired.\nGood knowledge of the academic industry. Good knowledge of Cabinet of Ministers decisions and any rules and regulations related to the University.\nOther essential requirements:\nFluency in written and spoken Arabic & English,\nAbility to travel between Abu Dhabi and Dubai,\nPassion for matters related to institutional governance, audit and risk management.\n\nDesired or preferred requirements:\nExperience working in the academic environment.\nAbility to think strategically.\nProven ability to listen, advice and counsel at senior levels.\nGood organizational and time management skills.\nHigh degree of attention to detail.\nGood presentation and negotiation skills\nKnowledge of protocol and procedures relating to the University Council.\n\nCOMPETENCIES\n\nLeadership & Managerial Accountability - Engages others to work together towards a shared vision and common goals; Makes effective decisions, achieve outcomes and results.\n\nCommunication - Able to share information in an effective & collaborative manner, both verbally and in writing (English and Arabic).\nCustomer & Service Focused - Demonstrates a spirit of service excellence\nResults & Action Orientation - Demonstrates initiative to generate improvements and foster positive outcomes.\nBuilds Effective Interpersonal Relationships - Demonstrates interpersonal effectiveness in the workplace.\nKnowledge & Technical Competency - Demonstrates proficiency in technical and job knowledge aspects of the position to achieve high level of performance. Able and willing to learn. Excellent compute skills (Microsoft Office)\n\nStatements in this document are intended to reflect, in general, the role and responsibilities of the position and are not to be interpreted as totally inclusive.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCurrency AED\n\n\n\n\n\n\n\nAmount of Travel\n\n\nWork At Home\n\n\nDocuments\n\nTitle Type Description Category Last Updated By Last Updated Usage Update Delete\n\nNo results found.\n\n\n\n\n\n\n\n\n\n\n\nAdd To Basket Refer Apply Now\n\nZayed University Copyright 2010.", "url": "https://www.indeed.com/viewjob?jk=71f33e6423eebad4&from=serp&vjs=3"},
{"job_title": "Administrative Assistant F", "summary": "Advanced administrative, secretarial and clerical skills.\nAbility to identify and resolve exceptions and to interpret data.\nHigh school diploma or equivalent.", "company": "U.S. Bank", "location": "Remote in Wisconsin+9 locations", "job_description": "At U.S. Bank, we're passionate about helping customers and the communities where we live and work. The fifth-largest bank in the United States, we’re one of the country's most respected, innovative and successful financial institutions. U.S. Bank is an equal opportunity employer committed to creating a diverse workforce. We consider all qualified applicants without regard to race, religion, color, sex, national origin, age, sexual orientation, gender identity, disability or veteran status, among other factors.\nJob Description\nProvides a broad variety of administrative and staff support services for an assigned group or manager. Other duties may include: collects and interprets data to produce reports; conducts special projects; coordinates meetings, conferences, presentations and travel arrangements; and composes correspondence and other documentation as needed. Frequently uses personal computer software packages for word processing, graphics, spread sheets, etc. Specific job duties vary by area.\nBasic Qualifications\n\nHigh school diploma or equivalent\nFour to five years of experience in administrative and support staff activities\nPreferred Skills/Experience\n\nStrong reading, writing and mathematical skills\nAbility to manage multiple tasks/projects and deadlines simultaneously\nAdvanced administrative, secretarial and clerical skills\nAbility to identify and resolve exceptions and to interpret data\nExcellent verbal and written communication and grammatical skills\nProficient computer skills, especially Microsoft Office applications\nIf there’s anything we can do to accommodate a disability during any portion of the application or hiring process, please refer to our disability accommodations for applicants .\nBenefits:\n\nTake care of yourself and your family with U.S. Bank employee benefits. We know that healthy employees are happy employees, and we believe that work/life balance should be easy to achieve. That's why we share the cost of benefits and offer a variety of programs, resources and support you need to bring your full self to work and stay present and committed to the people who matter most - your family.\nLearn all about U.S. Bank employee benefits, including tuition reimbursement, retirement plans and more, by visiting usbank.com/careers .\nEEO is the Law\n\nApplicants can learn more about the company’s status as an equal opportunity employer by viewing the federal EEO is the Law poster.\nE-Verify\nU.S. Bank participates in the U.S. Department of Homeland Security E-Verify program in all facilities located in the United States and certain U.S. territories. The E-Verify program is an Internet-based employment eligibility verification system operated by the U.S. Citizenship and Immigration Services. Learn more about the E-Verify program .\nDue to legal requirements, U.S. Bank requires that the successful candidate hired for some positions be fully-vaccinated for COVID-19, absent being granted an accommodation due to a medical condition, pregnancy, or sincerely held religious belief or other legally required exemption. For these positions, as part of the conditional offer of employment, the successful candidate will be asked to provide proof of vaccination or approval for an accommodation or exemption upon hire.", "url": "https://www.indeed.com/viewjob?jk=8268b019ce1dfc66&from=serp&vjs=3"},
{"job_title": "newAdministrative Assistant", "summary": "Responsible for the administrative aspects of academic surgeon’s practice with major clinical focus and affiliated research and educational duties.", "company": "University of Pennsylvania Health System", "location": "Philadelphia, PA 19104 (University City area)+4 locations", "job_description": "Responsible for the administrative aspects of academic surgeon’s practice with major clinical focus and affiliated research and educational duties.\n\nMinimum Requirements:\nH.S. Diploma/GED And 3+ years A combination of education and experience will be considered.\n\nAdditional Information:\nWe believe that the best care for our patients starts with the best care for our employees. Our employee benefits programs help our employees get healthy and stay healthy. We offer a comprehensive compensation and benefits program that includes one of the finest prepaid tuition assistance programs in the region. Penn Medicine employees are actively engaged and committed to our mission. Together we will continue to make medical advances that help people live longer, healthier lives.\n\nLive Your Life's Work\n\nWe are an Equal Opportunity and Affirmative Action employer. Candidates are considered for employment without regard to race, ethnicity, color, sex, sexual orientation, gender identity, religion, national origin, ancestry, age, disability, marital status, familial status, genetic information, domestic or sexual violence victim status, citizenship status, military status, status as a protected veteran or any other status protected by applicable law.", "url": "https://www.indeed.com/viewjob?jk=2732798ff1845de0&from=serp&vjs=3"},
{"job_title": "newAdministrative Assistant (OA)", "summary": "Your benefits depend on the type of position you have - whether you're a permanent, part-time, temporary or an intermittent employee.", "company": "US Armed Forces Retirement Home", "location": "Washington, DC", "job_description": "Duties\nAs an Administrative Assistant (OA), you will:\n\nAct as a liaison between the Service Chief, the Director and other Service Chiefs and all other internal and external customers. Tactfully determines the name and affiliation of callers and nature of calls. Personally handles many matters, answering questions of an administrative/general nature, or refers the caller to the appropriate office.\nMaintain the calendar of the Service Chief, and resolves any scheduling conflicts. Arranges meetings, to include time, space, attendance and any equipment needs.\nPrepare and distribute meeting agenda. Attend meetings and records minutes, and prepare minutes for distribution.\nPrepare a variety of documents using word processing, spreadsheets and databases.\nResponsible for ensuring travel arrangements are accurately prepared in a timely manner, to include most cost effective mode of transportation, making reservations, planning itineraries, coordinating with point of contact at TDY site, and preparing travel voucher upon completion of travel.\n\nRequirements\nConditions of Employment\nThe experience may have been gained in either the public, private sector or volunteer service. One year of experience refers to full-time work; part-time work is considered on a prorated basis. To ensure full credit for your work experience, please indicate dates of employment by month/day/year, and indicate number of hours worked per week on your resume.\n\nKey Requirements:\nPlease refer to \"Conditions of Employment.\"\nMust be U.S. Citizen or U.S. National\n\nQualifications\nYou must meet the following requirements by the closing date of this announcement.\n\nTo be qualified for this position at the GS-09 level, you must have at least one year of specialized experience at a level of difficulty and responsibility equivalent to the GS-08 grade level in the Federal service performing administrative support functions.\nSpecialized experience for this position includes:\nEnsuring administrative support work is performed in compliance with relevant regulations, guidelines, and policies; OR\nCreating, proofing, and editing documents; OR\nMonitoring and, adjusting budget accounts; OR\nProcuring items for the office and/or department; OR\nEnsuring the accuracy and completeness of time and leave documents; OR\nAnswering general information questions from customers and/or visitors.\n\n\nAND\n\n\nCertified typist - ability to type at least 40 words per minute\nAdditional information\nTo ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement Safer Federal Workforce Task Force 2 pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a Federal job announcement includes the requirement that applicants must be fully vaccinated against COVID-19 pursuant to Executive Order 14043, that requirement does not currently apply. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and quarantine\n\n***THIS IS SUBJECT TO CHANGE, DEPENDENT ON THE APPEAL DECISION***\n\nWe may select from this announcement or any other source to fill one or more vacancies.This is a non-bargaining unit position.\nCONDITIONS OF EMPLOYMENT:\nA one year probationary period may be required.Must successfully complete a background investigation.Complete a Declaration for Federal Employment to determine your suitability for Federal employment, at the time requested by the agencyIf you are a male applicant born after December 31, 1959, certify that you have registered with the Selective Service System or are exempt from having to do so.Have your salary sent to a financial institution of your choice by Direct Deposit/Electronic Funds Transfer.Go through a Personal Identity Verification (PIV) process that requires two forms of identification from the Form I-9. Federal law requires verification of the identity and employment eligibility of all new hires in the U.S.Submit to a drug test prior to your appointment and random drug testing while you occupy the position.Selectees will be subject to the AFRH Tuberculosis Surveillance Program.Wear required safety clothing and/or equipment required by the position. This may include safety shoes, hard hats, hearing protection, gloves, masks, etc.Because the AFRH's mission requires uninterrupted, direct human support and medical care for its Residents, this position is considered essential for continuing AFRH operations. Therefore, the incumbent is expected to arrive for duty on time, as scheduled, and to complete the assigned tour during emergency situations such as hazardous weather.\n\nBenefits\n\nA career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\nHow You Will Be Evaluated\nYou will be evaluated for this job based on how well you meet the qualifications above.\nYour application includes your résumé, responses to the online questions, and required supporting documents. Please be sure that your résumé includes detailed information to support your qualifications for this position; failure to provide sufficient evidence in your résumé may result in a \"not qualified\" determination.\n\nRating: Your application will be evaluated in the following areas:\nTechnical\nAnalytical\nCommunication\n\n\nCategory rating will be used to rank and select eligible candidates. If qualified, you will be assigned to one of three quality level categories: Outstanding, Excellent or Qualified, depending on your responses to the online questions, regarding your experience, education, and training related to this position. Your rating may be lowered if your responses to the online questions are not supported by the education and/or experience described in your application.\n\nVeterans' preference is applied after applicants are assessed. Preference-eligibles will be listed at the top of their assigned category and considered before non-preference-eligibles in that category. Qualified preference-eligibles with a compensable service-connected disability of 10% or more will be listed at the top of the highest category.\n\nReferral: If you are among the top qualified candidates, your application may be referred to a selecting official for consideration. You may be required to participate in a selection interview.\n\nIf you are a displaced or surplus Federal employee (eligible for the Career Transition Assistance Plan (CTAP)/Interagency Career Transition Assistance Plan (ICTAP)) you must receive a score in the middle category or better to be rated as \"well qualified\" to receive special selection priority.\nBenefits\n\nA career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\nRequired Documents\nAs a new or existing federal employee, you and your family may have access to a range of benefits. Your benefits depend on the type of position you have - whether you're a permanent, part-time, temporary or an intermittent employee. You may be eligible for the following benefits, however, check with your agency to make sure you're eligible under their policies.\nA complete application includes 1. A résumé, 2. Vacancy question responses, and 3. Submission of any required documents. Please note that if you do not provide all required information, as specified in this announcement, you may not be considered for this position (or may not receive the special consideration for which you may be eligible).\n\nPlease ensure all required documents, including any required work samples, narratives, or other materials as stated in this announcement, are attached to your application package\n\nAll applicants are required to submit a résumé either by creating one in USAJOBS or uploading one of their own choosing. (Cover letters are optional.) To receive full credit for relevant experience, please list the month/date/year and number of hours worked for experience listed on your résumé. We suggest that you preview the online questions, as you may need to customize your résumé to ensure that it supports your responses to these questions. Please view résumé tips.\n\nVETERANS' PREFERENCE DOCUMENTATION: If you are claiming veterans preference, please see applicant guide for required documentation. In order to be considered for veterans preference, you must submit all required documentation as outlined in the applicant guide.\n\nCAREER TRANSITION ASSISTANCE PLAN (CTAP) OR INTERAGENCY CAREER TRANSITION ASSISTANCE PLAN (ICTAP) DOCUMENTATION: If you are a displaced or surplus Federal employee, click CTAP/ICTAP for eligibility and a detailed list of required documents you must submit in order to be eligible.\nIf you are relying on your education to meet qualification requirements:\nEducation must be accredited by an accrediting institution recognized by the U.S. Department of Education in order for it to be credited towards qualifications. Therefore, provide only the attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education.\nFailure to provide all of the required information as stated in this vacancy announcement may result in an ineligible rating or may affect the overall rating.\nHow to Apply\nAFRH has partnered with the Treasury's Bureau of the Fiscal Service to provide certain personnel services to its organization. Fiscal Service's responsibilities include advertising vacancies, accepting and handling applications, and extending job offers.\n\nPlease review the entire announcement before applying.\n\nThe following instructions outline our application process. You must complete this application process and submit any required documents by 11:59 p.m. Eastern Time (ET) on the closing date of this announcement. We are available to assist you during business hours (normally 8:00 a.m. - 5:00 p.m. ET, Monday - Friday). If applying online poses a hardship, please contact us by noon ET on the announcement's closing date.\n\nThe Bureau provides reasonable accommodation to applicants with disabilities on a case-by-case basis. Please contact us if you require this for any part of the application and hiring process.\n\nTo begin, click Apply to access the online application. You will need to be logged into your USAJOBS account to apply. If you do not have a USAJOBS account, you will need to create one before beginning the application.\nFollow the prompts to select your resume and/or other supporting documents to be included with your application package. You will have the opportunity to upload additional documents to include in your application before it is submitted. Your uploaded documents may take several hours to clear the virus scan process.\nAfter acknowledging you have reviewed your application package, complete the Include Personal Information section as you deem appropriate and click to continue with the application process.\nYou will be taken to the online application which you must complete in order to apply for the position. Complete the online application, verify the required documentation is included with your application package, and submit the application.\nTo verify the status of your application:\nLog into your USAJOBS account (USAJOBS Login), all of your applications will appear on the Welcome screenUnder \"application status,\" click \"Track this application\" and you will be taken to the agency website where you can check your application status. For more information regarding the job and applicant status, please refer to https://www.usajobs.gov/Help/how-to/application/status/\n\nIf you wish to make changes/updates to your application and the vacancy is still open, you can click on the job announcement and \"Update Application\" to be taken back to your application. No updates can be made once the announcement has closed.\n\nPlease notify us if your contact information changes after the closing date of the announcement. Also, note that if you provide an email address that is inaccurate or if your mailbox is full or blocked (e.g., spam-blocker), you may not receive important communication that could affect your consideration for this position.\n\nFor additional information on how to apply, please visit the Partnership for Public Service's Go Government website.\n\nTo preview the assessment questionnaire: https://apply.usastaffing.gov/ViewQuestionnaire/11380366\nAgency contact information\nApplicant Call Center\nPhone\n304-480-7300\nEmail\nAFRHINQUIRIES@fiscal.treasury.gov\nAddress\nHEALTHCARE SERVICES\nAdministrative Resource Center\nParkersburg, WV 26101\nUS\n\nNext steps\nOnce the online questionnaire is received, you will receive an acknowledgement email that your submission was successful. We will review your resume and transcript(s) (if appropriate) to ensure you meet the basic qualification requirements. We will evaluate each applicant who meets the basic qualifications on the information provided and may interview the best-qualified applicants. After making a tentative job offer, we will conduct any required suitability and/or security background investigation.\nFair and Transparent\nThe Federal hiring process is setup to be fair and transparent. Please read the following guidance.\nEqual Employment Opportunity (EEO) Policy\nReasonable accommodation policy\nFinancial suitability\nSelective Service\nNew employee probationary period\nSignature and false statements\nPrivacy Act\nSocial security number request\n\nRequired Documents\nA complete application includes 1. A résumé, 2. Vacancy question responses, and 3. Submission of any required documents. Please note that if you do not provide all required information, as specified in this announcement, you may not be considered for this position (or may not receive the special consideration for which you may be eligible).\n\nPlease ensure all required documents, including any required work samples, narratives, or other materials as stated in this announcement, are attached to your application package\n\nAll applicants are required to submit a résumé either by creating one in USAJOBS or uploading one of their own choosing. (Cover letters are optional.) To receive full credit for relevant experience, please list the month/date/year and number of hours worked for experience listed on your résumé. We suggest that you preview the online questions, as you may need to customize your résumé to ensure that it supports your responses to these questions. Please view résumé tips.\n\nVETERANS' PREFERENCE DOCUMENTATION: If you are claiming veterans preference, please see applicant guide for required documentation. In order to be considered for veterans preference, you must submit all required documentation as outlined in the applicant guide.\n\nCAREER TRANSITION ASSISTANCE PLAN (CTAP) OR INTERAGENCY CAREER TRANSITION ASSISTANCE PLAN (ICTAP) DOCUMENTATION: If you are a displaced or surplus Federal employee, click CTAP/ICTAP for eligibility and a detailed list of required documents you must submit in order to be eligible.\nIf you are relying on your education to meet qualification requirements:\nEducation must be accredited by an accrediting institution recognized by the U.S. Department of Education in order for it to be credited towards qualifications. Therefore, provide only the attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education.\nFailure to provide all of the required information as stated in this vacancy announcement may result in an ineligible rating or may affect the overall rating.\nHelp\nThis job is open to\nThe public\nU.S. Citizens, Nationals or those who owe allegiance to the U.S.\nClarification from the agency\nU.S Citizens or U.S. Nationals; No prior federal experience is required.", "url": "https://www.indeed.com/viewjob?jk=45ae4ebf3a8b1472&from=serp&vjs=3"},
{"job_title": "Remote, Environmental Claims Specialist", "summary": "Investigates, evaluates and resolves environmental general liability and homeowners liability claims.\nAssignment may include a predetermined section of open…", "company": "Liberty Mutual Insurance", "location": "Remote", "job_description": "Investigates, evaluates and resolves environmental general liability and homeowners liability claims. Assignment may include a predetermined section of open inventory or cases that present high exposure. Resolves coverage and liability issues by applying established procedures and practices. Provides customer service to current and former policyholders, vendors and third party claimants.\nCasualty experience preferred.\nResponsibilities:\nManages processes and resolves claims assigned by the Unit Director/Team Manager. Evaluates coverage, liability and loss value and resolves claims within prescribed authority.\nCommunicates with policyholders/customers, witnesses, claimants, remediation experts, counsel and others to gather claim facts. Communication is generally via phone and email, but may include in person contact and travel.\nMaintains adequacy of reserve levels for both loss and expense.\nAnalyzes complex coverage matters and is responsible for issuing Coverage Position Letters to customers. Utilizes HO Legal Staff to consult on coverage issues as needed. Written work sample may be requested.\nTracks litigation expenses on assigned cases and makes recommendations to improve litigation expense management.\nNegotiates settlements with attorneys, claimants, and/or co-defendants, and cost share agreements with other carriers.\nMay participate in the development of legal strategies in conjunction with claims/legal team. Prepares for and attends trials, hearings and conferences. Keeps management informed of developments and confers with in-house and outside counsel and management on jurisdictional issues.\nUpdates files and provides comprehensive reports as required, in accordance with established departmental procedures.\nMust have an advanced knowledge of coverage, liability, and complex claims handling procedures.\nMust be knowledgeable of state and federal laws in the adjuster's jurisdiction.\nA full working knowledge of claims operations and procedures is required.\nStrong written and oral communication skills required as well as strong interpersonal, analytical, investigative, and negotiation skills.\nThe capabilities, skills and knowledge required is normally acquired through a Bachelor's degree or equivalent experience and at least 5-7 years of directly related experience.\nAbility to obtain proper licensing as required.\nAt Liberty Mutual, our purpose is to help people embrace today and confidently pursue tomorrow. That's why we provide an environment focused on openness, inclusion, trust and respect. Here, you'll discover our expansive range of roles, and a workplace where we aim to help turn your passion into a rewarding profession.\nLiberty Mutual has proudly been recognized as a “Great Place to Work” by Great Place to Work® US for the past several years. We were also selected as one of the “100 Best Places to Work in IT” on IDG's Insider Pro and Computerworld's 2020 list. For many years running, we have been named by Forbes as one of America's Best Employers for Women and one of America's Best Employers for New Graduates—as well as one of America's Best Employers for Diversity. To learn more about our commitment to diversity and inclusion please visit: https://jobs.libertymutualgroup.com/diversity-inclusion\nWe value your hard work, integrity and commitment to make things better, and we put people first by offering you benefits that support your life and well-being. To learn more about our benefit offerings please visit: https://LMI.co/Benefits\nLiberty Mutual is an equal opportunity employer. We will not tolerate discrimination on the basis of race, color, national origin, sex, sexual orientation, gender identity, religion, age, disability, veteran's status, pregnancy, genetic information or on any basis prohibited by federal, state or local law.\n\n14", "url": "https://www.indeed.com/viewjob?jk=ba0b78a09f94c0a9&from=serp&vjs=3"},
{"job_title": "newEntry Level Paint Engineer Rotational", "summary": "The career level process engineer, able to work autonomously with occasional guidance from supervision.\nAs a Paint Process engineer in the Rotational Programyou…", "company": "General Motors", "location": "Arlington, TX 76010 (East area)+31 locations", "job_description": "Job Description\n\nJob Description:\n\nThe career level process engineer, able to work autonomously with occasional guidance from supervision. Skilled in equipment/tooling alternatives, sequence, and flow of operations for the effective utilization of personnel, material, machines, and facilities necessary to produce parts. Work is performed in a centralized manufacturing engineering activity or assembly/plant activity where creativity and initiative is exercised as well as independent judgment.\n\nResponsibilities:\n\nAs a Paint Process engineer in the Rotational Programyou will rotate through a series of positions and assignments in plant sought to cultivate development and to educate. These positions are hands-on and engaging. You will learn problem solving on the fly, to work collaboratively with many members of the team, and be able to flex your creative muscles.\n\nPaint Process Engineer\n\n\nProgramming of manufacturing technology\nAnalyze product, process, and technology to craft best methods to paint & assemble\nvehicles, and protect the manufacturing process\n\nRecommend and validate improvement for existing processes\nDevelop tools to improve program/project management\nSupport development of cybersecurity tools for manufacturing\nAssists in the design and building of tools and equipment\nAssists maintenance personnel in operation and maintenance of specialized equipment\nTroubleshoots special maintenance and equipment problems\nCoordinates machinery upgrade projects\nGlobal Manufacturing Engineering Vehicle Systems - Paint Engineer\n\nResponsible for value-added systems from exit of Body Shop through shipping\nof finished vehicle\n\nDevelop and Validate new Manufacturing Technologies and BOE for Automation, Paint, and General Assembly Shops\nDesign and Develop Processes, Machine & Equipment and Tools for 50+ Assembly Plants, and approximately 30 launches each year globally\nDevelop, Validate, and Maintain Common Conveyance Systems and Controls\nSupport Development, Validation, and Maintenance Practices of Cybersecurity\nTechnology to create a secure factory\n\nWork collaboratively with cross-functional teams to reduce energy and waste globally.\nJob locations in various plant locations throughout the U.S.A. and sometimes at the Manufacturing Engineering Headquarters in Warren, MI. The U.S. Plant locations may include:\n\nDetroit, MI\n\nFlint, MI\n\nLansing, MI\n\nLake Orion, MI\n\nFort Wayne (Roanoke), IN\n\nBowling Green, KY\n\nFairfax, KS\n\nWentzville, MO\n\nSpring Hill, TN\n\nArlington, TX\n\nSome travel may be required.\n\nAdditional Job Description\n\nQualifications:\n\nPossess or currently pursuing a bachelor's degree in Electrical Engineering, Electrical Engineering Technology, Mechanical Engineering, Mechanical Engineering Technology, Chemical Engineering, Robonautics or Robotics, Industrial & Systems Engineering, Industrial Engineering, Controls Engineering, Controls Systems Engineering, Manufacturing Engineering, Automotive/Automation Engineering, Civil Engineering, Construction Management, Environmental Engineering, Industrial Safety, Management, Material Science/Engineering, Occupational Health and Safety, Organizational Development, Production Engineering, and Supply Chain\nGraduating between April 2021-June 2022\nAble to work fulltime, 40 hours per week\n\nDesiredSkills:\n\nKnowledge of statistical methods as applied to experimental design and process development\nOutstanding interpersonal and relationship management skills with the ability to effectively collaborate with varying levels of the organization as needed\nExcellent written and verbal communication skills with the ability todistillcomplex subjects to a wider audience\nEmerging partnership and collaboration skills and ability to learn from and share knowledge with co-workers in a fast-paced environment\nHigh level of integrity, ability to deal with ambiguity, take initiative/self-directed\nEvidence of strong character with integrity, honesty, accountability, and trust\nConsistently demonstrates innovative thinking that is customer-centric\nThis role offers the following Work Appropriately strategies:\n\nOnsite: This position requires an employee to be on-site on a full-time basis.\nPLEASE ONLY APPLY IF YOU DO NOT NEED SPONSORSHIP TO WORK IN THE UNITED STATES NOW OR IN THE FUTURE. WE ARE UNABLE TO CONSIDER CANDIDATES WHO REQUIRE SPONSORSHIP.\n\nAbout GM\n\nOur vision is a world with Zero Crashes, Zero Emissions and Zero Congestion and we embrace the responsibility to lead the change that will make our world better, safer and more equitable for all.\n\nWhy Join Us\n\nWe aspire to be the most inclusive company in the world. We believe we all must make a choice every day - individually and collectively - to drive meaningful change through our words, our deeds and our culture. Our Work Appropriately philosophy supports our foundation of inclusion and provides employees the flexibility to work where they can have the greatest impact on achieving our goals, dependent on role needs. Every day, we want every employee, no matter their background, ethnicity, preferences, or location, to feel they belong to one General Motors team.\n\nBenefits Overview\n\nThe goal of the General Motors total rewards program is to support the health and well-being of you and your family. Our comprehensive compensation plan incudes, the following benefits, in addition to many others:\nPaid time off including vacation days, holidays, and parental leave for mothers, fathers and adoptive parents;Healthcare (including a triple tax advantaged health savings account and wellness incentive), dental, vision and life insurance plans to cover you and your family;Company and matching contributions to 401K savings plan to help you save for retirement;Global recognition program for peers and leaders to recognize and be recognized for results and behaviors that reflect our company values;\nTuition assistance and student loan refinancing;Discount on GM vehicles for you, your family and friends.\n\nDiversity Information\n\nGeneral Motors is committed to being a workplace that is not only free of discrimination, but one that genuinely fosters inclusion and belonging. We strongly believe that workforce diversity creates an environment in which our employees can thrive and develop better products for our customers. We understand and embrace the variety through which people gain experiences whether through professional, personal, educational, or volunteer opportunities.GM is proud to be an equal opportunity employer.\n\nWe encourage interested candidates to review the key responsibilities and qualifications and apply for any positions that match your skills and capabilities.\n\nEqual Employment Opportunity Statements\n\nThe policy of General Motors is to extend opportunities to qualified applicants and employees on an equal basis regardless of an individual's age, race, color, sex, religion, national origin, disability, sexual orientation, gender identity/expression or veteran status. Additionally, General Motors is committed to being an Equal Employment Opportunity (EEO) Employer and offers opportunities to all job seekers including individuals with disabilities. If you need a reasonable accommodation to assist with your job search or application for employment, email us atCareers.Accommodations@GM.com. In your email, please include a description of the specific accommodation you are requesting as well as the job title and requisition number of the position for which you are applying.", "url": "https://www.indeed.com/viewjob?jk=ddb92e66a722abe2&from=serp&vjs=3"},
{"job_title": "newCounsel, Employment Law Manager", "summary": "3-5 years as a practicing lawyer.\nProvide day-to-day counsel and advice on employee relations issues, performance issues, investigations, misconduct claims,…", "company": "Deloitte", "location": "Hybrid remote in Tampa, FL+14 locations", "job_description": "Do you thrive on developing creative and innovative insights to solve complex challenges? Want to work on next-generation, cutting-edge products and services that deliver outstanding value and that are global in vision and scope? Work with other experts in your field? Work for a world-class organization that provides an exceptional career experience with an inclusive and collaborative culture?\nWant to make an impact that matters? Consider Deloitte Global.\nWork you'll do:\nProvide day-to-day counsel and advice on employee relations issues, performance issues, investigations, misconduct claims, disciplinary actions, employee terminations, employment policies, hiring and contracts, wage and hour compliance, leaves of absence, accommodations, independent contractor issues, employee benefits, unemployment and other state agency claims, non-compete and non-solicitation agreements, and other restrictive covenants.\nReview and advise business leaders regarding employment law risks implicated by proposed firm communications, publications, atraining modules, and other firm documents.\nEvaluate and respond to subpoenas and court orders requesting company records and information in compliance with established protocols, federal and state law and other regulatory requirements.\nProactively identify and assess legal risks and opportunities within the labor and employment law area and advise internal clients and stakeholders accordingly;\nSupport Employment Law Department strategy to ensure compliance with all applicable employment laws, regulations and policies.\nProvide employment law support for worldwide strategic business initiatives and diversity, equity and inclusion efforts.\nAssist with employment litigation, e-discovery processes, dispute resolution, government and internal investigations and audits in relation to employment matters.\nProvide counsel on litigation matters, restructuring, reductions in force, and international staffing agreements.\nAssist with employee and manager training and collaborate with Global HR to advise on best practices.\n\nWhat you'll be part of - our Deloitte Global Culture:\n\nAt Deloitte, we expect results. Incredible—tangible—results. And Deloitte Global professionals play a unique role in delivering those results. We reach across disciplines and borders to serve our global organization. We are the engine of Deloitte. We develop and implement global strategies and provide programs and services that unite our network.\n\nIn Deloitte Global, everyone has opportunities. We see the importance of your perspective and your ability to create value. We want you to fit in—with an inclusive culture, focus on work-life fit and well-being, and a supportive, connected environment; but we also want you to stand out—with opportunities to have a strategic impact, innovate, and take the risks necessary to make your mark.\nWho you'll work with:\n\nGlobal General Counsel provides legal guidance and expertise to Deloitte Global, the broader Deloitte organization, and our business leaders. We advise on regulatory, claims, and corporate legal matters, as well as additional issues that may pose novel or unique situations.\nHow you'll grow:\n\nDeloitte Global inspires our people at every level. We believe in investing in you, helping you at every step of your career, and helping you identify and hone your unique strengths. We encourage you to grow by providing formal and informal development programs, coaching, and mentoring. We want you to ask questions, take chances, and explore the possible.\n\nBenefits you'll receive:\n\nDeloitte’s Total Rewards program reflects our continued commitment to lead from the front in everything we do — that’s why we take pride in offering a comprehensive variety of programs and resources to support your health and well-being needs. We provide the benefits, competitive compensation, and recognition to help sustain your efforts in making an impact that matters.\nCorporate Citizenship:\n\nDeloitte is led by a purpose: to make an impact that matters. This purpose defines who we are and extends to relationships with our clients, our people, and our communities. We believe that business has the power to inspire and transform. We focus on education, giving, skill-based volunteerism, and leadership to help drive positive social impact in our communities.\n\nRequires a JD and current bar admission\n3-5 years as a practicing lawyer\nOther Qualifications:\nThe ideal candidate for this role will have law firm experience with a recognized law firm with significant experience practicing employment law\nThe ideal candidate for this role will have experience in counseling clients on labor and employment matters.\nExperience in the litigation of employment-related cases\nExperience conducting and/or supporting internal employment-related investigations\nExperience in drafting, reviewing and negotiating various employment agreements and policies related to employment matters\nExperience interfacing with government employment agencies which maintain jurisdiction over employment-related legal matters\n\n#LI-Hybrid (remote may be an option)", "url": "https://www.indeed.com/viewjob?jk=9c5cbf9c32e443d4&from=serp&vjs=3"},
{"job_title": "National Agricultural Law Center Research Fellows- Remote Po...", "summary": "Food safety and food labeling;\nAgricultural finance and credit; and.\nOther relevant issues such as agricultural data and technology, local and regional food…", "company": "Division of Agriculture of the University of...", "location": "Remote in Arkansas", "job_description": "Type of Position:\nJob Type:\nTemporary (Fixed Term)\nWork Shift:\nInstitution Name:\nDivision of Agriculture of the University of Arkansas\nThe University of Arkansas System Division of Agriculture is a state wide campus, with faculty based on University campuses, at Research and Extension Centers and in every Arkansas county. It consists of the Arkansas Agricultural Experiment Station (AES) and the Arkansas Cooperative Extension Service (CES), and is home to more than 1400 employees. The Division was established in 1959 and is headed by the Vice-President for Agriculture. The Division headquarters is located in Little Rock with the rest of the University of Arkansas System Administration. As an employer, the University of Arkansas System Division of Agriculture offers a vibrant work environment and a workplace culture that promotes a healthy work-life balance.\nBelow you will find the details for the position including any supplementary documentation and questions you should review before applying for the opening. To apply for the position, please click the Apply link/button.\nIf you have a disability and need assistance with the hiring process and require reasonable accommodations, please contact the Division's Office of Inclusion, Access, and Compliance at bbatiste@uaex.edu.\nFor general application assistance or if you have questions about a job posting, please contact Human Resources at 501-671-2219 or 479-502-9820.\nDepartment:\nDivision of Agriculture\nSummary of Job Duties:\nThe National Agricultural Law Center Research Fellows- Remote Position (Evergreen) is a pool posting that will be used to collect applications to fill related temporary positions as they become available. This pool posting will expire on November 1, 2020. Applicants wishing to be considered after this date must re-apply.\n\nThe position will focus on conducting legal research and writing projects that meaningfully assist the NALC and its partners in serving state, regional, and national stakeholders in furtherance of its mission as the nation’s leading source of objective agricultural and food law research and information. Specific areas of research include but are not limited to:\nEnvironmental regulation of agriculture;Food safety and food labeling;Agricultural finance and credit; andOther relevant issues such as agricultural data and technology, local and regional food systems, and agricultural labor.\nQualifications:\nSuccessful applicants will have completed at least their first year of law school and have demonstrated skills and experience in legal research and writing. Previous experience or background in agriculture is preferred, but not required. A GPA of 3.0 or higher is preferred, but not required. Applicants must be motivated and capable of reliably implementing work projects in a distance working arrangement. This position will require a commitment of at least ten hours a week, with flexibility given for exams and other academic or holiday events.\nAdditional Information:\nThis is not the initial application. Interested applicants should contact Senior Staff Attorney Elizabeth Rumley at erumley@uark.edu for more information about potential openings before filling in this application.\nApplications must include at least one letter of reference that speaks to the applicant’s research and writing skills.\nPre-employment Screening Requirements:\nThe University of Arkansas System Division of Agriculture may conduct pre-employment background checks on certain positions for applicants being considered for employment. The background checks may include a criminal background check and a sex offender registry check. Required checks are identified in the position listing. A criminal background check or arrest pending adjudication information alone shall not disqualify an applicant in the absences of a relationship to the requirements of the position. Background check information will be used in a consistent, non-discriminatory manner consistent with the state and federal law.\nThe University of Arkansas System Division of Agriculture commits itself to policies of affirmative action and diversity with respect to both employment opportunities and program participation. The Division complies with these policies not merely because of legal requirements, but because we believe that such practices are basic to human dignity. As such, the Division welcomes all applicants to apply without regard to race, color, sex, gender identity, sexual orientation, national origin, religion, age, disability, marital or veteran status, genetic information, or any other legally protected status. Candidates must have proof of legal authority to work in the United States on the first day of employment. All applicant information is subject to public disclosure under the Arkansas Freedom of Information Act.\nConstant Physical Activity:\nFrequent Physical Activity:\nOccasional Physical Activity:\nBenefits Eligible:", "url": "https://www.indeed.com/viewjob?jk=f7fe336a7d60b578&from=serp&vjs=3"},
{"job_title": "Administrative Assistant – BDS", "summary": "Typically a minimum of 2 days per week in office is required.\nUtilize excel, and outlook to send mail merges.\nBuild relationships with prospective customers.", "company": "MITC", "location": "Remote in Frederick, MD+1 location", "job_description": "We’re looking for someone to join our Business Development Team at MITC! Do you want to help nurture and grow a fast paced, growing company? If that sounds exciting to you, keep reading!\nAbout You\nYou are obsessed with details. You know that for some things the details are what matter most.\nYou are an excellent communicator. You make sure documents and spreadsheets cover any questions people may have and you make sure all relevant parties know about your work.\nYou can wear many hats and have a strong desire to learn.\nYou welcome change, and easily shift gears between projects.\nThings You Might Do\nWork in the database to ensure all records are up to date.\nOnline research\nCreate postcard and letter mailings\nBuild relationships with prospective customers\nReach out to prospective customers via phone and email.\nUtilize excel, and outlook to send mail merges.\nAbout MITC\n\nMITC is staffed by intelligent people, each of whom is actively involved in helping organizations around the world do things better, more efficiently, and more productively. From software consulting and software development to sales and marketing and administration, MITC has opportunities for bright and energetic individuals to build the careers they want at this successful company.\n\nThe Whole Package\nLocation: Frederick, MD\n\nThe city appeals to residents who look for more than just a commuter lifestyle amid the D.C. corridor. A successful blend of history and innovation, Frederick encourages creative, entrepreneurial-minded residents to make things happen. That’s why Frederick was named one of the Top 100 Best Places to Live.\n\nCompensation:\nCompetitive salary\nAccelerated earnings potential\nMedical, life insurance, disability\n401(K) Retirement plan\nUp to 4 weeks vacation\n\nWe’re interested in investing in you.\n\nEmployees at MITC have the flexibility of growth within their department, or across departments. We think this makes the most well rounded employees, and gives opportunities to people who work hard, and are interested in growth.\n\nLogistics, Travel, & Requirements\nThis is a hybrid position, working in office and remotely. Full in office is available as well. Typically a minimum of 2 days per week in office is required.\nThis role includes light travel. Typically this would be 1 to 3 times per year travelling to conferences throughout the US.\nMITC supplies a laptop, mobile phone with hotspot, and any necessary equipment.\nCovid vaccination required for all MITC positions.\nHow to Apply\n\nApplying is simple.\n\nWe have a non-standard application process. To jump start the process we ask a few questions we normally would ask at the start of an interview. This helps speed up the hiring process and lets us get to know you a bit better right out of the gate. Make sure to answer each question. Have fun with them.", "url": "https://www.indeed.com/viewjob?jk=1aa16370a61361de&from=serp&vjs=3"},
{"job_title": "newCall Center Representative | Captioning Assistant", "summary": "The role of a Captioning Assistant is not your traditional or typical customer service role.\nCapTel Service includes all of the fun, positive and rewarding…", "company": "Communication Service for the Deaf, Inc", "location": "Remote in Dayton, OH+5 locations", "job_description": "Captioning Assistant (OH)\nOpportunity to Work-from-Home\nPart-Time\n$14.00 per hour\n18 years or older\nDescription\nCommunication Service for the Deaf is looking for a Captioning Assistant with excellent customer service skills and communication skills to work in our Moraine, Ohio Contact Center.\nThe role of a Captioning Assistant is not your traditional or typical customer service role. CapTel Service includes all of the fun, positive and rewarding aspects of customer support (office setting, consistent schedule, assisting communication) and eliminates the more exhausting aspects of a call center environment like, sales, quotas, angry customers, troubleshooting & diagnostics, conflict de-escalation, strict call-handle time, or call-waiting queues.\nBenefits\nStarting wage of $14.00 per hour.\nHiring for part-time and full-time positions\nEligible for salary increases twice a year.\nPaid time off (for full-time and part-time employees)\nPaid employee benefits for full-time employees after 90 days\nEmployee rewards for good attendance and performance\nStudent loan forgiveness eligibility (due to non-profit status)\nFlexible backgrounds\nDown time is YOUR time!\nNo sales, no quotas, no tech support, no customer conflict de-escalation\nDown time is your time\nDid we mention that down time is YOUR time? Because our call center does not have call-waiting queues you can expect to have a little bit of down time between each phone call. During this time you are able to work on personal projects at your work station, with the exclusion of using some electronic devices such as cell phones. It’s a great way to work on some homework, read the books you never have time for, pick up a new hobby (perhaps knitting or crocheting), or learn something new – like American Sign Language!\nRequirements\nHigh School Diploma or equivalent\nAt least 18 years of age or older\nExcellent reading and vocabulary skills\nTyping skill of at least 35 WPM with a low error rate using a personal computer\nWant to practice your typing speed before you apply? Click here and try the 5 minute typing test.\nAbility to work holidays, weekends and evenings\nExperience working in a call center or providing customer service in a retail or similar environment (preferred)\nBenefits\nMake a Difference\nAs a non-profit organization, “service” is our middle name. If you're interested in making a difference (and getting paid for it) then CSD may be the place for you.\nWhy is customer service an important skill for our captioning assistants to have? Using a voice-recognition application, Captioning Assistants support communications for deaf or hard of hearing callers using a Captioned Telephone. Your role would be to listen to the speaker and repeat what they are saying into the voice recognition software. The software then transcribes your spoken words into written captions for our clients. This works similar to closed captioning you see on TV! To see a Captioning Assistant in action, please click here.\nOur call center is unlike any call center environment you’ve ever experienced before. It’s truly a position where you can experience the best of both worlds – a call center environment without the hassle of difficulties of customer relations. Simply put, you're processing telecommunications for Deaf and Hard of Hearing individuals - that's it. Each and every day, the work that you'll be doing is making a difference and an impact in someone else's life.\nBeing the Best Possible\nCSD is looking to hire team members who are passionate, dedicated, and inspired by their work. We want people who truly care. Click here to see what others have to say about the Captioning Assistant position.\nDo Good Things\nCSD does important work, including championing access, developing technology that changes the world’s interactions, and tons of community service. We’re proud of the work we’ve done and want you to join us in doing good things.\nCommunication Service for the Deaf, Inc. is an Equal Opportunity Affirmative Action Employer and drug free and tobacco free workplace. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law.\nCSD offers a competitive benefits package for full-time employees. For a full list of benefits and perks, please visit the career page.\nKeywords: office, retail, call center, customer service, office assistant, clerical support, receptionist, administrative assistant, front-desk clerk, data entry clerk, voice announcements, entry level, non-profit, typing, computers, telecommunications, customer service representative", "url": "https://www.indeed.com/viewjob?jk=9308aa4f7019f047&q=Assistant&l=USA&from=web&advn=5406143878016376&adid=383275955&ad=-6NYlbfkN0C54ULrJVzjcoiAFx9vgkGVDXoCeTXjgP1XOapvmM72p_DD5sEYDf9kV54xvAEddPFdqvKpBog2szVkRu9FBwroGzxm-xsfGMFZY0YaaYWDXkkezMY4IvIPfwmj56pWHj8JtObjHHW8eCyR5M9QlXD32BJYwWVA8sBNNz0uMWbEvzDwh3dqQ0X11Pq3S3ARwX4CchgXQgbfzJkJmisR-8o7of3mstERVwC5siPwvW-Psso5VlPR5VA3aBGfEqoCCZvj2-V0xniwaHmLr--14R8AzSgil0Z_6AW8M2LRKHgDQ0lbucmxBIRVVNJc9ierVVXO7giIRWZZ3FjkqwhiWICF9tnYg6v6gukomSAo8juvo5D130ecIVtz&sjdu=o4-SOnWFj7zDQa1x_oNfXc50hnu2EKSjZRYVnWnz4BcIYwEIC7ii-bEDipuB6CMwpwhjEEEsYZncvHlV6CatJuQ-2tMD8Ypb_ZGDWYV-hzvn5rvxYc1_GGixKHuvctan0AoSOyqRX22-d0bxFssQFsZDp70hPAAhF2Gwev4p2YneQyoVIuE0IaGreQGoB4Nk7WRwXyCq7aCeolVolY1kJw&acatk=1frf14qluoc8s800&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "newEntry Level Developer", "summary": "Build your technical and strategic skills as you work alongside crew from across the business.\nDesign front-end and back-end solutions for test-driven…", "company": "Vanguard", "location": "Malvern, PA", "job_description": "Finance and IT are coming together within Vanguard's Transfer Agency ecosystem inclusive of technology, processes and governance; if you enjoy project management and thrive in ambiguous environments, have strong conceptual thinking skills, and are the ultimate team player then this role could be right for you!\nThe Entry Level Developer:\nBuild your technical and strategic skills as you work alongside crew from across the business\nDesign front-end and back-end solutions for test-driven development\nChampion innovative ways, from concept to execution, that will help give crew and our clients the best chance for success\nShare your ideas and make your voice heard in an open collaborative team environment\nUse your agility and curious mind to respond to new challenges in a fast-paced and rapidly changing environment\nFollow agile methodologies such as Scrum, Kanban or adopt Lean principles\nBuild Angular web applications and Restful micro-services using Java hosted on the AWS cloud\nWork on continuous delivery pipeline using Bamboo and run automated tests using Junit, Protractor, Jasmine and Selenium\nWhat it takes:\nUndergraduate degree in a related field or the equivalent combination of training and experience\n0 - 3 years of relevant experience\nGood written and oral communication skills\nGood analysis and problem solving skills\nSpecial Factors:\nVanguard is not offering visa sponsorship for this position.\nAbout Vanguard\nWe are Vanguard. Together, we’re changing the way the world invests.\nFor us, investing doesn’t just end in value. It starts with values. Because when you invest with courage, when you invest with clarity, and when you invest with care, you can get so much more in return. We invest with purpose – and that’s how we’ve become a global market leader. Here, we grow by doing the right thing for the people we serve. And so can you.\nWe want to make success accessible to everyone. This is our opportunity. Let’s make it count.\nInclusion Statement\nVanguard’s continued commitment to diversity and inclusion is firmly rooted in our culture. Every decision we make to best serve our clients, crew (internally employees are referred to as crew), and communities is guided by one simple statement: “Do the right thing.”\nWe believe that a critical aspect of doing the right thing requires building diverse, inclusive, and highly effective teams of individuals who are as unique as the clients they serve. We empower our crew to contribute their distinct strengths to achieving Vanguard’s core purpose through our values.\nWhen all crew members feel valued and included, our ability to collaborate and innovate is amplified, and we are united in delivering on Vanguard's core purpose.\nOur core purpose: To take a stand for all investors, to treat them fairly, and to give them the best chance for investment success.\nFuture of Work\nDuring the pandemic, we transitioned to a work from home model for the majority of our crew and we continue to interview, hire, and on-board future crew remotely.\nAs we have developed the path forward, we have taken a thoughtful approach that both maximizes the advantages of working remotely and the many benefits of coming together and collaborating in a shared workspace. We believe that in-person interactions among our crew are important for preserving our unique culture and advantageous for the personal development of our crew.\nWhen our Crew return to the office, many will work in our hybrid model. A smaller proportion of our crew will operate in the Work from Home work model (for example, field sales crew); or in the Work from Office model (for example, portfolio managers).\nThe working model that your role falls into will be communicated to you in the interview process – please do ask if you are unsure. We encourage you to make the decision regarding your job interview and offer knowing which model your role will fall into. We will test and learn as our ways of working evolve and will continue to evaluate working models along the way.", "url": "https://www.indeed.com/viewjob?jk=235fe579add13bd2&from=serp&vjs=3"},
{"job_title": "newGraduate Engineer", "summary": "We strive to deliver the highest standard of service safely, efficiently, and to our client's full satisfaction.\nDiscuss and solve engineering problems.", "company": "Benthic", "location": "Texas", "job_description": "Job Description\nBenthic, part of Acteon Group, is a complete end-to-end provider of geophysical and geotechnical consulting, engineering, design, and data acquisition services. We strive to deliver the highest standard of service safely, efficiently, and to our client's full satisfaction. Our vision is to be globally recognized as a provider of best-in-class geotechnical survey and geo-consulting services, admired for our professionalism and ability to create value for all stakeholders.\n\nBenthic is looking to add a Graduate Engineer to the team. This position will commence with supporting Engineering while being cycled through Offshore Operations to gain proficiency in PROD operations. As competence is gained, the Graduate Engineer is expected to evolve into positions offshore, QA/QC or lead to a role in developing the next technology in the Engineering R&D department.\n\nThis is an entry level position; no prior experience is necessary.\n\nDuties\nProactively develop the PROD technology, assisting with integration and documentation of design changes and upgrades.\nSupport the Offshore Operations Team to ensure PROD runs safely, efficiently, and with maximum uptime\nRepair, maintenance and operation of the PROD and its associated tools and equipment\nAssembly, installation and test equipment in accordance with operational requirements, regulations and safety requirements\nAssist in the update of project procedures and quality manuals\nMaintain the security of the company's designs, drawings, and documents register database\nCreate and compile technical drawings and technical documentation reflecting the design and as-built configuration of the Company's assets\nEstablish and monitor compliance with any appropriate engineering standards\nProvide input into the design and development of any equipment related to the activities of the company\nPreparation of engineering drawings and technical specifications\nDeveloping a project specification with colleagues, often including those from other engineering disciplines\nDiscuss and solve engineering problems\nConsider the implications of issues such as cost, safety and time constraints\nWork with other professionals, within and outside the organization\n\nRequired\nBachelor's Degree in Engineering, preferably Mechanical, Electrical, or Mechatronics\nBasic skill of hand i.e. competence in the use of hand tools is a necessity\nCompetence in engineering drawing software packages, preferred\nKeep up-to-date with new equipment and developments in technology\nJob Snapshot\nLocation:\nOffshore\nJob Type:\nOffshore Roles & Technicians\nDate Posted:\n2/8/2022", "url": "https://www.indeed.com/viewjob?jk=651d99094920f4fa&from=serp&vjs=3"},
{"job_title": "Piping Stress Engineer--Remote", "summary": "S and you’ll be working alongside our team of engineers and designers to develop estimates and scopes of work, plan and organize project staffing, perform field…", "company": "Jacobs", "location": "Remote in Greenville, SC", "job_description": "Our People & Places Solutions business – reinforces our drive to improve the lives of people everywhere and epitomizes the \"why\" of what we do – the tremendous positive impact and value our solutions bring to our communities and society as a whole. From facilities delivering life-saving therapies and ensuring clean water to enabling the connection of people through all modes of transportation and providing access to technology – we're integrating a multitude of these solution elements to build the smart environments of tomorrow.\n\nStart your Jacobs career with a company that inspires and empowers you to deliver your best work so you can evolve, grow and succeed – today and into tomorrow.\nYour Impact:\nWe’re seeking a Piping Stress Engineer to join our Greenville, SC team of professionals to prepare Piping design packages. For this role, you can live anywhere within the U.S and you’ll be working alongside our team of engineers and designers to develop estimates and scopes of work, plan and organize project staffing, perform field investigations, interface with clients & vendors, and prepare construction design packages. You’ll be a key member of our team in layout and design of process and mechanical piping and equipment for various types of clients including industrial, chemical, pulp & paper, general manufacturing, and pharmaceutical facilities. We’ll tap into your expertise as you develop the design criteria for piping specifications, supports and stress analysis. We'll lean on you for your professional experience with 3D design software platforms for process equipment and piping, along with various construction deliverables that will bring value to clients.\nYour most impactful mission in this role is to act as a champion for our TogetherBeyond culture of caring at Jacobs. TogetherBeyond is our approach to living inclusion every day and enabling diversity and quality globally. For us, this means creating a culture of belonging where we all thrive by embracing all perspectives.\nAt Jacobs, we’re partnering across the globe to create the best project outcomes by maximizing the design, digital technology, and support capabilities of our Global Integrated Delivery (GID) teammates. By joining Jacobs, you’ll commit to supporting and engaging with these teams, as we work to build a company like no other.\nBring your curiosity, passion for innovation, and expertise. We’ll help you grow, pursue, and fulfill what inspires you – so we can make big impacts on the world, together.\nHere’s What You’ll Need:\nBachelor of Science in Mechanical Engineering.\nDemonstrated experience in the design and stress analysis of Piping systems.\nThorough knowledge of codes and standards related to design of Piping systems.\nIdeally, You’ll Also Have:\nExtensive experience in the design and stress analysis of Piping systems.\nProfessional engineering license.\nProficiency in CAESAR II, Autopipe, SmartPlant 3D, Plant 3D, AutoCAD.\nEffective communication and interpersonal skills to work well within a dynamic team environment with multiple deadlines.\nJacobs is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, religion, creed, color, national origin, ancestry, sex (including pregnancy, childbirth, breastfeeding, or medical conditions related to pregnancy, childbirth, or breastfeeding), age, medical condition, marital or domestic partner status, sexual orientation, gender, gender identity, gender expression and transgender status, mental disability or physical disability, genetic information, military or veteran status, citizenship, low-income status or any other status or characteristic protected by applicable law. Learn more about your rights under Federal EEO laws and supplemental language.\nU.S. Government Executive Order on ensuring adequate COVID safety protocols:\nAs a federal contractor of the U.S. government, Jacobs is subject to the Executive Order requiring companies who support U.S. government contracts to ensure their covered employees are fully COVID-19 vaccinated or approved for a legally-entitled medical or religious accommodation.\n\nFull vaccination is NOT required at this time for positions that are not covered by the federal contractor Executive Order, that do not require performance of work in a Jacobs office, and that do not have full vaccination as a client requirement where work is performed at a client site.\n\nAt Jacobs, we’re challenging today to reinvent tomorrow by solving the world’s most critical problems for thriving cities, resilient environments, mission-critical outcomes, operational advancement, scientific discovery and cutting-edge manufacturing, turning abstract ideas into realities that transform the world for good. With $13 billion in revenue and a talent force of more than 55,000, Jacobs provides a full spectrum of professional services including consulting, technical, scientific and project delivery for the government and private sector.", "url": "https://www.indeed.com/viewjob?jk=59c95aa5b578179a&from=serp&vjs=3"},
{"job_title": "Records Adjudication Specialist", "summary": "This job function is somewhat repetitive in nature and relies on gathering and analyzing data from various judicial-related governmental agencies such as State…", "company": "First Advantage", "location": "+1 locationRemote", "job_description": "The Records Adjudicator provides analytical & data entry services to our Public Records Adjudication Unit. This job function is somewhat repetitive in nature and relies on gathering and analyzing data from various judicial-related governmental agencies such as State and national Sex Offender Registries, Department of Corrections or County courthouses. This position is highly detail oriented and will require critical application of multiple, sometimes complex rules and regulations to determine and form an output report. The Adjudicator will be working on their own and must have exceptional time management skills, being able to prioritize and find clear balance between meeting production goals as well as maintaining acceptable levels of quality. Adjudicator will be working in a remote role and must have self-initiative and ability to maintain clear focus. This position may ask/require additional work hours above and outside of the standard schedule at times depending on volumes.\n\nThe ideal candidate has a customer-first mindset and aims to deliver high-quality service in every customer interaction.\nEssential Duties & Responsibilities:\nCritically evaluate information gathered from multiple sources; Reconcile variances of various data sources, ensure accuracy of data and apply appropriate scoring to finalize a case/element in compliance with client SOP.\nPrioritize and manage various departmental reports including and not limited to open element management and tracking of products.\nRequirements:\nEducation:\n\nHigh School Diploma or GED required. College Degree (BA or BS) preferred.\n\nExperience:\n1 year experience utilizing internet search engines, data entry, application of matrix based scoring\nPreferred: 3+ years experience utilizing internet search engines, data entry, application of matrix based scoring. History or Experience in Criminal Records, such as Court Clerk, Judiciary or Law Enforcement or with another Employment Screening company.\n\nOther Knowledge, Skills, Abilities or Certifications:\nIntermediate proficiency in Microsoft Office (Word, Excel & Outlook)\nMust possess a high degree of attention to detail, adaptability and the ability to multi-task along with solid written and verbal communication skills\nSelf starter; proactive in solving problems, self-motivated to achieve individual and organizational goals\nAdaptable/flexible; able to manage competing demands and changing priorities in a fast-paced environment, perform multiple tasks simultaneously, accept and handle regular interruptions, and manage/meet departmental performance goals\nPhysical Requirements:\nThis role is largely a sedentary in nature and involves sitting for long periods of time. The role requires the ability to lift and/or carry equipment and files up to 20 pounds, walk, bend or stand as necessary.\nWorking Environment:\n100% Remote Working Environment. This role routinely uses standard office equipment such as computers, phones, photocopiers, scanners, calculators, filing cabinets and fax machines.\nThe above statements are intended to describe the general nature and level of work being performed by most people assigned to this job. They are not intended to be an exhaustive list of all duties, responsibilities and requirements.\nUnited States Equal Opportunity Employment:\nFirst Advantage is proud to be a global leader in removing barriers and supporting our community members to ensure the changing demographics of the workforce are reflected in our hiring and employment practices. We value all of our candidates, employees, and clients, and place great emphasis on hiring and supporting qualified individuals in each role. We are an equal opportunity employer. We do not discriminate on the basis of race, color, ethnicity, ancestry, religion, sex, national origin, sexual orientation, age, citizenship status, marital status, disability, gender identity, gender expression, veteran status, genetic information, or any other area protected by applicable law.\n1YERyZpaA5", "url": "https://www.indeed.com/viewjob?jk=2a6bf1fd2b596788&from=serp&vjs=3"},
{"job_title": "Patent Prosecution Attorney or Agent (Electrical)", "summary": "We are seeking a full-time, immediate, Attorney or Agent to join the patent prosecution team.\nWe are a fast growing, thriving, mid-sized IP firm that originated…", "company": "Edell, Shapiro & Finnan", "location": "Gaithersburg, MD 20878", "job_description": "We are seeking a full-time, immediate, Attorney or Agent to join the patent prosecution team.\n\nAbout Us!\n\nWe are a fast growing, thriving, mid-sized IP firm that originated in the mid 80s. We are proud to boast a family friendly culture, a casual dress code, and a very convenient commute to those living in the suburbs of Montgomery County. We prefer local candidates, as face time is part of the job, but technologically offer the ability to work from home when desired (we are in the office at the present time). Our ideal candidate has a few years of experience at a high volume firm, and is looking for a quality of life adjustment. At ESF, we celebrate diversity and we are committed to creating an inclusive environment for all employees.\n\nWe serve a diverse client base, which includes small start-up companies, academic institutions, and Fortune 500 companies having some of the world’s largest IP portfolios. This client base values our knowledge, experience, and commitment to their objectives. While we can certainly port in your book of business, this position is primarily to support the firm’s existing client workload capacity. Training will be provided to understand client expectations.\n\nResponsibilities\n\nDraft patent applications for U.S.-based and some non-U.S.-based companies. Meet in-person or virtually with inventors, discuss the technology, and draft patent applications. Understand a wide range of technologies, or be able to quickly get up to speed on technologies.\nProsecute patent applications before the USPTO, including conducting examiner interviews, filing responses, appeals, etc.\nInstruct non-U.S.-based law firms in the prosecution of patent applications in various countries outside the U.S.\nConduct patentability, infringement/clearance and validity studies, and related client counseling and opinion rendering.\nParticipate in IPR proceedings at USPTO.\nCommunicate with outside counsel in connection with all activities mentioned above.\nWork in a wide range of technologies including wired and wireless networks and devices, wireless communication protocol technologies, media communication systems, network security, optical networks and devices, as well as medical electronic devices, and database systems.\n\n\nQualifications\n\nA successful applicant must possess:\n\nAt least 2 years of substantial patent application drafting experience, particularly in the technology areas listed above;\nRegistration as a U.S. patent attorney and knowledge of U.S. patent practice and procedures;\nJ.D. degree from an accredited law school and a license to practice in at least one U.S. state (unless applying as an agent);\nExcellent academic credentials;\nStrong writing, communication, organizational and analytical skills; and\nUndergraduate focus areas in electrical engineering, physics or computer science.\n\nBenefits\n\nFully paid employee health insurance\n401k matching\nHealth Club Reimbursement\nFirm sponsored LTD/Life\nEmployee Assistance Program\nMonthly wellness activities\nComplimentary Parking\nOn site café and walking access to Rio Restaurant District\n\nTo apply, please submit your resume, writing sample, and transcripts to our recruiting team at careers@usiplaw.com.", "url": "https://www.indeed.com/viewjob?jk=305a270d19e65b93&from=serp&vjs=3"},
{"job_title": "Senior Corporate Associate", "summary": "Our top tier law firm client is seeking a senior-level associate to join its fast-paced Corporate practice in Minneapolis serving Fortune 500 global companies.", "company": "National Litigation Services", "location": "Minneapolis, MN 55442", "job_description": "Job#: LFM04331\nLocation: Minneapolis\nClient: AMLAW 10 Firm\nExperience: 2-7 years\nOur top tier law firm client is seeking a senior-level associate to join its fast-paced Corporate practice in Minneapolis serving Fortune 500 global companies. The ideal candidate will have 7-9 years of substantive corporate transactional experience focusing on complex cross-border transactions, including mergers and acquisitions, joint ventures and global corporate restructurings. Top tier compensation package provided.", "url": "https://www.indeed.com/viewjob?jk=7b5cca41ec75137b&from=serp&vjs=3"},
{"job_title": "newDeputy Associate General Counsel for Litigation 2", "summary": "This job is open to.\nThose who meet the five Executive Core Qualifications (ECQs).\nU.S. Citizens, Nationals or those who owe allegiance to the U.S.", "company": "US Food and Drug Administration", "location": "Silver Spring, MD", "job_description": "Help\nThis job is open to\nSenior executives\nThose who meet the five Executive Core Qualifications (ECQs).\nThe public\nU.S. Citizens, Nationals or those who owe allegiance to the U.S.\nClarification from the agency\nAll groups of qualified individuals.", "url": "https://www.indeed.com/viewjob?jk=791a81c8c51098e4&from=serp&vjs=3"},
{"job_title": "Senior Counsel, International", "summary": "Each principle has a defined set of behaviors which help guide the 7-Eleven team to Serve Customers and Support Stores.", "company": "7-Eleven, Inc.", "location": "Irving, TX 75063 (Valley Ranch area)", "job_description": "Overview:\nWho we are\nImagine working in a place where continuous improvement and innovation is celebrated and rewarded; where fast-paced, high-impact teams come together to positively drive results for one of the largest & most iconic brands in the world.\nAs the only rapidly growing retailer, you may know us as your friendly neighborhood store. You probably know our familiar name, have seen our pervasive logo, and have tried our highly sought-after products, such as Slurpee® and Big Bite®. “Brain Freeze” is a 7-Eleven registered trademark for our 53-year old Slurpee® and with over 71,100 stores globally (more than any other retailer or food service provider), we sell over 14 million a month.\nBut there’s a lot more to our story and much more left to be written. We are transforming our business, ensuring we are customer obsessed and digitally enabled to seamlessly link our brick and mortar stores with digital products and services.\nAt 7-Eleven the entrepreneurial spirit is in our DNA and has been ever since our inception 90+ years ago. It’s what drove us to invent the convenience industry in 1927 by envisioning how a simple ice dock could provide household staples such as milk and eggs to better serve the needs of our customers.\nToday we are redefining convenience and the customer experience in big ways...we are fundamentally changing our culture and we want talented, innovative, customer obsessed, and entrepreneurial people like you to come make history with us.\nHow we lead\nAt 7-Eleven we are guided by our Leadership Principles.\nBe Customer Obsessed\nBe Courageous with Your Point of View\nChallenge the Status Quo\nAct Like an Entrepreneur\nHave an “It Can Be Done” Attitude\nDo the Right Thing\nBe Accountable\nEach principle has a defined set of behaviors which help guide the 7-Eleven team to Serve Customers and Support Stores.\nAbout This Opportunity\nDirects processes and teams for all Legal engagements and deliverables related to the growth and operation of the organization. Scope includes management of contract creation, trademark and IP protection, legal compliance, and litigation through inter-company legal resources and external legal support firms.\nResponsibilities:\nContract Development: Oversees and certifies contacts developed for various commercial applications, including but not limited to, business partnership agreements, supply and sales agreements, digital asset licensing agreements, and operations agreements for managing the organization. Participates in contract negotiations and ensures accurate and cost-effective use of outside legal resources.\nContract Litigation: Engages and oversees counsel as needed for resolution of legal disputes with existing partners.\nTrademarks and IP: Manages the counselor resources who execute and support registration, compliance, and infringement matters related to the 7-Eleven trademark and related designations. Provides legal guidance and support for matters related to intellectual property rights and assignments.\nLegal Due Diligence: Interface with resources to conduct market legal surveys and partner candidate background checks.\nOutside Counsel Management: Secures and manages relationships with outside counsel domestically and abroad for related organizational needs. Ensures quality relationship through effective contracts, budgets, and timely responses.\nCorporate Compliance: Engages with governance resources internally and inter-company to ensure organization is in compliance with corporate policies of the brand partners (SEI, SEJ, 7&i).\nOversees Contract Development Resources (~4 inter-company and/or external FTEs)\nOversees Trademark Legal Support Resources (~3 inter-company and/or external FTEs)\nKPI's\nMeeting business unit budget and financial goals.\nSuccessful and timely development, negotiation, and execution of business contracts and trademark registrations.\nTimely and effective resolution of litigation matters.\nMaintenance and credibility of organizational legal compliance.\nQualifications:\n\nEducation: Juris Doctor with preferred focus on Intl Contract Law\nWork Experience: 8+ Years in Contracts Development; Master Franchising and Licensing experience highly preferred\nManagement Experience: 5+ years leading teams of attorneys and paralegals\nLanguage Skills: English proficiency\nOther Qualifications: Experience managing diverse teams across multiple locations and cultures.\nLocation: Dallas, USA\nTravel Requirements: 10%\nMust have decision making capability, accountability, and ability to direct, execute, coach and support at an expert level around:\nCompliance and Governance\nContract Law\nMaster Franchising and Licensing\nDeveloping and Executing Business Action Plans\nRisk Management Analysis and Execution\nCommunication (Executive Influence, Stakeholder Management, Cultural Awareness)\nMust have functional use and knowledge of:\nMicrosoft Office Suite and Teams\n#LI-KM1", "url": "https://www.indeed.com/viewjob?jk=10dba2a4dc3ffd23&from=serp&vjs=3"},
{"job_title": "newMath Teacher (2022-2023 School Year)", "summary": "Compensation: Alliance provides a competitive salary for teachers.\nProfessional Development: At Alliance, we believe in supporting teacher growth and provide…", "company": "Alliance College Ready Public Schools", "location": "Los Angeles, CA 90029 (East Hollywood area)", "job_description": "TO APPLY PLEASE VISIT: https://www.laalliance.org/apps/pages/index.jsp?uREC_ID=2060881&type=d&pREC_ID=2263748ABOUT ALLIANCE COLLEGE-READY PUBLIC SCHOOLSAlliance College-Ready Public Schools was founded in 2004 based on the belief that all young people––regardless of ZIP code, income, ability, or background–– are capable of achieving at high levels. Alliance is one of the largest and most successful public charter school networks in the nation, operating 26 high-performing middle and high schools serving nearly 13,000 scholars in Los Angeles communities that have been systematically oppressed. Over the course of nearly two decades Alliance has a proven record of success: though 93% of incoming sixth graders come to Alliance reading below grade level, 95% of Alliance seniors graduate and are accepted to college. Now is the time to join our collaborative community to make long-lasting change across Los Angeles. Come teach at Alliance, where teachers achieve and scholars succeed.WHY TEACH AT ALLIANCE?Teaching math at Alliance College-Ready Public Schools is focused around the California Common Core standards. High quality curriculum is selected by its alignment to the expectations and rigor of the Common Core standards and the usability for teachers. The recommended curriculum for Middle Schools is Open Up Resources or College Preparatory Math (CPM), and for High School is College Preparatory Math. All curricula are intended for students to learn the concept behind the math to then apply and practice the concepts in different scenarios. This means that students unpack the conceptual understanding to implement into fluency practice. Support at Alliance includes regularly receiving feedback and coaching on intellectual preparation, classroom practices, and scholar work analysis. Teachers will also have school-based professional development as well as math meetings that further clarify expectations and serve to improve teaching practices. Alliance College Ready Public Schools have adapted this year to meet the changing needs of distance learning. While our school may fluctuate between an all virtual or hybrid model, teachers will be able to plan for a weekly lesson flow that meets the needs of both environments.THE STRONGEST CANDIDATES WILLBelieve. Hold the belief that all scholars, regardless of their economic or social demographics, deserve a quality education and can earn a four-year college degree.Social Justice. Desire to be a part of Alliance’s social justice mission, integrating anti-racist, student-centered instruction, and teaching in systemically underserved communities in Los Angeles.Culture. Demonstrate an ability to develop a positive, achievement-oriented, supportive, and collaborative culture of high expectations that motivates and inspires scholars to learn at college-preparatory levels.Expertise. Have strong academic content expertise, instructional and classroom management skills, and in-depth knowledge of effective evaluation and assessment techniques to drive scholar learning. Thrive in an environment of high expectations and collaboration.Mindset. Hold a growth mindset and commit to continuously honing their teaching craftRelationship-Building. Have strong interpersonal, communication, and relationship-building skills with both children and adults.QUALIFICATIONSApplicants for Math who will hold any of the following credentials by August 1, 2022, are welcome to apply:California Single or Multiple Subject Credential (Clear or Preliminary)If you hold a Multiple Subject Credential, you must have a Mathematics AuthorizationCalifornia University Internship Credential Eligible (Intern eligibility letter required)Proof of California Credential in Progress (University email can satisfy this requirement)Non-California Credential Transferring to California; please provide proof of transferring credential in progress (i.e. from other U.S. states)Prior to applying, please review the credential requirements listed on our webpage.Active California teacher certification in the assigned subject area(s) and a valid English Learner Authorization (e.g. CLAD) by August 1, 2022.Candidates that don't hold a single subject credential or have a pathway to obtaining a California teaching credential will not be eligible for a teaching position. If you are interested in becoming a teacher, Alliance has partnered with Claremont Graduate University to develop a teacher residency program leading to a teaching credential and Masters in Education. Please find information about the program here.BENEFITSCompensation: Alliance provides a competitive salary for teachers. Please click HERE for our starting teacher salary scale.Health Insurance: Medical, dental, and vision are covered at 100% of monthly premiums for individual employees and at least $1,000 per month towards family plan premiums.Retirement: Teachers may participate in the California State Teachers’ Retirement System (CalSTRS) with an expected Alliance match of 18.4% for certified employees for the 21-22 School Year.Paid Leave: Teachers have five weeks of paid leave during school breaks, plus sick leave that accrues at one day per month.Professional Development: At Alliance, we believe in supporting teacher growth and provide substantial school-based and network-wide professional development support for teachers, including two weeks of professional development for new hires that introduces the Alliance culture and builds classroom management and instructional planning skills.Leadership opportunities: Leadership opportunities are extensive at Alliance, both in and outside of the classroom. Our close-knit school communities look to teachers to support scholar extracurricular activities and lead school-level decision making. Teachers interested in growing their leadership skills while remaining in the classroom are invited to join our Teacher Leader Cadre program or join our Aspiring Principal Program.Recognition. Teacher of the Year awards Provide special recognition and compensation to teachers who demonstrate their dedication inside and beyond the classroom, as well as their exceptional ability to engage scholars and activate their excitement for education.To apply, visit www.laalliance.org/careers to submit a resume and application. Please note that only candidates who are selected for an interview will be contacted.** PLEASE NOTE: Alliance College-Ready Public Schools requires that all team members be fully vaccinated against COVID-19 for the safety of our students, family, and staff. Team members may apply to seek a medical exemption. Regardless of your current vaccination status, our team can advise you on how to fulfill this important requirement so that you can start the position in a timely way. **Research shows that while men apply to jobs when they meet an average of 60% of the requirements, women and other underrepresented people tend to only apply when they match every criteria. If you think you meet some of the qualifications, but don't necessarily check every box in the job description, we encourage you to still apply. Alliance College-Ready Public Schools are tuition-free public charter schools that do not discriminate against any scholar, parent, community member, or staff member on the basis of actual or perceived ancestry, age, color, disability, gender, gender identity, gender expression, nationality, race or ethnicity, religion, sex, sexual orientation, or association with a person or group with one or more of these actual or perceived characteristics.Job Type: Full-timePay: $61,200.00 - $90,000.00 per yearBenefits:401(k)Dental insuranceHealth insurancePaid time offSchedule:8 hour shiftMonday to FridayEducation:Bachelor's (Preferred)Work Location: One location", "url": "https://www.indeed.com/viewjob?cmp=Alliance-College--Ready-Public-Schools&t=Math+Teacher&jk=4ca04b204559ecb4&vjs=3"}