[
{"job_title": "newMover/Packer/Driver", "summary": "Must have a good attitude during arduous physical labor.\nPerform manual labor 6-10 hours a day in extreme weather (heat/cold).\nMust be over 18 years of age.", "company": "Swan Moving Services", "location": "Terrell, TX+2 locations", "job_description": "********************$1000 SIGNING BONUS*******************The SWAN Moving Services working environment requires endurance, perseverance and a MOST IMPORTANTLY a good attitude. We serve our customers with kindness, respect and integrity.The following are requirements for becoming a crew member:1. Must be able to lift and carry at least 50 pounds on your own2. Perform manual labor 6-10 hours a day in extreme weather (heat/cold)3. Must have a good attitude during arduous physical labor4. Must be over 18 years of age5. Pass a background and drug test (Initially and periodically)6. Must have worked less than 3 jobs in last 2 years.7. Experience pulling a trailer is a HUGE bonus (bumper pull or goose neck).8. No prior felony or misdemeanor convictions.Benefits of working with the SWAN crew:1. Work with an Outstanding Team2. Flexible schedule3. Growth potential4. Get paid to work out5. Customer tips for outstanding serviceSWAN Moving Services, LLC provides a top-notch moving experience from start to finish by providing outstanding customer service and taking meticulous care of customer furniture and belongings.Job Type: Full-timePay: From $750.00 per weekJob Type: Full-timePay: From $750.00 per weekBenefits:Flexible schedulePaid time offSchedule:8 hour shiftWeekend availabilitySupplemental Pay:Signing bonusTipsEducation:High school or equivalent (Preferred)Work Location: Multiple Locations", "url": "https://www.indeed.com/viewjob?cmp=Swan-Moving-Services&t=Mover+Packer+Driver&jk=1121a210b1b53efe&vjs=3"},
{"job_title": "TS/SCI Security Escort", "summary": "Remain alert and awake at all times to provide appropriate security monitoring of escorted individuals.\nProvide verbal and written reports regarding pertinent…", "company": "Falken Industries LLC", "location": "Manassas, VA 20109+1 location", "job_description": "Falken Industries is a security provider for the United States government and their clients, focusing on DHS,DOD, and IC objectives.\nFalken pays every week through direct deposit and promotes from within.\nMust have an active TS/SCI with ability to upgrade.\n$42-$48/hr (1.5x rate for OT)\n\nThis is a temporary position (Transfer to different site possible upon completion of contract). Contract begins Nov 29 and ends in late January 2022.\n7AM ? 5PM workday (with a 30-45 minute lunch)\nFederal holidays off\n\nDuties:\nMonitor and escort uncleared persons at the facility\nProvide verbal and written reports regarding pertinent safety, security, facility, or personnel issues/incidents\nMaintain visual contact and proper line of sight with uncleared personnel at all times.\nRespond professionally and courteously to all personnel\nRemain alert and awake at all times to provide appropriate security monitoring of escorted individuals.\nWalk/Stand for up to 8 Hours\nWear appropriate work attire (Company provided)\nPerform all other position related duties as assigned or requested.", "url": "https://www.indeed.com/viewjob?jk=08ae1e937aef5d63&from=serp&vjs=3"},
{"job_title": "newAircraft Cleaner", "summary": "Exceed PrimeFlight customer service and safety standards.\nReasonable accommodations may be made to enable individuals with disabilities to perform the essential…", "company": "PrimeFlight Aviation Services Inc", "location": "Tampa, FL 33607+43 locations", "job_description": "$200 Referral Bonus after 60 days!$500 Sign On Bonus after 60 days!Essential Functions: As a valued member of the PrimeFlight team an Aircraft Cleaner will join the airport team to do the following:Direct lift truck movement and positioning in the AirportRemove all trash from aircraftClean and restock all lavatoriesClean galleyClean all seats, seat back pockets, tray tables and replace soiled magazinesFold blankets and store blankets and pillows in overhead compartmentsClean aircraft floorDemonstrate regular, predictable attendance at job locationExceed PrimeFlight customer service and safety standardsCarry out other duties as assigned*Competency: *To perform the job successfully, an individual should demonstrate the following competencies: Problem Solving, Customer Service, Interpersonal, Oral Communication.*Qualifications: *To perform this job successfully, an individual must be able to perform each essential function satisfactorily. The requirements listed in this Job Description are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.*General Qualifications: *18 years of ageReliable transportationEligible to work in the United States*Education/Experience: *N/A*Language Ability: *Ability to read and interpret documents such as safety rules, operating and maintenance instructions, and procedure manuals. Ability to communicate effectively in English.*Reasoning Ability: *Ability to apply common sense understanding to carry out instructions furnished in written, oral, or diagram form. Efficient, immediate problem-solving capabilities.*Computer Skills: *No skills needed.*Certificates and Licenses: *No Certificates or Licenses required.*Supervisory Responsibilities: *No supervisory responsibilities associated with this position.*Work Environment: *The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.The noise level in the work environment is usually moderate but may become high at various times. Employee must be willing to wear/utilize company-supplied personal protective equipment (hearing protection) to mitigate their noise exposure.Some work is in an outside environment, with exposure to hot and cold temperatures and inclement weather.Physical Demands: The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.Walk and climb up and down a minimum of 500 stairs dailyWalk, stretch, and bendLift and carry up to 50 poundsBe able to work in tight spacesReach above head, full extension (72 inches) with armsUse hands to finger, handle, or feelBe able to hear and respond to the spoken voice and to audible alarms generated by terminal environmentSpecific vision abilities required for this job include: Close vision (clear vision at 20 inches or less); distance vision (clear vision at 20 feet or more); color vision (ability to identify and distinguish colors); peripheral vision (ability to observe an area that can be seen up and down or to the left and right while eyes are fixed on a given point); depth perception (three-dimensional vision, ability to judge distances and spatial relationships); ability to adjust focus (ability to adjust the eye to bring an object into sharp focus)Shift: Day (Early mornings) and (Midday) ShiftPay: $11/hr.#PF_NOWJob Type: Full-timePay: $11.00 per hour", "url": "https://www.indeed.com/viewjob?jk=86f5331e2d38522f&q=Cleaner&l=USA&from=web&advn=1126635682454199&adid=382524549&ad=-6NYlbfkN0CMPFH6W8i_9piDVKePwwLsfmbG0kzaRnSxhYNUDdwBka6rrz0jJD3vFfLgkviWSGm-gKkCiFftgYnCe9aez7ZrsyXGbZalluWH3sNnORWp-aEN4YOCMUWuEZh02c6S1qvoD1ak2EG1U1G3srUybzF-RV2_GX_5A9vY1QkVqUku7dyXfr3Js24-QNO8aeXUQGHsG9H0UutW6nTHKV5HA6se5H4SAqb2T3z7WbJV3mfJv1nv03ofeBFdgBKaIt0wWzBtY2BJF-rMLdPMSOB8TcUtkJJc36ej40rD5-mraaZxAhj4M9DZuliXvG6IbLqiDIYO1ZjbsdnoJm9QPtRWC1rpSN1-x1-O7YLj5G2gWVgsTfl2nmCvWlJ4&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "new✨ Full Time Maid/House Cleaner: Weekly Pay (Lexington)", "summary": "Work for a company where others have chosen to stay for a long time.\nAnd with people like that, we provide excellent, dependable, recurring house cleaning…", "company": "Top Mops Cleaning Service", "location": "Lexington, KY", "job_description": "If you are from the Home Health Aide, Hotel Housekeeping, or Childcare/Daycare industries, you will find us A Very Warm and Welcome Change!We are so glad you are considering Top Mops Cleaning Service for employment. We are growing and adapting along the way, in order to be a place where our team members can rise, day after day, year after year. This could be a great opportunity for you. Read on to see if you are a good fit.My family started the business in 2012 to simply start a business. Why not house cleaning? I realized within a month that our promise of great customer service could only happen by finding people who loved the mission and had similar values as our company. As we found those people--caring, kind, consistent, truthful, and flexible--the company grew. And with people like that, we provide excellent, dependable, recurring house cleaning services every day. Our team is why Top Mops effectively serves Lexington-area customers.OUR COMMITMENT: Choosing only the best people—caring, honest, consistent, teachable, flexibleTraining and developing our team to be people of excellence in life. Helping them rise is our mission!Professionalism—providing competent, reliable and respectful cleaning servicesOUR MISSION: To help our staff rise and to help our customers rest!OUR VALUES: Act Consistently. It leads to reliability, predictability, and ultimately customer loyalty.Go after Truth. It has two sides—telling the truth and listening to the truth.Respond Kindly. We treat our customers, our employees and our community with kindness and respect.Flex with Change. Receive the unexpected with grace. Flex your response. Adapt to change.Here are a few reasons you'll love working with us: Work for a company whose primary mission is to help you riseWork for a company who cares about youWork for a company with excellent moralsReceive a living wage (can earn up to $750 - $850 weekly) by direct depositGet paid for trainingNo nights, no weekendsExperience rewarding relationships with customers and fellow employeesLots of physical activity as you work (no one makes you sit at a desk).Daily experience time between jobs to step outside and get fresh air, regroup, and drive to a new locationWork for a company where others have chosen to stay for a long timeLearn strategies to increase opportunities for tipsWe are partners of Cleaning for a Reason. Top Mops is a proud member Cleaning for a Reason, America’s only foundation dedicated to cleaning homes for people fighting cancer. In 2012, Top Mops was the first central KY maid service to become a Cleaning For A Reason partner. Top Mops has provided over $30K of house cleaning free of charge to people battling cancer in the Lexington area.Top Mops has been recognized as a local Reader's Choice finalist as a one of the best cleaning companies in Lexington.We're looking for great people who are Kind, Consistent, Truthful and able to Flex with change! Come join our friendly team of house cleaning pro's! We look forward to meeting you!Details about the job: Monday - Friday 8 - 5Service Area: Lexington, north Nicholasville, east VersaillesMust be comfortable working independentlyFull Time positions ONLYHard work and motivation are a mustHouse cleaning can be tiring so serious applicants must be able to consistently lift 20 lbs, bend, kneel, and twist while performing the necessary cleaning duties throughout the day.Pay: $750-$850 once full-time (typically within 6 weeks but it is dependent on you and how quickly you implement our training, and your consistent availability)Must Have: Driver's licenseJob Type: Full-timePay: Up to $850.00 per weekSchedule:Day shiftWork Location: Multiple Locations", "url": "https://www.indeed.com/viewjob?cmp=Top-Mops-Cleaning-Service&t=Maid+House+Cleaner&jk=e4b3eb4b534174af&vjs=3"},
{"job_title": "Caregiver Hiring Immediately- No Experience Needed", "summary": "Establish and maintain effective and professional communication and a strong relationship with clients, family members, and co-workers.", "company": "Honor", "location": "Monterey, CA+2 locations", "job_description": "Earn up to $830 / week plus a $300 Signing Bonus!Looking to work for a home care company that values passion and rewards its caregivers with flexible scheduling, amazing benefits, consistent hours, and 24/7 support? Join Honor as a Caregiver, we are hiring immediately!Join a growing home care agency where you're valued and your work makes an impact on people’s lives—including your own. We are currently looking for compassionate and dependable caregivers who are ready to begin working in Salinas, Monterey, and surrounding areas.As a Caregiver, we highly encourage you to foster genuine relationships with the seniors in your community. We’re relying on you to do your best to keep every senior client healthy, safe, happy and independent at home. If you’re ready to join us in making a difference in older adults’ lives, we’d love for you to apply!Caregiver Benefits: $200 Signing Bonus after working 20 hours in your first 14 days, plus an additional $100 Signing Bonus if HCA-RegisteredPaid Training to begin or grow a career in caregivingMedical/Dental/Vision Benefits & 401k Matching, based on eligibility9 Holidays Paid at the rate of 1.5xWeekly PayDirect DepositPaid OvertimeCaregiver Referral ProgramCell Phone Reimbursement24/7 SupportCaregiver Responsibilities: Establish and maintain effective and professional communication and a strong relationship with clients, family members, and co-workersProvide personalized in-home support to senior clientsHelp client with all personal care needsHelp keep the client's environment clean and organizedRemind client to take self-administered medicationsSuccessful applicants will meet the following requirements: Effective November 30, 2021, due to a state mandate all Care Pros will be required to be fully-vaccinated against COVID-19 in order to provide care to clients in CaliforniaMust be 21 years or olderWe respect our caregivers and treat them like true professionals. You care for others, let Honor care for you! Join our team as a Caregiver. Apply today!*Top caregivers have full schedules with overtime opportunities. The more hours you work the greater your weekly earnings.Job Types: Full-time, Part-timePay: $16.00 - $16.75 per hourBenefits:401(k) matchingDental insuranceEmployee assistance programFlexible scheduleHealth insuranceReferral programVision insuranceSchedule:10 hour shift12 hour shift8 hour shiftDay shiftHolidaysMonday to FridayNight shiftOvertimeWeekend availabilitySupplemental Pay:Bonus paySigning bonusCOVID-19 considerations:We’re ensuring that all Care Pros have supplies such as thermometers, and we are paying for flu shots if they need one. We’ve also rolled out a program to provide masks for Care Pros to wear at every shift.Work Location: Multiple Locations", "url": "https://www.indeed.com/viewjob?jk=e27d2f7f9e712793&q=Worker&l=USA&from=web&advn=9410817544348995&adid=382723354&ad=-6NYlbfkN0CnvVM1S6R2UOPuGGr58ZWmcFZDnsq3aLjqSdiGhdgGJqJPet_FFZhX7rOykG1-isyWvBd4RxAPuvzLOfSSp2njbHeZigo6yj83mncb_ldS_y7jRUcyDykGlQwzyjrR46eRWnEQQfPPqAGOcNu_WNQK0e9SrcdTFUdJiO-qA0fM-kFCXHHNck_Nn9mPDJdLH4toLNL5W4fXI6TCjEc5_oCmuDL1l0CZXvrUHbGp8zbIYFIu08Ly7k110swWHekh6Twshccil7UmMlhye_1ZpkYcYQFyHXErw6hDuB6ZTsXO4bUfK0u48OTrYRGUUfJsxmPDOfVZP9lu57b4m3gm5oZQHi4GEkXD1gSuLqNs2AmYautpxmOEkmI5&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "Greeter/Host/Hostess", "summary": "Houston's Restaurant in Irvine*, is currently seeking Maître d’ / Greeter candidates to join our successful team.\nWe look forward to meeting you soon!", "company": "Houston's Restaurant", "location": "Irvine, CA 92612 (San Joaquin Marsh area)+3 locations", "job_description": "Houston's Restaurant in Irvine, is currently seeking Maître d’ / Greeter candidates to join our successful team.Energy, poise, and an elevated sense of personal style are important.Upscale restaurant experience can be a plus, but these roles are open to candidates from all backgrounds.Compensation commensurate with experience ($38-$40/hour)Medical/dental benefits are available after an introductory period.Part-time and full-time positions available. Some weekend availability is required.To learn more, visit us at www.hillstone.com, or read this profile in Bon Appetit magazine: http://www.hillstone.com/press/bonappetitWe look forward to meeting you soon!Job Types: Full-time, Part-timePay: $38.00 - $40.00 per hourBenefits:Dental insuranceEmployee discountHealth insuranceSchedule:Day shiftMonday to FridayNight shiftWeekend availabilitySupplemental Pay:TipsExperience:Restaurant Experience: 1 year (Preferred)Work Location:One locationWork Remotely:NoWork Location: One location", "url": "https://www.indeed.com/viewjob?jk=ef8d194b8056c915&q=Food&l=USA&from=web&advn=8937939063231664&adid=374559416&ad=-6NYlbfkN0Dag-ruDzQiO6xfc8MhbXPWdPRu4c57jH9p22WyH1KcnRihu4vsv5Z3cz8goJVTK75WiuLo-Tf97RSpfSmCh5mCs1q4ArK6MwS8pEqHUnNHNxCnibTkUmn2NLgAB6_g2A8_RJSdHtVIH7cnmwafKH0QZKFMCTgGQR73Wmgck7rfItXlBzhHGM9AO6PFmoCo6UROTKDdqCD6yvOP91086efCEa8-QnBfI06c4tiD_tqpNrEPrwdh_CWWYZCnPsBt2kHVUYN34naCUaV4ejymhOtBzG0gKvfzfc_ue7TCEGDjlAD5tkthO6KtSjrvh-92vkIErNjzH1b9xhheOaFHZW5Nwnm5PqekuZPxiYpd8FCDd3SJ6e52bczIh0Eu0Ahv4ys%3D&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "Part-Time IT?Admin", "summary": "Work with users of all skill levels to solve problems and educate them by explaining complex computer issues in simple terms.", "company": "eCatalyst Healthcare Solutions", "location": "Remote in Phoenix, AZ", "job_description": "Part-Time IT Admin\nLocation: Phoenix, AZ (or remote)\nStatus: Part-Time, non-exept\nEssential Functions:\nServe as M365 Global Admin including the following functions:\nManagement of M365 internal, shared, and guest accounts, Groups, Teams provisioning, and SharePoint\nOffice 365 user management, Windows patching, anti-virus setup and management\nFacilitate termination processes with blocked accounts and account retention and review\nUpdate and maintain corporate signature template through M365 or external automation service\nCreate, update, and maintain M365 supporting documentation\nMonitor, resolve, and prevent service disruptions including due to upgrades and changes\nRecommend and implement usage of available services (Flow, Sensitivity Labels, Forms, and other apps and features)\nSubmit tickets to Microsoft for individual and company issues\nMonitor security alerts including those for spam/phishing\nPrepare and execute organization-wide plan for unexpected service downtime\nMaintain IT Security\nEncryption management (disk encryption, email encryption, etc.)\nZix encryption account and service administration\nThreat management\nMaintain and update IT HIPAA policy and ensure user awareness and compliance to policies\nAudit security policy acceptance documentation from all users\nMaintain log of security incidents and breaches\nAudit user accounts\nStay up-to-date, recommend, and enforce best security practices (passwords, encryption, user logs, MFA, etc.)\nMonitor M365 Security Dashboards\nRegular communication with staff regarding Security updates, best practices, education\nComplete hospital IT security assessments\nAssist in the assessment, acquisition, implementation, administration, and maintenance of new software, programs, IT resources, etc.\nProvide day-to-day technical support to all staff\nParticipate in planning of technical development and execution\nCollaborate as a team-player with peers on delivery, problem solving, and knowledge-sharing\nProject management resources will also be assigned to assist in resource coordination across the different technical areas\nPerform other duties as assigned by the Director of Strategy or Business Manager\n\nAdditional Specific Duties and Responsibilities:\nStay abreast of latest network and cloud technologies within and around technical specializations\nWork with users of all skill levels to solve problems and educate them by explaining complex computer issues in simple terms.", "url": "https://www.indeed.com/viewjob?jk=521e88882869e407&from=serp&vjs=3"},
{"job_title": "newCleaner - Fort Lauderdale-Hollywood International Airport", "summary": "Restroom cleaning: Using a germicide, clean and sanitize toilets and urinals, spot clean walls and partitions, and clean and rinse sinks and counters.", "company": "Sunshine Cleaning Systems", "location": "Fort Lauderdale, FL+22 locations", "job_description": "Overview\nSunshine Cleaning Systems, Inc. has been providing superior cleaning services to business, government agencies, international airports, hospitals, sports arenas, convention centers, colleges and universities and residential customers since 1976.\n\n\nFor over 45 years Sunshine has been guaranteeing customers a brighter day. Our success is primarily due to the outstanding work of our dedicated and talented team members. We commit a large percentage of our resources to employee development. Sunshine offers industry leading training and safety programs, a mentoring and career enhancement program, recognition and reward initiatives, advancement opportunities, a stable work environment, and shared values designed to deliver excellence.\n\n\nIf you believe you have what it takes to join our team, let us help you build a professional career you can be proud of.\nJob Skills / Requirements\nResponsibilities\nPerform routine cleaning such as but not limited to vacuuming, spot cleaning walls, furniture, and fixtures, drapes, blinds, and interior glass.\nRestroom cleaning: Using a germicide, clean and sanitize toilets and urinals, spot clean walls and partitions, and clean and rinse sinks and counters. Using a standard glass cleaner, clean mirrors, glass, and stainless steel. Also, responsible for dusting, sweeping, emptying trash, restocking supplies, and mopping floors.\nArea cleaning: responsible for vacuuming large carpeted areas, dusting and mopping floors, and cleaning entrance mats.\nOther duties, as required.\nQualifications\nNo experience required, but beneficial\nLift 25 pounds\nPerform tasks that require physical movement, bending, and reaching\nPass pre-employment drug screen\nPass fingerprinting and criminal background check\nAdditional Information / Benefits\nEvery employee is important to us. We are committed to attracting and retaining quality employees like you. To accomplish this, we are committed to maintaining a competitive wage and benefit program. We want to make our workplace as pleasant and rewarding a place for you to work as we can.\n\n\nSunshine Cleaning Systems, Inc. offers a comprehensive benefit package to all full time employees.\n\n\nBenefits for FT positions: Medical Insurance, Dental Insurance, Vision Insurance, Short Term Disability, Long Term Disability, Hospital and Accident Insurance, Paid Vacation, Paid Holidays\nBenefits: Medical Insurance, Life Insurance, Dental Insurance, Vision Insurance, Paid Vacation, Paid Sick Days, Paid Holidays, Short Term Disability, Long Term Disability\nThis job reports to the Supervisor\nThis is a Full-Time position 1st Shift, 2nd Shift, 3rd Shift, Weekends.", "url": "https://www.indeed.com/viewjob?jk=f6a079a540c66c5c&from=serp&vjs=3"},
{"job_title": "Commercial Cleaner - (Up To $960/wk)", "summary": "Clean kitchens, bathrooms, dishes, bedding, refill soaps, wash laundry, baseboards, cobwebs, floors, etc.\nSHIFT: Day time, Afternoon Typically 4-8 pm.", "company": "Gleam N clean LLC", "location": "Township of Brick, NJ", "job_description": "WELCOME! We are so excited to be welcoming more team members in. We are a residential cleaning company and growing fast! Cleaning is in demand and our team needs your help!We are looking for: POSITION: Cleaner TechnicianPAY: $16 - $24/hrLOCATION: Brick , NJSHIFT: Day time, Afternoon Typically 4-8 pmHOURS: Part TimeIf you are ready to work somewhere you love: Ready to make a difference in people's lives.Get rewarded for your hard work! (Up to $960 / Week)Enjoy a flexible work-life balance.Enjoy working with happy customers in Jersey, and accepting tips!Love having a consistent schedule that you can rely onBonuses For Referring Workers or CustomersPaid Birthday OffHolidays Off ( OT if You Work )There's a reason our cleaners LOVE staying with us for years and we would love to show you why!Duties: Clean homes, air BnB rentals, cabins, resorts.Clean kitchens, bathrooms, dishes, bedding, refill soaps, wash laundry, baseboards, cobwebs, floors, etc.Work with a partner cleaning jobs for each day.Clean & organize team supplies before and after shift neatly.Work smart and efficiently with your partner to get the houses done for the day.Requirements: Paid Cleaning Experience especially in Brick New jerseyReliable TransportationSmart PhoneEnjoy working with a 5 Star Cleaning Service and Join the Team Today!Job Type: Part-timePay: $640.00 - $960.00 per weekSchedule:8 hour shiftMonday to FridayWork Location: Multiple Locations", "url": "https://www.indeed.com/viewjob?cmp=Gleam-N-clean-LLC&t=Commercial+Cleaner&jk=74eda9bb2c175d30&vjs=3"},
{"job_title": "newDirector of Food and Beverage", "summary": "Keeps high standards of food and beverage quality, service and marketing to maximize profits and insure outstanding customer service.", "company": "The Georgian Terrace Hotel", "location": "Atlanta, GA 30308 (Midtown area)", "job_description": "The Director of Food and Beverage is responsible for overseeing the entire operation of restaurants, bars, banquets and culinary at the property. The goal is maximizing food and beverage revenue; selecting, training and developing team members; establishing and maintaining quality product and service levels while maximizing profits; forecasting and budgeting. Ensures compliance with health, safety, sanitation and alcohol awareness standards and liquor laws. Keeps high standards of food and beverage quality, service and marketing to maximize profits and insure outstanding customer service.QUALIFICATIONS:High school diploma or equivalent - college degree preferred5+ years of experience in food and beverage management in hotels/resorts preferredAbility to interpret financial and operational data into operational planAbility to lead and direct a teamAbility to communicate effectively with the public and other Team MembersAbility to work extended hours when business necessitatesExcellent written and oral communication skillsExcellent computer skills (including POS software and Microsoft Office products)Excellent organizational, time management, negotiation and follow through skillsAbility to handle multiple ongoing projects in fast-paced team environmentAbility to work independently on projects and also collaborate as a strong team memberExcellent attention to detail, flexible and adaptable to changeAbility to operate under pressure and meet or exceed deadlinesPositive, outgoing and self-motivating individual with pleasant personalityAbility to maintain a professional manner and appearance in all situationsJob Type: Full-timePay: $90,000.00 - $110,000.00 per yearBenefits:401(k)401(k) matchingCommuter assistanceDental insuranceEmployee discountFlexible scheduleFlexible spending accountHealth insuranceLife insurancePaid time offRetirement planVision insuranceSchedule:10 hour shift12 hour shift8 hour shiftDay shiftEvening shiftEvery weekendHolidaysMonday to FridayNight shiftWeekend availabilitySupplemental Pay:Bonus payExperience:Director level: 5 years (Required)Food and Beverage: 1 year (Preferred)Work Location: One location", "url": "https://www.indeed.com/viewjob?cmp=The-Georgian-Terrace-Hotel&t=Director+Food+Beverage&jk=59a5c4faf74d35cf&vjs=3"},
{"job_title": "newFood Service Worker", "summary": "This job class performs entry level, routine and manual functions of food preparation.\nMust possess the skill to effectively apply proper sanitation and safety…", "company": "Kern High School District", "location": "Bakersfield, CA", "job_description": "JobID: 10582\n\nPosition Type:\n Food Service/Food Service Worker\n\nDate Posted:\n 2/2/2022\n\nLocation:\n Golden Valley High School\n\nDate Available:\n 02/02/2022\n\nClosing Date:\n\n 02/10/2022\n\nQUALIFICATIONS: This position requires knowledge of basic kitchen and food serving utensils and equipment; basic methods of food preparation; basic cleaning methods and procedures.\n\nMust possess the skill to effectively apply proper sanitation and safety requirements associated with food preparation and serving operations; understand and follow oral and written instructions; learn to operate assigned food service appliances and equipment in a safe manner; read at a level sufficient to perform assigned duties; perform routine mathematical calculations accurately; meet the physical requirements necessary to safely perform the duties of the position; establish and maintain effective work relationships with those contacted in the performance of required duties.\n\nNo experience is required, although some experience in food preparation and service would be helpful.\n\nA TEST ON GENERAL KNOWLEDGE OF MEAL PATTERN REQUIREMENTS FOR THE NATIONAL SCHOOL LUNCH PROGRAM WILL BE GIVEN PRIOR TO THE INTERVIEW AS WELL AS A BASIC MATH TEST.\n\n\nA PRE-PLACEMENT MEDICAL ASSESSMENT AND CRIMINAL HISTORY CHECK IS REQUIRED OF THE SUCCESSFUL CANDIDATE PRIOR TO EMPLOYMENT.\n\nDUTIES OF POSITION: Under supervision will assist in the preparation and serving of food items in a school cafeteria or central kitchen facility and maintain food service equipment and facilities in a safe, clean, and sanitary condition. This job class performs entry level, routine and manual functions of food preparation.\n\nSTARTING SALARY: $785.93 (monthly)\n\nNUMBER OF MONTHS: 9.5 (to begin as soon as possible)\n\n\nNUMBER OF HOURS: 3 (daily working hours 10:00 a.m. to 1:00 p.m.)", "url": "https://www.indeed.com/viewjob?jk=78216aeffabcc485&from=serp&vjs=3"},
{"job_title": "newSafety & Security Specialist", "summary": "Support the safety and security team by identifying ways to streamline processes and optimize outcomes.\nOccasional travel will be required to our other regions,…", "company": "Etsy", "location": "Remote in Brooklyn, NY", "job_description": "Company Description\n\nEtsy is the global marketplace for unique and creative goods. We build, power, and evolve the tools and technologies that connect entrepreneurs with buyers around the world. Etsy, Inc.'s 'house of brands' portfolio has expanded to now include four individually distinct ecommerce brands - Etsy, fashion resale marketplace Depop, musical instrument marketplace Reverb, and Brazil-based handmade goods marketplace Elo7. As an Etsy employee, you'll tackle unique problems alongside talented coworkers committed to Keeping Commerce Human. We're large enough that you'll focus on meaningful, complex challenges, but small enough that you can make a rewarding impact.\n\nJob Description\nAs the Safety & Security Specialist you will research regulations, developments, and support recommendations regarding the implementation of our health and safety protocols and policies, protecting Etsy Inc.’s employees worldwide from wherever they work. Do you have demonstrated experience researching and implementing health and safety programs and ensuring compliance with regulations globally? If so, this could be the perfect match.\nThis is a full-time position reporting to the Senior Manager, Safety & Security. We are considering remote candidates based in the USA for this position. Etsy offers three different work modes to meet the variety of needs and preferences of our team: Flex mode for candidates who are comfortable traveling to an office location at least 4-6 days per month, Remote mode, and Office-based mode. Learn more about our flexible work modes and vaccination policy here.\nOccasional travel will be required to our other regions, including internationally.\nAbout the Role\nIn this role you will:\nResearch health and safety regulations specific to each of our office locations globally.\nMaintain and adapt current health and safety programs.\nCollaborate closely with the Workplace teams on required health and safety updates and mandates.\nAssist in developing and implementing fire safety programs and evacuation drills.\nAssist in developing and implementing a workplace safety program / manual and ensure compliance with OSHA (or international equivalent) requirements.\nSupport the safety and security team by identifying ways to streamline processes and optimize outcomes.\nUpdate intranet pages as needed to reflect policy changes.\nBuild positive relationships with business partners and SMEs across various functions (e.g., operations, finance, legal, compliance etc.).\nEnsure compliance with COVID-19 mandates and guidelines in each city, state, and country where Etsy has an office. Collaborate closely with other teams on these requirements, including HR and Legal.\nOf course, this is just a sample of the kinds of work this role will require! You should assume that your role will encompass other tasks, too, and that your job duties and responsibilities may change from time to time at Etsy's discretion, or otherwise applicable with local law.\n\nQualifications\nAbout You\nIdeally you’ll bring:\n2+ years of health and safety experience in a government or corporate environment\nExperience in research and ensuring compliance\nFamiliarity with OSHA or international equivalent\nFamiliarity with analyzing and tracking data, to include COVID-19 metrics\nInternational experience preferred, but not required\nCommunication and presentation skills\nAbility to occasionally travel\nA trust in and commitment to Etsy’s vision, mission, and values\nAdditional Information\n\nWhat's Next\n\nIf you're interested in joining the team at Etsy, please send a coverletter and resume telling us why you'd be right for the position. As you'vehopefully seen already, Etsy is a place that values individuality andvariety. We don't want you to be like everyone else - we want you to belike you! So write to us and tell us what you're all about.\n\nOur Promise\n\nAt Etsy, we believe that a diverse, equitable and inclusive workplace makesus a more relevant, more competitive, and more resilient company. Weencourage people from all backgrounds, ages, abilities, and experiences toapply. Etsy is an equal opportunity employer. We do not discriminate on thebasis of race, color, ancestry, religion, national origin, sexualorientation, age, citizenship, marital or family status, disability,gender, gender identity or expression, pregnancy or caregiver status,veteran status, or any other legally protected status. We will ensure thatindividuals with disabilities are provided reasonable accommodations toparticipate in the job application and interview process, to performessential job functions, and to receive other benefits and privileges ofemployment. While Etsy supports visa sponsorship, sponsorship opportunitiesmay be limited to certain roles and skillsets.\n\nFor U.S. roles only:\n\nMany Etsy roles are open to remote candidates, and you'll be able to identify which ones within the location header of each job description. We're open to remote hires from all U.S. states except Hawaii and Alaska. For candidates who will work remotely from Colorado, visit this link for information related to Colorado's Equal Pay for Equal Work Act.", "url": "https://www.indeed.com/viewjob?jk=9b864b9435efae19&from=serp&vjs=3"},
{"job_title": "new$17/hr.+ Ice Cream Scooper", "summary": "Quick service & fast food restaurant.\nNo Experience Required but a huge plus if you have some.\nHigh school or equivalent (Preferred).", "company": "GQue Championship BBQ (Lakewood)", "location": "Lakewood, CO 80226 (Belmar area)", "job_description": "Grand Opening for this location! Come work with us at The Ice Cream Farm in Lakewood @ Belmar.We are a newer ice cream concept shop that opened up our 1st location a little over 3 years ago in the Park Meadows Mall area called The Ice Cream Farm. We are opening up our 2nd location in Lakewood. We serve ice cream made in house using ingredients sourced from local dairies. This is a high volume and high energy environment so we need nothing but the best employees to help us create the best experience for our guests.Wanted: Full-time and Part-time employees with a big smile and a positive attitude. Your primary responsibilities will be scooping ice cream and giving our guests a memorable experience.This will be our second shop of many more to come. This is a great opportunity to get into our company now as we continue to grow, there will be a ton of opportunities for advancement.We currently own and operate a BBQ restaurant in next door to the Ice Cream Farm (GQue Championship BBQ) so there are always additional opportunities for those interested in working with us there as well.No Experience Required but a huge plus if you have some.Job Type: Part-timePay: $17.00 - $20.00 per hourBenefits:Employee discountFlexible scheduleHealth insurancePhysical Setting:Quick service & fast food restaurantSchedule:8 hour shiftWeekend availabilityEducation:High school or equivalent (Preferred)Experience:Restaurant experience: 1 year (Preferred)Shift availability:Day Shift (Preferred)Night Shift (Preferred)Work Location: One location", "url": "https://www.indeed.com/viewjob?cmp=GQue-Championship-BBQ-(Lakewood)&t=Ice+Cream+Scooper&jk=0c2d18bf0d316d04&vjs=3"},
{"job_title": "newSecurity/Safety Support Personnel", "summary": "The Security/Safety Support Personnel is a highly visible position responsible for performing routine security functions at the school to monitor student and…", "company": "Randolph Public School District", "location": "Randolph, MA 02368", "job_description": "The Security/Safety Support Personnel is a highly visible position responsible for performing routine security functions at the school to monitor student and faculty in the building.Maintain the safety of students and faculty by being knowledgeable and able to follow all Emergency policies and procedures at Randolph High SchoolMonitor hallways throughout the school day; checking bathrooms as well as all doors in the building.Requires the ability to use good judgment to enforce security and safety rulesAble to follow procedures and oral instructions.Check students for passes as they pass through hallways.Be in constant communication with the Director of Security, Principal, as well as other faculty and staff involving safety issues.Meet with Director of Security/Administration team/Randolph Police Department biweekly.Meet with Director of Security daily to give updates on progress of school safety.Able to communicate with parents/guardians about safety issues at RHS.Meet with the Principal regularly for sorting of data dealing with behavioral issues.Must be able to complete an security incident report when required.Attend extracurricular activities/athletic events, as neededMust be able to participate in ongoing training provided by the schools such as CPR, or de-escalation programs in safety or crisis intervention.Terms: Consistent with Randolph Education Association Support Professionals Unit collective bargaining agreementFlexible Hours needed: Monday-Friday during the student school yearSalary consistent with Support professionals salary schedule based on degree level, experience, and certifications", "url": "https://www.indeed.com/viewjob?jk=51619a0627c5a662&from=serp&vjs=3"},
{"job_title": "new✨ Full Time Maid (Paid Weekly) near McKinney", "summary": "After some time, we found it difficult to juggle family time with the difficult hours and went into the education world for three years before launching The…", "company": "The Cleaning Force", "location": "Plano, TX+1 location", "job_description": "*448 reviews with a 4.7 overall rating! Come join our fabulous team and help us get to 600 reviews* Updated 10/13/21NO EXPERIENCE NEEDED! WE TRAIN ALL ALL CLEANING TECHNICIANS!*The Cleaning Force:  We are a company built on a foundation of trust and great service. We are a family owned company that offers trustworthiness, honesty, integrity, a “blue collar” mentality. Sarah started her career as a Dallas Police Officer nearly seven years before having children and was drawn into this profession through watching her father serve as a State Trooper during her childhood. Law enforcement is her passion and she finds serving others very rewarding and natural. After some time, we found it difficult to juggle family time with the difficult hours and went into the education world for three years before launching The Cleaning Force.The Cleaning Force is an Award Winning Cleaning Service located in Frisco, Texas that serves Collin County. We looking for energetic individuals who want to make top pay for their excellent work. We are looking for awesome people who love cleaning, dependable, friendly and have an eye for detail! We service homes and offices in the McKinney, Frisco, Plano, Allen, and surrounding areas. This is a full time position, Monday through Friday 8:00am-5:00pm. No evenings and no weekends!House cleaning is the perfect job for someone who likes to clean, enjoys working in a team, likes to make customers happy through their work. We have a great company culture where everyone is valued and treated with respect.Here are a few reasons you'll love working with us: Great CompensationPaid TrainingPaid VacationRoom For GrowthLow Stress, Easy dress CodeNo Nights or WeekendsFantastic Company CultureStaff Reward SystemsBonuses and Tips!Owners love to cook and bbq for employees, and other FUN FUN stuff!Birthday RecognitionOwners and Managers are EMPLOYEE FOCUSED! You will feel appreciated and respected!Cleaning For A Reason And Cleaning For First Responders In Collin County:  We are cleaning for patients that have cancer, and our well deserving first responders of Collin County!We're looking for great people who are Trustworthy, Motivated, Hard Working, and Dependable! Come join our amazing team and get the recognition you deserve!Details about the job: Monday-Friday 8-5pmNo Late Nights or WeekendsService Area: Mckinney, Frisco, Allen, Plano, Princeton, Melissa, Van AlstyneCleaning Two Homes a Day* We provide residential house cleaning, apartment cleaning, condo cleaning on a recurring basis.*We are professional, but we offer a stress-free work environment. We enjoy what we do and have fun cleaning!*Must Have: *Drivers LicenseReliable Transportation And Proof Of InsuranceAuthorized To Work In The USA**This job would be a great fit for anyone who has previous experience as: Day Care Teacher, Residential Cleaner, Hotel Housekeeping (Room Attendant), Certified Nursing Assistant (CNA), Home Health Aide, Personal Care Assistant (PCA).Job Type: Full-timePay: Up to $850.00 per weekBenefits:Paid time offSchedule:Day shiftMonday to FridaySupplemental Pay:Bonus payTipsWork Location: Multiple Locations", "url": "https://www.indeed.com/viewjob?cmp=The-Cleaning-Force,-LLC&t=Maid+Near+Mckinney&jk=cf98c708034c479b&vjs=3"},
{"job_title": "new✨ Full Time House Cleaner near Crystal Lake", "summary": "Valid driver's license and insurance.\nAbility to lift, stand, bend, kneel, push, pull, and _clean!_.\n*_Weekly Compensation _*– Make $800-1000 per week plus tips…", "company": "Abby Cleaning Service LLC", "location": "Crystal Lake, IL", "job_description": "Abby Cleaning Service is a second generation, locally owned residential cleaning company serving the Greater McHenry County area. We believe an employee-first business model is best for both our staff and clientele alike. You will be backed by over 25 years of cleaning experience and we will show you how to clean like the Pros do.Benefits - What We Provide: Comprehensive Paid Training - We are going to show you how the pros do itFun Work Environment - We work hard AND play harderWeekly Compensation – Make $800-1000 per week plus tipsNo Nights, Weekends, or Holidays requiredThe Right Candidate - Requirements: We employ individuals with integrity, loyalty, and respect.This position demands attentiveness, responsibility, stamina, and care.Must be willing to learn and grow as an AbbyClean Team Member.Ability to lift, stand, bend, kneel, push, pull, and clean!Full-time availability (Mon- Fri 8:00am- 5:00pm)Valid driver's license and insuranceYour own transportationExperience not necessaryThis job would be a great fit for anyone who has previous experience as: Day Care Teacher, Residential Cleaner, Hotel Housekeeping (Room Attendant), Certified Nursing Assistant (CNA), Home Health Aide, Personal Care Assistant (PCA).Abby Cleaning Service is an equal opportunity employerJob Type: Full-timePay: Up to $1,000.00 per weekWork Location: Multiple Locations", "url": "https://www.indeed.com/viewjob?cmp=Abby-Cleaning-Service-LLC&t=House+Cleaner&jk=94a7f9d7121c8eca&vjs=3"},
{"job_title": "Laborer", "summary": "As the leader in Geotechnical Construction, we are constantly looking to expand our team and find personal that are willing to grow within our company.", "company": "Keller North America, Inc.", "location": "Little Elm, TX 75068+19 locations", "job_description": "Company Logo:\n\nOverview:\n\nKeller North America, Inc. is a leading drilled foundation, earth retention, and geotechnical specialty contractor with offices located throughout the United States. Keller routinely develops innovative, practical, and cost-effective solutions to challenging geotechnical problems for its customers. As the leader in Geotechnical Construction, we are constantly looking to expand our team and find personal that are willing to grow within our company.\nKeller is actively searching for qualified general laborers to join our successful geotechnical construction team. Candidates need no experience, just open to travel and eager to work hard with a construction company that offers opportunities for long term permanent employment and growth.\nResponsibilities:\n\nApplicants must have the ability to perform physical labor and other strenuous physical tasks; to include frequent bending, kneeling, and lifting & carrying up to 50lbs. Applicants will be expected to perform extensive physical activity including digging ditches and trenches with shovels and picks, backfilling excavations, lubricating and cleaning equipment, organizing construction materials and supplies, cleaning and preparing construction sites to eliminate rubble, debris and any other hazards, along with many other physical tasks required on typical construction sites. Applicant may also be expected to safely operate hand and power tools of all types including jackhammers, drills, saws, grinders, mixers, pneumatic tampers, etc.\nMore qualified candidates with hands on construction experience such as installing rebar, placing concrete, tending drilling operations, forklift and/or skid steer operating experience is a plus but not required. All candidates must be open to travel Base pay rate is $17-30 per hour- Actual pay rate is based on experience.\nQualifications:\n\nBasic Qualifications:\nMust be 18 years or older\nProvide two forms of valid identification\nWilling to travel and work throughout the state of Texas and beyond as needed\nEagerness to learn and have a coachable attitude – Self motivated\nComfortable working outdoors with extreme weather fluctuations\nAble to work in confined and cluttered spaces\nWilling to work overtime\nStand, bend, lift up to 75 lbs. throughout the day\nBe drug free\nHave reliable transportation\nEligible to work in the United States\nPossess the skills to work safely and efficiently\nWhile it is preferred, candidates do NOT have to live within the Dallas Area. All travel expenses will be covered from the candidate’s home of record.\nKeller is an Equal Opportunity Employer. We encourage qualified woman, minorities, veterans, individuals with disabilities, and others to apply.\nEqual Opportunity Employer", "url": "https://www.indeed.com/viewjob?jk=7d7406e941337d75&q=Labor&l=USA&from=web&advn=4152480239454090&adid=382815287&ad=-6NYlbfkN0ABOmTc2Kq8NG9W3K4V2Qz21-HnnwquNFOhxHbCZHT8Ls6FE_GGNYcwoff_-yi6L-row1Yl7sZMA9uxV3lhZ45KsgTtIBB8SsrzioIeICZIVwBqYEIm9HZMj2YgRvewcb4IHcDkXpSh8o__G9pzMPmQ2ikwzK3Rx22sluWDq1gU6hRGhGDMwp9ny8jJ4xSVTiUeEhdjFqTJ_uC2rNvWvNRkzGwroTNjU_95PWhva-zhVDghYDOrHnEk9aiU4XdZ24UhK47SkfDoe1NiSSECbis63Izy9bbYF7Sez9MLw7VxwcAIOoibGOGBVIBJnzq_q9_2mbtN-Dyu2RWK8Wf_SebYc197_YmibKdtGlBTyAv_jG4F4G5sglr1&sjdu=djVs02zP0Nnft-hsQ7m0NTVmD_6pGgxtxCwUNVQfMEkRwzfpiez2QyLSW-4FszPE8-tgauxgWS1On4jANa62w3del5bBmQ-I6kEt0VA1Kd1i93pzm8hycz6AD2O_W1gRFtlX9J_HLfY404O9ay7EdjDZCnEigGTRsnzEoAs0zTgVG3DvHTRJIobf9K4dHG0gmGprbGyk3Jhf32Jybfy84C_K2ijM0XuOKRRVCwdQwPyGvAKJwoyHb-JQta6d_IXUNDZv0iXfX1kgLDBUip1yGw&acatk=1frequjrtn56e800&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "new✨ Profesionales de Limpieza de Casas (Trabajos en Español)", "summary": "¡En Bello's Cleaning, nuestra misión es ser increíbles!\n¡Estamos comprometidos a tratar a cada empleado y cliente con un sincero deseo de construir nuestra…", "company": "Bello's Cleaning LLC.", "location": "Arnold, MD+3 locations", "job_description": "¡En Bello's Cleaning, nuestra misión es ser increíbles! ¡Estamos comprometidos a tratar a cada empleado y cliente con un sincero deseo de construir nuestra relación!Por qué te encantará trabajar con nosotros: La mejor compensación de la industriaEntrenamiento pagadoVacaciones pagadasVacaciones pagadasPagado consistentemente y a tiempoObtenga un depósito directo (quincenal)Disponer de un buen material de trabajoTener un gran ambiente de trabajoEspacio para crecer dentro de nuestra empresaBajo estrés, código de vestimenta fácilNo hay noches ni fines de semanaUna vez a tiempo completo, tendrás un promedio de 600 a 800 dólares semanales y llegarás a casa poco después de que los niños salgan del colegio. Este tipo de trabajo físico es saludable y activo, lo que contrasta con los sedentarios trabajos de oficina de 9 a 5.Como empresa, entendemos que debemos: Dirigirnos con cariñoTener INTEGRIDAD en todo lo que hacemos.Buscar siempre la EXCELENCIA.Construir RELACIONES abiertas y honestas a través de la comunicación.Aceptar e impulsar el CAMBIO, ser FLEXIBLES.Crear y divertirse.Perseguir el crecimiento y el aprendizaje.Construir un espíritu familiar y de equipo positivo.Ofrecer WOW a través del SERVICIO.Lo que buscamos: Actitud agradable y positivaAlta energíaMinuciosidadConfiabilidadConfiabilidadPermiso de conducir válidoDetalles sobre el trabajo: Limpieza de casas residencialesServicio: Annapolis, MD y alrededoresNos encantaría que te presentaras si crees que encajas bien en nuestra empresa y cultura.Tipo de trabajo: Tiempo completo, ContratoPago:  $600.00 - $800.00 por semanaJob Type: Full-timePay: Up to $800.00 per weekWork Location: Multiple Locations", "url": "https://www.indeed.com/viewjob?jk=44f682109872fe96&q=Labor&l=USA&from=web&advn=5719321752396139&adid=383511888&ad=-6NYlbfkN0ANwBGmh2YTOwNgVRrKaLOuiJApafkPSdY7uvuv4XA2sNjjtkmFDsRj2OI5_r0kZbQ0aFfKHZAZ2bwjF0ufPWADrnBm8nAwu3lTCUHbpJ_JYtJVy72YNw2qquefKoVpYhSN_skcMiJh5SuPXeFHgnNDAeliS0R7kKkuwzq3JZiqxJPVQ2x_JPGFzJCqUySO6PeliwU1kBGpwKgohAbfYNO_uKALIrjtKwAr8IZMJKsKO-RpMLaw39Lhm4GH-e8z2HJ22L5hlFQ9xv2LDDOTgoPilVrJ7dupk6tkqRGzNptqAjy19PP4qXfm7t6hBHSFIda0y1F-vaoz_c4_PYV1iYeq3_hBDwmwMLl-id0-7NUq593C-56DbEzk&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "newHouse Cleaner/Housekeeper - Full Time - Weekly Pay + Tips &...", "summary": "Valid drivers license and your own vehicle are needed.\nWork for us for 1 year earn a weekend trip to Las Vegas.\nMust be able to work Mon - Fri 7:30am-3/3:30pm.", "company": "Thumbs Up Cleaning LLC", "location": "San Antonio, TX+2 locations", "job_description": "We are hiring immediately! Thanks to our amazing staff we are receiving tons of new clients and are needing detail oriented, energetic, and responsible House Cleaners/Housekeepers! Work for a 5-star rated company that knows how to recognize your achievements and reward you for your efforts.Thumbs Up Cleaning is a family-owned residential cleaning service that was established in 2017. The company goes to great lengths to attract, hire, train, and retain world-class team members, who are all treated like family. Our team members at Thumbs Up Cleaning pride themselves on a job well done. This translates into an exemplary level of service for clients that is 100% guaranteed.Here are a few reasons you'll love working with us: Paid time offQuarterly bonusesWeekly payWork for us for 1 year earn a weekend trip to Las VegasWe provide water and snacks each dayWe provide uniformsWe provide company carsWe provide all the supplies and tools needed for the jobHoliday bonusesWhat we are looking for: No Experience RequiredMust be able to work Mon - Fri 7:30am-3/3:30pmValid drivers license and your own vehicle are neededIf this sounds like you. Go ahead and click the apply button!Job Type: Full-timePay: $400.00 - $600.00 per weekBenefits:Paid time offSchedule:8 hour shiftDay shiftMonday to FridaySupplemental Pay:Bonus payTipsWork Location: Multiple Locations", "url": "https://www.indeed.com/viewjob?cmp=Thumbs-Up-Cleaning-LLC&t=House+Cleaner+Housekeeper&jk=d8edf29d353cd523&vjs=3"},
{"job_title": "General Production Worker: 1st Shift", "summary": "You are not just applying for a job, this is the start to a new career whether your path takes you to the corporate headquarters or within the food production…", "company": "Sigma", "location": "Richmond, VA+2 locations", "job_description": "Sigma is a global food company that is dedicated to the production, distribution and sales of refrigerated and frozen products such as cold meats, dry meats, cheese, yogurt, prepared meals and beverages. We have a strong diversified portfolio of well-positioned brands that market in the countries where we participate.We operate in 69 production plants, serving more than 590,000 customers in North, Central, South America, the Caribbean and Europe. Working for Sigma is like working for a family-owned business, we believe in taking care of our associates so they will be dedicated to producing high quality products. You are not just applying for a job, this is the start to a new career whether your path takes you to the corporate headquarters or within the food production and distribution side of the business.*6am-2:30pm Shift, but until production is finished*Duties and Responsibilities: Perform any duties prescribed by Supervisor or Foreperson.Must meet productivity requirements.Observe company safety policies (3 written safety violation notices will result in a decrease in pay to the apprentice level).Must maintain drug free status per company drug and alcohol policy.Ready to Eat TeamPlaces product into packagesEnsures product meets quality requirementsPack Off TeamPlaces packages into boxesLift boxes to stack on a palletLifting up to 40lbs.Education/Skill Requirements: Good Attendance/Performance record.High School Diploma or equivalent.Demonstrated ability to work well with others.Strength and endurance required.Ability to lift 50 lbs. repetitivelyCome join our team of professionals! Sigma provides equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, Sigma complies with applicable federal, state and locals laws, including fair employment practices and equal employment opportunity when conducting recruiting and hiring, governing non-discrimination in employment in every location in which the company has facilities.Job Type: Full-timeBenefits:401(k)401(k) matchingDental insuranceEmployee assistance programFlexible spending accountHealth insuranceHealth savings accountLife insurancePaid time offParental leaveProfessional development assistanceReferral programRetirement planTuition reimbursementVision insuranceSchedule:Monday to FridayOvertimeWeekend availabilitySupplemental Pay:Bonus payEducation:High school or equivalent (Preferred)Work Location: Multiple Locations", "url": "https://www.indeed.com/viewjob?jk=ca7689d75d0ca8f3&q=Labor&l=USA&from=web&advn=7325694496356098&adid=6842784&ad=-6NYlbfkN0CgRlvPIL6FYBa1iR3CVicMzw2BG-nKpnjzBv32GwVxkYqdHIlzVjviild9AEeQStB3-GPXhyakNmfkeB0htWqP59v95ije8rBGf3YCARIqtg3ygOW3AP9VOaMkH3oa19WyYkpS944nKVHP1JV6mjdjTnCys-LYubqzFylVtqyRnRX3CZ_lGjP0MhcfuGb_1VZO9ik90Tk8okVJztTchdGevaBuP0PhxPNXdD0lNL0HTUeOoHK-b0WugrbCbvhTIcy-V06ZYDUN-_rBunELhEcwkfVHQfoUKsmJ0yDLf5NczsxtZEg2DxjFNKAUzc0HS_nr41fK2HyGwV9sY2CtVJiiAerWRhDNfIbt99lJdSLmZg%3D%3D&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "newGeneral Labor", "summary": "A general laborer will conduct physical labor on various construction sites.\nThe individual will prepare sites by cleaning them, loading or unloading materials,…", "company": "BEST", "location": "Hollywood, FL+1 location", "job_description": "A general laborer will conduct physical labor on various construction sites. The individual will prepare sites by cleaning them, loading or unloading materials, and removing hazards. The individual will also partake in day to day operations.", "url": "https://www.indeed.com/viewjob?jk=6de07d1c682c1ebb&from=serp&vjs=3"},
{"job_title": "Cleaner", "summary": "Temp cleaners at the University recieve full Pitt Benefits when they reach the 6 month mark on assignment, including full medical, vacation, and sick time.", "company": "The University of Pittsburgh", "location": "Pittsburgh, PA+3 locations", "job_description": "Cleaner\nAll Temps - Pennsylvania-Pittsburgh - (22000078)\nAll Temps is an internal staffing agency for the University of Pittsburgh. We are currently taking applications for cleaner roles. Temp cleaners at the University recieve full Pitt Benefits when they reach the 6 month mark on assignment, including full medical, vacation, and sick time.\n\nThe incumbent will be responsible for tasks related to the maintenance of University facilities. These tasks could include, but are not limited to, cleaning equipment, classrooms, offices, restrooms and other University facilities, stocking supplies, transporting material, emptying waste cans and recycling materials.\nA High School Diploma or GED is required. Child protection clearances are also required.\n\nThe University of Pittsburgh is an Affirmative Action/Equal Opportunity Employer and values equality of opportunity, human dignity and diversity. EOE, including disability/vets\n\nThe University of Pittsburgh requires all Pitt constituents (employees and students) on all campuses to be vaccinated against COVID-19 or have an approved exemption. Visit coronavirus.pitt.edu to learn more about this requirement.\n\nAssignment Category Part-time temporary\nCampus Pittsburgh\nMinimum Education Level Required High School Diploma or GED\nMinimum Experience Level Required 1-2 years experience\nBackground Check For position finalists, employment with the University will require successful completion of a background check\nChild Protection Clearances The following PA Act 153 clearances and background checks are required prior to commencement of employment and as a condition of continued employment: PA State Police Criminal Record Check, FBI Criminal Record Check, PA Child Abuse History Clearance.\nRequired Documents Resume\nOptional Documents Not Applicable", "url": "https://www.indeed.com/viewjob?jk=ae3106f82ba8147b&from=serp&vjs=3"},
{"job_title": "newGeneral Kitchen Cleaner/ Dishwasher", "summary": "Works in all kitchen areas cleaning equipment, floors, walls, refrigerators, etc. in accordance with department standards.\nWorks in large, commercial kitchen.", "company": "Massachusetts General Hospital(MGH)", "location": "Boston, MA 02114 (West End area)+2 locations", "job_description": "General Kitchen Cleaner/ Dishwasher\n - (3186716)\n\nCleans dishes, pots and equipment in a safe and sanitary manner following department policies and procedures.\nUses the following equipment: flite-type dishmachine, pot and pan machine, cart washer, powered floor cleaner, fryolator fat filter, and general cleaning equipment. Informs supervisor of any malfunctioning equipment.\nUtilizes approved cleaning agents in a safe and sanitary manner.\nWorks in the dishroom emptying soiled patient tray trucks, rinsing clean stacking dishes, loading and unloading the dishmachine and putting clean dishes away in their designated areas.\nWorks in the pot and pan area rinsing, washing and sanitizing pots, pans and utensils and putting them away in their designated areas.\nWorks in all kitchen areas cleaning equipment, floors, walls, refrigerators, etc. in accordance with department standards.\nDisposes of trash into appropriate receptacles in a safe and sanitary manner throughout the production and other designated areas.\nMake deliveries and pick-up of items upon request (ie: to and from the purchasing unit, maintenance department, etc.).\nHelps prepare food and serves customers if needed.\nCovers breaks\n Prepares kitchen areas for monthly pest control inspection.\nAttends meeting and inservices as scheduled.\nFollows department dress code.\nWorks in the dishroom area emptying soiled patient tray trucks, rinsing and stacking dishes, loading and unloading the dishmachine, and putting clean dishes away in their designated areas.\nWorks in the pot and pan area rinsing, washing and sanitizing pots, pans and utensils and putting them away in their designated areas.\nWorks in all kitchen areas cleaning equipment, floors, and walls.\nSupervises the safe and sanitary disposal of all production area trash and other areas upon request.\nMakes deliveries and pick-ups items upon request (ie: to and from the purchasing unit.)\nWorks in cooperation with other Group Leaders to ensure completion of employee job assignments and the safe operation of equipment.\nSecures the main kitchen and is responsible for locking and unlocking doors at specified times.\nFollows department dress code.\nOther duties may be assigned based on the demands of the operation.\n\nMust be able to speak, read, write and understand English at a basic proficiency level and perform basic arithmetic computations, in order to measure detergent and cleaning solutions.\nMust possess interpersonal skills to coordinate to work with approximately 12-15 employees.\nBends, lifts, carries, pushes, and handles items weighing, occasionally up to 40 lbs.\nMust be able to stand for 90 percent of the workday.\nWorks in large, commercial kitchen. Must be able to stand for long periods of time. Unit can be noisy and hot.\n\nEEO Statement\n\nMassachusetts General Hospital is an Equal Opportunity Employer. By embracing diverse skills, perspectives and ideas, we choose to lead. Applications from protected veterans and individuals with disabilities are strongly encouraged.\n\nPrimary Location MA-Boston-MGH Main Campus\nWork Locations MGH Main Campus 55 Fruit Street Boston 02114\nJob Food Services - Other\nOrganization Massachusetts General Hospital(MGH)\nSchedule Part-time\nStandard Hours 16\nShift Rotating\nPosted Shift Description Weekend only.\nEmployee Status Regular\nRecruiting Department MGH Nutrition Services\nJob Posting Feb 8, 2022", "url": "https://www.indeed.com/viewjob?jk=99f2bc8dcef411ef&from=serp&vjs=3"},
{"job_title": "Food Service Operator", "summary": "Come to work properly dressed according to the dress code.\nProper uniform; non-slip shoes, name tag.\nISS offers a competitive compensation package including…", "company": "us issworld", "location": "Midlothian, TX 76065+3 locations", "job_description": "Food Spot Attendant\nHourly Wage\nISS offers a competitive compensation package including Benefits, Paid Time Off, and a starting hourly salary of $15.25\n\nKey Purpose\n\nMaintain the pantry area and coffee stations while keeping service areas clean and stocked with product. Merchandise products in an attractive manner to Guckenheimer standard. Greet guests, making them feel welcome.\n\nSuccess Criteria\n\nArrive on time to all shifts\nProper uniform; non-slip shoes, name tag\nProfessional appearance\nProvide outstanding hospitality\nDon’t be afraid to ask for help!\n\nKey Areas of Collaboration and Influence\n\nA strong commitment to guest experience\nAlways remember safety first.\nBuild respectful relationships with all teammates and guests.\nWillingness to take directions from the Chef, Front of the House Manager and Catering Manager\nBuild relationships with delivery vendors.\n\nIdeal Candidate Experience\n\nMust have a passion for customer service.\nAlways have a positive attitude\nBe dependable and reliable\nAbility to communicate effectively.\nAbility to smile and keep calm under busy working conditions.\n\nKey Accountabilities\n\nMaintain product inventory to established levels.\nMaintain contracted coffee program\nRecognize products; accurately restock and rotate products.\nSmile, greet, & serve customers, making them feel welcome.\nComplete necessary HACCP to ensure safe temperature control\nDisplay merchandise in an attractive manner\nMaintain all MK areas in a neat, clean, and attractive manner.\nLabel and display signs for all items.\nOther duties as assigned by management.\nMust follow all safety rules and actively prevent accidents.\nEnsure that all MKs are restocked with adequate product throughout the day.\n\nPhysical Demands & Work Environment\n\nWork up to 8 hours a day on your feet, excluding breaks.\nMust be able to lift a minimum of 25lbs.\nCome to work properly dressed according to the dress code.\nEmployee must be able to work under pressure and time deadlines during peak periods.\n\nISS, a leading workplace experience and facility management company, provides placemaking solutions that contribute to better business performance and makes life easier, more productive and enjoyable – delivered to high standards by people who care. ISS believes that people make places and places make people. From strategy through to operations, ISS partners with over 60,000 customers in 30+ countries to deliver places that work, think and give and is served by 471,056 employees who connect people and places every single day. In 2019, ISS earned DKK 78 billion in revenue. It is headquartered in Copenhagen, Denmark.\nDate posted: Feb 8, 2022\nRegion: Americas\nLocation:\nMIDLOTHIAN, TX, US, 76065-5328\nJob Category: Food Services\nFull time/Part time: Full Time\nRequisition ID: 6420", "url": "https://www.indeed.com/viewjob?jk=32a5d29e491afe73&from=serp&vjs=3"},
{"job_title": "newAmazon Grocery Warehouse - Hiring Now!", "summary": "You’ll be part of the Amazon grocery team that supports one of Amazon’s busiest services: online grocery orders.\nSome of your duties may include:", "company": "Amazon Workforce Staffing", "location": "Colorado Springs, CO 80902+4 locations", "job_description": "Amazon Grocery Fresh Associate\nJob Overview\nYou’ll be part of the Amazon grocery team that supports one of Amazon’s busiest services: online grocery orders. It’s similar to a shopper role, except that you’ll be working in a grocery warehouse, but it’s not like our other bigger buildings, it’s more like the size of a grocery store. Amazon Fresh offers customers everything from cereal to ice cream to fresh flowers, so you’ll be preparing orders for customers, working in different environments – including refrigerated and freezer spaces for part of your shift. It can be cold, but we’ll provide you with the right gear to stay warm!\nDuties & Responsibilities\nSome of your duties may include:\nPrepare grocery orders for delivery\nUse technology like computers, smartphones, manage apps, and scan bar codes\nIntake new grocery inventory and put away\nCheck for order quality\nRotate tasks throughout the week\nYou’ll also need to be able to:\nLift up to 49 pounds\nWork in temperatures as low as -10°F and up to 90°F for extended periods\nStand, walk, push, pull, squat, bend, and reach during shifts\nUse carts, dollies, hand trucks, and other gear to move items around\nGo up and down stairs (where applicable)\nHandle a variety of products you can buy on Amazon Fresh – including meat and alcohol\nWhat it's like inside an Amazon Fresh Warehouse\nSafety. Your safety is important to us, so we provide protective gear. All teams share safety tips daily.\nSurroundings. You’ll be working around moving machines – order pickers, stand-up forklifts, turret trucks, and mobile carts.\nActivity. Some activities may require standing in one place for long periods, walking around, or climbing stairs.\nTemperature. You’ll work in refrigerated and freezer spaces (as low as -10°F) for up to two hours of your shift, with short breaks every 30 minutes. You’ll be provided with proper safety gear and training.\nNoise level. It can get noisy at times. We provide hearing protection if you need it.\nDress code. Relaxed, with a few rules to follow for safety. Comfortable, closed-toe shoes are required.\nWhy You’ll Love this Job\nStay busy. You and your team are engaged the entire shift.\nSchedule options. Depending on where you work, schedules may include full-time (40 hours), reduced-time (30-36 hours) or part-time (20 hours or less), all with the option of working additional hours if needed.\nShift flexibility. Work when it works for you. Shifts may include overnight, early morning, day, evening, and weekend. You can even have four-day workweeks, three-day weekends – and with Anytime Shifts, you can work as little as four hours per week.\nCareer advancement. We have made a pledge to upskill our employees and offer a variety of free training and development programs, and we also have tuition reimbursement options for select employee groups. See where your Amazon journey can take you.\nAnytime Pay. You can instantly cash out up to 70% of your earnings immediately after your shift (for select employee groups). Learn more about Anytime Pay.\nNew skills. Depending on the role and location, you’ll learn how to use the latest Amazon technology.\nFree training. We’ll teach you how to drive power industrial trucks and how to work with the latest technology.\nTeam environment. Work on small or large teams that support each other.\nWhy You’ll Love Amazon\n\nMany of our jobs come with great benefits – including healthcare, parental leave, ways to save for the future, and opportunities for career advancement – all in a safe and inclusive environment that’s been ranked among the best workplaces in the world. Some offerings are dependent upon the role, work schedule, or location, and can include the following:\n\nCompetitive wage paid weekly\nPaid Time Off (PTO)\nHealthcare (medical, dental, vision, prescription drugs)\n401(k) savings plan\nHoliday pay opportunities\nOn-the-job training and skills development\nEmployee Assistance Program\nLearn more about Amazon Benefits and Culture\nhttps://hiring.amazon.com/why-amazon/benefits#/\nhttps://hiring.amazon.com/why-amazon/culture#/\nRequirements:\nCandidates must be 18 years or older with the ability to understand and adhere to all job requirements and safety guidelines.\nHow To Get Started\nYou can begin by applying below. If you need help with your application or to learn more about our hiring process, you can find support here: https://hiring.amazon.com/hiring-process#/.\n\nAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://hiring.amazon.com/people-with-disabilities#/.\nThe pay range for this position in Colorado is $15 – $19.10 an hour; however, base pay offered may vary depending on job-related knowledge, skills, and experience. A sign-on bonus and restricted stock units may be provided as part of the compensation package, in addition to a full range of medical, financial, and/or other benefits, dependent on the position offered. This information is provided per the Colorado Equal Pay Act. Base pay information is based on market location. Applicants should apply via Amazon’s internal or external careers site.", "url": "https://www.indeed.com/viewjob?jk=087fb026cdb6d0a2&tk=1frer8gktt4n9800&from=serp&vjs=3&advn=7058506697514818&adid=377164056&ad=-6NYlbfkN0Dq4vQYgMEQOEiQzIefT02VXlVGpQ3VAIEku7A3IjxLBCEzQa77temkI8ftDf1bzvSnzrtwts6Lsn6LArtPAmzCd4XoM9AFz5PRyt1wPI_rAAYSQzHeiGmZq3jZ9gE7IZpXS1okvPtWPStp2R6-lVSkvtqg1tJdWSXeRcKAQMuQsskf5HzvD76vUJmHKzsk6ATnfzLFo6G6G-uHqiIvW6sKTtXFezTHazErFttUR-J0T04tTiGfdDEtses78qUwbxAHtj1SresccI_38BC08-K43-iLeNoi7cSmI1Ikfu_0kGmk9jALyJozOFS2zIuAyFrH8cZGMqLrHubcu2NXlU8QYYS8V3TMxBgVnkG4bdRiIBuFItJ1pc54L2a9or5LxmI=&sjdu=i6xVERweJM_pVUvgf-MzubHsPDjn9FPrYV_9DPsu70lrwcz7yIprImk1F7Yp-atw"},
{"job_title": "newFull Time House Cleaner (Paid Weekly)", "summary": "Reliable Transportation-Vehicle ( No Motorcycles).", "company": "Tidy Maids", "location": "Carmel, IN+2 locations", "job_description": "With Tidy Maids our focus is to clean homes with care so that our customers can focus on quality of life.Here are a few reasons you'll love working with us:Weekly PayTipsBonus Opportunities & IncentivesGreat Work EnvironmentFamily Friendly HoursPaid TrainingCleaning Supplies Provided:We're looking for great people who are Caring, Ambitious, and Engaging! Come join our friendly team ofDetails about the job:Monday -FridayOccasional SaturdaysService Area: Indianapolis, Carmel, FishersMust Have:Driver's LicensesBackground CheckReliable Transportation-Vehicle ( No Motorcycles)Job Type: Full-timePay: Up to $800.00 per weekWork Location: Multiple Locations", "url": "https://www.indeed.com/viewjob?cmp=Tidy-Maids&t=House+Cleaner&jk=3802773f1eaff8aa&vjs=3"},
{"job_title": "Warehouse Associate", "summary": "Come Discover Different at TJX—we think you’ll find that it’s so much more than a job.\nOur Distribution Centers are the key to getting new products to our…", "company": "HomeGoods", "location": "Jefferson, GA 30549", "job_description": "Brand:   HomeGoodsLocation:   Jefferson, GAEmployment Type:   Full-TimeEmployment Status:   RegularFunctional Area:   Distribution CentersCome Discover Different at TJX—we think you’ll find that it’s so much more than a job. Our Distribution Centers are the key to getting new products to our TJ Maxx, Marshalls, HomeGoods, Sierra, Winners, Homesense, and TK Maxx stores. We move a lot of inventory—at all times of the day—and that takes working, learning, and growing together. When you’re a part of our TJX family, you have the full support of a diverse, close-knit team in our Distribution Centers.HomeGoods Distribution Center, Jefferson, GAGeneral Warehouse AssociateA shift - Monday-Thursday, 5:00am-3:15pmB shift - Friday-Sunday, 5:00am-5:30pmC shift - Monday-Thursday, 3:45pm-2:00amD shift - Friday-Sunday, 5:30pm-4:45am$17.00-$20.00, plus $.35 increase after 30 daysLove where you work, and enjoy:/ Competitive wages/ Incentive pay for eligible Associates/ Culture that prioritizes health & safety/ Clean and climate-controlled workspace/ Career advancement and promotion opportunity/ Paid vacation and sick time /Benefits including medical, dental, and vision insurance, 401k and 401k match,/ Associate DiscountAlthough all General Warehouse associates are assigned to a specific department and supervisor, they may work in another area of the warehouse if needed.  Job responsibilities include:Count, select and sort objects such as totes, boxes, merchandise or other items by style, color, store order or other criteria.Match receipts against purchase orders.Ticket merchandise or other items with gum labels, swiftach gun or pin tickets.Pack or unpack merchandise or other items into or out of boxes.  Seal boxes for shipping when packing completed.Remove or sort merchandise by style, store order or other criteria.Manual material handling of objects such as totes, boxes, garments or other items up to 10 lbs constantly, up to 50 lbs frequently and up to 75 lbs occasionally.  As you think about where to work, know that we take care of our people. We offer competitive pay and great benefits. We consider all applicants for employment without regard to race, color, religion, gender, sexual orientation, national origin, age, disability, gender identity and expression, marital or military status. We also provide reasonable accommodations to qualified individuals with disabilities in accordance with the Americans with Disabilities Act and applicable state and local law.Job Type: Full-timePay: $17.00 - $20.00 per hourJob Type: Full-timePay: $17.00 - $20.00 per hourBenefits:401(k)401(k) matchingDental insuranceEmployee discountHealth insurancePaid time offReferral programVision insuranceSchedule:Day shiftNight shiftApplication Question(s):Are you willing and able to lift up to 50lbs consistently, with or without a reasonable accommodation?Are you willing and able to stoop, crouch and squat as needed, with or without a reasonable accommodation?You must be 18 years of age or older to work in the distribution center, do you meet this requirement?Work Location: One location", "url": "https://www.indeed.com/viewjob?jk=2869e4b0ad4ab17f&q=Labor&l=USA&from=web&advn=8245834834568284&adid=381233737&ad=-6NYlbfkN0DQGqLLSFZ-kilUUBrKE7W_nOQ9qIs7cmmNY-Jc8BUWfGPpx7KTWC8Oyf8uC1k8rapkj0oG06o8sEbQ_zvjbGPEHmbWfuXnP4-LXuUtJgliBeRiNZTO-2GojhRcasPifLX3_YBuBrQpdXtnTaCPh5cBp8bTvxyRHvga9MeBCuqjLpCIq-tRmIKAhNlkyobzJOOzRt9XTmLW5UzHWTRRlYrBjIedlxPLTEJPDj4zi5IC8b--lHonh_J36u7KoBPjjNNY_Zm_rsIo-8O0vaWus9qMOSvNf05W3a4Kkt1Ec5fK6VUs2JlU05AgauP404DfUpdfUxDqivrC1C0Tv6nrcd9H9_n9YbiGOu4xYqxk2DD3qQ%3D%3D&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "newGeneral Laborer", "summary": "At PestBear, we recognize that all of our associates in every role are all important to our service and success.\nPay: $15.00 - $17.00 per hour.", "company": "PestBear", "location": "Hudson, FL 34667+1 location", "job_description": "At PestBear, we recognize that all of our associates in every role are all important to our service and success. As one of the largest family owned pest, termite, and lawn service companies in Florida, we are looking for people who are passionate about what they do, have a positive attitude, and strong work ethic.Our goal is to ensure that we exceed our customers’ expectations by providing excellent customer service to all of our customers. In doing so, we need to have a team of enthusiastic employees ready to serve our customers. You can’t measure compassion, integrity, or loyalty, but qualities like these displayed by our employees and encouraged by management is what makes our company feel like a team.If you are interested in learning about career opportunities and joining our winning team.Job Type: Full-timeJob Type: Full-timePay: $15.00 - $17.00 per hourWork Location:One locationWork Remotely:NoWork Location: One location", "url": "https://www.indeed.com/viewjob?jk=01b46eaa8f6f165f&q=Labor&l=USA&from=web&advn=5696614645714286&adid=383624597&ad=-6NYlbfkN0C6X3on6CPY6i6RxQlqkR_f-XgTLr7z0YvkAmBklM3AvTgrJ7TApQ1UgNpcZ8B2mAvkRkq-sSxClPKnA69iIVrMX_Ijpba6QWU0r4oaBF6yPIKWH5wz5nw760IUY-UC6QqDMui7WTNgCT8KVgCxbPZ1WPEj_CxNkgcSIS5fbiFMPsDapd1-s1guaNNpah8OzXkLEJdjdZtUAYerY6crmYpMmMq3lxqnp6DO3MiE7mCw7m4gyd1RLFBv_8ua-wSKfy9a4K4F6IDgSpn83CZO_5GTjdKDeq-RFHvwdQ4bB2oQk99OQESxNx0HjnJ9xVvzyL4nIudLkffENmbQ9T5LAonOYBzLr9OWdZYd__3QVAp-CHs9eva6obVd&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "newCleaner", "summary": "Haynes does not discriminate against any employee or applicant for employment because of race, age, sex, creed, ancestry, disability, sexual or affectional…", "company": "Hanes Building Service LLC", "location": "Mariposa, CA+14 locations", "job_description": "Haynes Building Services, a Marsden Holding Company, is a facility services provider with an unmatched reputation for operational excellence. We clean, sanitize, and service large and small businesses across the State of California. In a nutshell: we clean buildings… really well. Are you a devoted duster; a super sweeper; a visionary vacuumer? Then we want you!\nJob Skills / Requirements\nHaynes Building Services has an immediate opening for cleaning fanatics! Join an essential company to service the buildings and facilities in your community. We’ve been around for over 65 years, and COVID has only made us a stronger team. Start feeling like you’re making an impact by keeping your community clean, safe, and healthy!\nDay Cleaner\nMonday-Friday\n2 Hours While Open\n$20.39/hour\nPart Time Work\nJob Duties:\nAs you might expect, cleaning is at the heart of what your job will entail. For the most part, you’ll be:\nCleaning Restrooms, lobbies and offices\nTaking out the trash\nSanitizing, Sweeping, & Vacuuming\nMopping, Dusting, & Buffing\nHourly Rate: $20.39/hour\nShift: Monday-Friday, 2 Hours While Open\nWhy Join the Marsden Family?\nJobs are Classified as Essential\nWe are an Established Organization\nEntry Level Positions\nPart time and full time benefits available\nRequirements:\nYou must be 18 years old\nFor safety reasons, you must be able to speak English\nA pre-employment criminal background check is required.\nWe E-Verify.\nAs a commercial cleaning company, we know how to create a safe environment for our employees and customers. Check out this link to see what we’re doing to stay safe and healthy!\nAdditional Information / Benefits\nHaynes is an Affirmative Action, Equal Opportunity Employer. Haynes does not discriminate against any employee or applicant for employment because of race, age, sex, creed, ancestry, disability, sexual or affectional orientation, marital, or veteran status, color, religion, national origin, status with regard to public assistance or any characteristic protected under federal, state or local law.\nBenefits: Paid Sick Days, Paid Holidays\nThis is a Part-Time position 1st Shift.\nRelocation is not provided and travel is not required\n\nBack Apply Now\nBack\nApply Now", "url": "https://www.indeed.com/viewjob?jk=04e8a6b5d0629abb&from=serp&vjs=3"},
{"job_title": "newProduction Worker", "summary": "Just like the services we provide, every task we perform as a team will be held to the highest standards whether it is the emails we send out or how we speak to…", "company": "KO-Pack", "location": "Chandler, AZ 85286", "job_description": "Production Team Position DescriptionWorking with the Production Team you will be responsible for working with other team member to assembly, kit, and fill products for various clients that we provide our services.A day in production involves working on the assembly line, creating product to be ready for distribution, and case packing the correct items and packing those items neatly for customers to receive.What experience is needed?There is no prior experience needed for this position. Just a good attitude and a willingness to work!General ResponsibilitiesShould be able to lift 20 pounds and stand for 5-6 hours per day. Not every project requires this but some projects will!We take pride in our work and our products show it!Attention to detail on your tasksPacks up completed products and prepares them for shipment.Assembles products by hand also known as kitting.Makes sure that the workstation is clean and organized.Task ExamplesPreparing products for shipments to warehouses at Amazon and Walmart among other distributors.Stickering, Labeling, Boxing/Unboxing, and Taping.Intricate and High Attention to detail tasksHIRING IMMEDIATELY AVAILABLE BenefitsCompetitive Pay: $14 per hour plus Accuracy Bonuses MonthlyGrowth Opportunities:  KO-Pack is a newer, fast-growing company looking to promote within. We help with continued education and career growth planning.Core ValuesAttention to detail.Every service that we offer will be performed at the highest working level. Our Contract Manufacturing and Fulfillment services are equally impressive from the start of the sales process until the product arrives to the brand’s customers. Just like the services we provide, every task we perform as a team will be held to the highest standards whether it is the emails we send out or how we speak to our clients on the phone. We may not ever reach perfect but we will strive for that goal. We will never sacrifice our quality.Remember who we represent.Everything we do is a reflection of each other. Our services represent our values. Our website reflects our brand and how much we care. Our clients' supply chain experience represents our invested time in understanding their products and their needs. Our interactions in all forms of communication represent each other. When people see KO-Pack, they see us. When they see us, people see KO-Pack.We are not a business.KO-Pack Inc. is not a business. It is a team of people working together to offer a service that provides quality consumer packaged goods across all categories. Our team is dedicated to working together in pursuit of a unified goal and each day, all of our actions bring us closer to that unified goal.Work with a purpose.Just as it is with life, our work has a purpose. At KO-Pack Inc we pledge to find purpose in our work and through our ingredients make change in the world. We will do our best to conduct business with other companies who reflect a greater sense of purpose as well as work to reflect our own greater sense of purpose. We will support our team members in the causes they believe in and, where ever we can, contribute to those causes.We succeed together when we trust each other.Trust is the currency that powers every interaction on teams. Only when we trust each other can we share the candid feedback and opinions that let us be creative and successful. We give our coworkers deep visibility into how our decisions are made and easy outlets to help them give input and guide our course. When we build trust through good communication, we create an environment for better communication in the future.About UsMission StatementChange the way we source, manufacture, store, and ship consumer packaged goods.KO-Pack helps brands source, manufacture, store, and ship consumer packaged goods with a focus on high quality, efficiency, and flexibility so that brands can focus on marketing and selling the products that their customers love.Job Types: Full-time, Part-timePay: $14.00 - $16.00 per hourSchedule:8 hour shiftDay shiftMonday to FridaySupplemental Pay:Bonus payAbility to commute/relocate:Chandler, AZ 85286: Reliably commute or planning to relocate before starting work (Preferred)Work Location: One location", "url": "https://www.indeed.com/viewjob?jk=d8ed1db346631c34&q=Labor&l=USA&from=web&advn=6024401745230819&adid=383487071&ad=-6NYlbfkN0AbzMBDYga2mlbvm9sH13eu89ov52CZ0bMP2fg-g8MWhtBZqSwRvei-O_YBP13G-qARFVoY8Lvz-z58_9j7mnH-1Zg6zcbiZlXWA5t1Pu0JXgfvwEIHG2wopNjSoNMSgrseH5QCnUgf6i9MwUt9LyiceTL0_EnaOHY7x0K7rFLRVkCEUEHiDffZI_X2UN0L_xVj2cHCEu1S7c0eLi8TWYpK7Uj2QvH_IATw47C02lSMjbHOpNErGLmaL6o4JKVkr5LY5PMv-ia9BV0NyeCFYaaaYokdoPTSzuRU7mQS22WOEZpj13bUD7DArjxCQoYHLwz26i_Ni4YH-EqGYrYdANKZ_nJw9W10ak8cco_sT5H1mIetVvGPM35B&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "newMover / Laborer", "summary": "Experience in general labor, construction, warehouse labor, manufacturing, or truck driving helpful!\nWork with a regular team – no day labor.", "company": "TWO MEN AND A TRUCK®", "location": "St. Louis, MO 63128+31 locations", "job_description": "HIRING IMMEDIATELY – MOVERS / LABORERS!\n**ONSITE JOB OFFERS!!!** (start working the next day!)\nPAY!\nMOVERS EARN $15 PER HOUR PLUS TIPS!\nTrain to become a driver and earn $25+ PER HOUR PLUS TIPS!\nTIPS earned daily! (top performers average $300 - $500 per week!)\nGuaranteed 2 days off per week! (Closed on Sunday’s)\nWeekly pay via direct deposit\nBenefits: medical, vision, dental, 401(k), Paid Time Off\nEarn up to 2 weeks of EXTRA vacation time for perfect attendance!\nPaid, hands-on training and career development\nReferral bonus program – get hired, refer a friend, and earn $500\nPERKS!\nNEW branded 26 ft. Box Trucks – All Automatic Transmission\nUniform provided\nTablets for electronic paperwork and payments\nWork locally – be home every night!\nWork with a regular team – no day labor\nFlexible hours; full-time or part-time\n**OPTIONAL** Interstate Travel\nREQUIREMENTS\nMust be 18 years or older\nAbility to lift heavy items (100 lbs. or more)\n\nTWO MEN AND A TRUCK® St. Louis is urgently hiring and looking for multiple movers and drivers to join our team! Experience in general labor, construction, warehouse labor, manufacturing, or truck driving helpful! TWO MEN AND A TRUCK® St. Louis - check our team out on Facebook!\n\nThis job posting is for a position at the individually owned and operated TWO MEN AND A TRUCK® franchise located in St. Louis, Missouri. The employer at this location is J & C Enterprises, Inc.", "url": "https://www.indeed.com/viewjob?jk=77eb3c0a6661601b&q=Labor&l=USA&from=web&advn=7432134143541568&adid=380760124&ad=-6NYlbfkN0AusHynt_iaZUx9mH1y6shMIbIHVdtQwcMQEp5CpFSqz4HUy3KzjJSuVnn5al5dfGkGuNyyX1slumw4XVhNnyojW6aUi28SSZsjltscCp00mJkzU_9MWTp2L6R-WHL-btI4qPbIOxrFoMSb3bDcTTadXQKfteCOrmcfLk1-6lJsURbpZqiSM9y3Spi0ssG7-npa9UXQX2LpHvrElLmLzYYne6jdENzJgp8FzT5QJM9lXlrsqg9Plu1OtyDWBnxTHAI05XLx6LlCDQUIiTHPjffB3Tj3LXgXf2GcJz_I3KaWrZ1XVtjRWmu5wN3lTXt_oLG1cvf8hc6BOwHy6R51dnjo1UAd0IarImb0mLQWWioH7D0KwI2HPfoXX11Ei9rKuz8%3D&sjdu=0ZFwD5rbjMRcHz87Kzx_gyG-mtj04iarh4PRdgXaMfJlAj_C3C7DBM7cDJZluLcMVs_Pz6ozLJC51sx9jLsFS23e31Glgsh_OhgFygHeW04yTvUa4cKVFKhirgTLBQB23-Q_MJpuY3kGrEd4M2mM2w&acatk=1frer29pm3kjv000&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "newFood Service Worker PRN", "summary": "The Food Service Worker is responsible for routine daily tasks related to patient food service and provides the highest level of customer service at all times.", "company": "Northwest Medical Center", "location": "Margate, FL 33063", "job_description": "Description\nSHIFT: PRN\nSCHEDULE: PRN/Per Diem\nFood Service Worker\n\nFood and Nutrition Services Department\n\nPRN, Shifts Vary, 0.001 FTE\nNorthwest Medical Center\nMargate, FL\nFacility Description:\nNorthwest Medical Center is a 289-bed medical center and healthcare complex, continuously expanding and incorporating the latest technology in the delivery of care. Awarded the Gold Seal of Approval™ from the Joint Commission which indicates our high standards in performance providing the highest level of services to the population to our community. Northwest Medical Center is also certified by the Joint Commission as primary stroke center and an accredited chest pain center by the American College of Cardiology. We are recognized as a Comprehensive Bariatric Center of Excellence by the American College of Surgeons Metabolic and Bariatric Surgery Accreditation and Quality Improvement Program.\nOur facility continues growing to meet the needs of the community we serve and features expanded capabilities in emergency, critical care, as well as women's and children's services. Out state of the art maternity care includes the only Level III NICU in northern Broward County. The breadth and depth of these service lines translates to increased professional opportunities for our colleagues. We invite you to join a dynamic team of dedicated healthcare professionals and explore your grow potential.\n\nJob Description:\nThe Food Service Worker is responsible for routine daily tasks related to patient food service and provides the highest level of customer service at all times. Ensures that all tasks are completed safely, and in strict adherence to food and nutrition cleaning/sanitation policies and other related policies and procedures. These tasks include, but are not limited to:\nTray assembly\nPortioning of food\nPreparation of snacks, tube feedings, and supplements\nDelivery of floor stock and special items to the units\nDelivery of patient meal trays into patients' rooms.\n\nQualifications\nHigh School Diploma/equivalent, preferred.\n1 year of experience in healthcare food and nutrition services preferred\nAbility to read, write, and converse in English.\n\nNotice\nOur Company's recruiters are here to help unlock the next possibility within your career and we take your candidate experience very seriously. During the recruitment process, no recruiter or employee will request financial or personal information (Social Security Number, credit card or bank information, etc.) from you via email. The recruiters will not email you from a public webmail client like Gmail or Yahoo Mail. If you feel suspicious of a job posting or job-related email, let us know by clicking here.\n\nFor questions about your job application or this site please contact HCAhrAnswers at 1-844-422-5627 option 1.", "url": "https://www.indeed.com/viewjob?jk=108dfa37f3900cfe&from=serp&vjs=3"},
{"job_title": "General Laborer $800 to $1100 per week", "summary": "Certified Transmission is looking for experienced and motivated individuals to fill several material handler positions for its Omaha based operations.", "company": "Certified Transmission", "location": "Omaha, NE 68134", "job_description": "Certified Transmission is a drug free place and does require pre-employment drug screening.Certified Transmission is looking for experienced and motivated individuals to fill several material handler positions for its Omaha based operations. We have immediate opportunities for high caliber associates who have a desire to make an impact and drive results.We are hiring manufacturing Associates- All areasGeneral LaborMaterial HandlersFork Lift operatorsMachine operatorsAssemblers / DisassemblersWeldersPay commensurate with experience.Are you detail oriented, a team player, and driven to make a difference and excel? If this describes you, then consider becoming a part of a nationwide leader in the transmission remanufacturing industry.Certified Transmission offers fantastic shift hours: Monday to Friday 8:00 am to 5:30 pm, paid overtime with no weekends, evenings or holidays, competitive wages, 401k, and opportunities for advancement.The fastest way to apply is to come directly to our office at 1801 S. 54th Street. We are accepting applications anytime from 8:00 am to 4:00 pm.Job Type: Full-timePay: $800 – $1100 per weekJob Type: Full-timePay: $17.00 - $22.00 per hourBenefits:401(k)401(k) matchingDental insuranceHealth insuranceVision insuranceSchedule:Day shiftMonday to FridayOvertimeEducation:High school or equivalent (Preferred)License/Certification:Driver's License (Required)Work Location: One location", "url": "https://www.indeed.com/viewjob?jk=8f58f9c7b4c81bda&q=Labor&l=USA&from=web&advn=9594287924298746&adid=383070631&ad=-6NYlbfkN0DzWMQtdqGyagOlAouCloA1TXHYftrM4N14CFd7hVvsNVeoLA_K1tPCvqoVNieynCrXsUatYqEFrCu6rlnThRBHxOTNiO1Iz2h8Om2HylS7c5dX1H4AqDlKEF6p15LNDCdQG4AJdvZOceCpd_eUb4oFaoFRruppsp6pRvqmv8iS4_LRn5mcFg3_nBWlbSYu38fjXuIIrKyf3CzJUSCDn376SiaSzuUtKrLHTm_Z0VcT2avmLVzre3X2jRHbFn9JtspvIhM2qUKJ1g3-VQ_SCGC10U5d3Z4OIegpKKuL4OjaLiYpLTOj1C89tn7mcppaG1I1rP9J9tACjJ2hTpndEO2mAWs-wtuDVae4YtJ4IhBUPShQbZcj3TWp&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "newPastry Cashier", "summary": "Greet and interact with customers to address questions or concerns in a friendly, service-oriented manner.\nOur warm, friendly, and knowledgeable Team Members…", "company": "Cardenas Market | Cardenas Markets LLC", "location": "El Centro, CA 92243+3 locations", "job_description": "Thank you for your interest in joining Cardenas Markets! We are more than just a grocery store; every one of our customers is part of the Cardenas Family, and we are committed to making our customers shopping experience enjoyable and unique!\nOur warm, friendly, and knowledgeable Team Members will bring families and communities together by providing our customers great food, products, and service at a superior value in a clean and safe environment.\nJob Duties and Responsibilities Include:\nGreet and interact with customers to address questions or concerns in a friendly, service-oriented manner.\nWork in a fun, fast-paced team environment.\nOperate cash register/POS and credit card system.\nAdhere to food regulations and maintain a clean working area.\nAssist Pastry team with preparing desserts and pastries as needed.\nTake cake orders, ensure fresh fruits and products, and maintain a fully-stocked display case.\nProvide flexibility by helping in any area in order to support store needs.\nValid Food Handlers Card required upon hire.\nEssential Abilities:\nFriendly and People Oriented\nPositive Attitude\nTeam Player\nAbility to Multi-task\nQuickly Adapt to Changes\nWork with Sense of Urgency\nQuality Focused\nStrong Organizational Skills\nWork in Fast-paced Environment\nAttention to Detail\nQualifications:\nCashier experience desirable\nFood Prep background desirable\n\nBrand: Cardenas Market\n\nAddress: 1620 North Imperial Ave El Centro, CA - 92243\n\nProperty Description: Store 23 - Cardenas Markets\n\nProperty Number: 23", "url": "https://www.indeed.com/viewjob?jk=c153d4f48d5cc017&from=serp&vjs=3"},
{"job_title": "Amazon Packer (Flexible Part-Time) - Up To $3,000 Sign-On Bo...", "summary": "Amazon Sortation Center Warehouse Associate.\nPay rate: Up to $17.50.\nYou’ll be part of the dedicated Amazon team that is the first stop on the journey from the…", "company": "Amazon", "location": "Lawrenceville, GA 30046+122 locations", "job_description": "Amazon Sortation Center Warehouse Associate\nPay rate: Up to $17.50\n\nJob Overview\nYou’ll be part of the dedicated Amazon team that is the first stop on the journey from the warehouse. Our fast-paced, physical roles take place in a sortation center. You will be sorting, scanning, and stacking packages on pallets, helping to get customer orders ready for delivery. Because most of the shifts are part-time, you are in control of your schedule choosing shifts that work best for you now and the ability to adjust your schedule in the future, as needed.\nDuties & Responsibilities\nSome of your duties may include:\nReceive and sort inventory\nGet customer orders ready for delivery\nUse technology like scanners, computers, and handheld printers\nYou'll also need to be able to:\nLift up to 49 pounds\nStand, walk, push, pull, squat, bend, and reach during shifts\nUse carts, dollies, hand trucks, and other gear to move items around\nGo up and down stairs (where applicable)\nWork at a height of up to 40 feet on a mezzanine (where applicable)\nWhat it’s like at an Amazon Sortation Center\nSafety. Your safety is important to us, so we provide protective gear. All teams share safety tips daily.\nSurroundings. You’ll be working around moving machines – order pickers, stand-up forklifts, turret trucks, and mobile carts.\nActivity. Some activities may require standing in one place for long periods, walking around, or climbing stairs.\nTemperature. Even with climate controls, temperatures can vary between 60°F and 90°F in some parts of the warehouse; on hot days, temperatures can be over 90°F in the truck yard or inside trailers.\nNoise level. It can get noisy at times. We provide hearing protection if you need it.\nDress code. Relaxed, with a few rules to follow for safety. Comfortable, closed-toe shoes are required. Depending on the role or location, Amazon provides a $110 Zappos gift code towards the purchase of shoes, in order to have you prepared for your first day on the job.\nWhy You'll Love this Job\nStay busy. You and your team are engaged the entire shift.\nSchedule options. Depending on where you work, schedules may include full-time (40 hours), reduced-time (30-36 hours) or part-time (20 hours or less), all with the option of working additional hours if needed.\nShift flexibility. Work when it works for you. Shifts may include overnight, early morning, day, evening, and weekend. You can even have four-day workweeks, three-day weekends – and with Anytime Shifts, you can work as little as four hours per week.\nCareer advancement. We have made a pledge to upskill our employees and offer a variety of free training and development programs, and we also have tuition support options for select employee groups. See where your Amazon journey can take you.\nNew skills. Depending on the role and location, you’ll learn how to use the latest Amazon technology – including handheld devices and robotics.\nTeam environment. Work on small or large teams that support each other.\nWhy You'll Love Amazon\n\nMany of our jobs come with great benefits – including healthcare, parental leave, ways to save for the future, and opportunities for career advancement – all in a safe and inclusive environment that’s been ranked among the best workplaces in the world. Some offerings are dependent upon the role, work schedule, or location, and can include the following:\nCompetitive wage paid weekly, with overtime for more than 40 hours\nHealthcare (medical, dental, vision, prescription drugs)\nMedical Advice Line\nNetwork of Support (health & well-being on and off the job)\nAdoption Assistance\nMaternity and Parental Leave\n401(k) savings plan\nPaid Time Off (PTO)\nHoliday pay opportunities\nEmployee discounts\nBasic life insurance\nAD&D insurance\nCompany-paid Short-Term and Long-Term Disability\nOn-the-job training and skills development\nEmployee Assistance Program\nLearn more about Amazon Benefits and Culture\nhttps://hiring.amazon.com/why-amazon/benefits#/\nhttps://hiring.amazon.com/why-amazon/culture#/\nRequirements:\nCandidates must be 18 years or older with the ability to understand and adhere to all job requirement and safety guidelines\nHow To Get Started\nYou can begin by applying below. If you need help with your application or to learn more about our hiring process, you can find support here: https://hiring.amazon.com/hiring-process#/.\n\nAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://hiring.amazon.com/people-with-disabilities#/.\nPandoLogic. Keywords: Warehouse Worker, Location: Lawrenceville, GA - 30046 , PL: 519714247", "url": "https://www.indeed.com/viewjob?jk=9571b05e21eb653f&tk=1frerbohi3kjv000&from=serp&vjs=3&advn=2088923063441308&adid=381647839&ad=-6NYlbfkN0CRmbpHJshgKv92icAAbpOStPbkkxpQLXzHsgwxAsSE7nsGIt2VBaDJTVEsQlParbU_03_qEELgG4mwFNAnuJJCsKEsWHu1Z71q-DsW7OzmVt4fomYZfvVXH2XKaSiVO1eP5-zo3-LZsEA2lAm9pDnaFlwmA2JR6jxKwYulnZtlgXxQCQMh4zhQSvWk1ABZuMpOhHIpo_9ISngAqHJ3A54w33zIAHFbGgF44CxzC1QpQqLSa5ljktHGqIkp5qRwe33R4PYuLc0bqvE8rNK262KA6IM5jmT_QrOgOECtCjKrpV1TAJi9fSAg7VRh1Q7shHlS3ThtWOq1Ov0liL54pYDxQ7qhZT9wHYWGWzT8yY_cOzHknyvSZK4n&sjdu=1utx270kvVaFQOJfrHAaLR_MVJZzTFreNrRxyb_PkeD0nHKoaRc9W9p_BK4h1gaQ7Dn0Iu7a27g131mQaWID8JBoXH3xmqwcbdBeSHtT8eAnr85p5d5AukBSjCAA8PI5Pq7Zi7bjfyq3tdSxtR-jg9zuQIONoJIqeIMDlwXLZwdDtJi1rqmF_6xLmmZQ0ZL4nP_vNMO9DA9WHzOQd_QaiVta1SeUEnKV6EgyAj8vFMuoKOoNFprpPLxHuRAn5bvopYqTrxTC0DNx_uL1RVzGzWFmjlQeG5vIUV_InG7_ZJXqzqeKZH2ijXZRGirDsH6TW6Ra3BXM8FNgX1d2TcpZ-GjfTjdg9wbU3Wh1agtx-GM"},
{"job_title": "Team Member - Grand Reopening!", "summary": "Offer genuine friendly and enthusiastic service to our guests.\nEnsures food quality and 100% customer satisfaction.\nPaid Time Off (2 weeks for FT crew members).", "company": "Five Guys", "location": "Pembroke Pines, FL 33026", "job_description": "About usWe are Yukon Broward, a franchise group dba as Five Guys. As of Q1 of 2022, we successfully operate 9 locations all over Broward County and are building out 2 additional locations with an anticipated opening by Summer of '22. We are fast-paced, fun, customer-centric restaurant concept and are looking to add our team immediately. Our goal is continue providing our guests with exceptional food quality and customer service. A career with us will allow you to earn money while you learn, in addition to supporting your desire to seek additional growth opportunities; we believe in internal development!Do you enjoy working in a fast-paced (but fun!), clean, cook-to-order environment? Are you motivated by the opportunity to earn a weekly bonuses and tips? Then this is the job for you! Did we mention, we offer immediate hire?Our commitment to customer service, cleanliness & serving fresh, quality food is what really sets us apart from the rest. Above all else, our guests are the priority, we dictate their experience, and they pay us to be here!We love to keep it simple - the more you put in, the more you get out! Speaking of which, we offer benefits to everyone! Here's a few:We close daily at 10 PM, so you’ll never get stuck on a late-night or graveyard shift!No drive-thruClosed MAJOR holidays (Thanksgiving and Christmas Day)Weekly BonusesWHAT ARE WE LOOKING FOR?Positive, friendly, upbeat demeanorProficiency for teamworkHigh sense of urgencyHigh sense of integrityHigh standard of cleanlinessStrong communication skillsEnjoys working in a fast-paced environmentDesire for personal and professional growthRestaurant experience is not mandatory, but a smile as well as a positive attitude are!WHAT'S IN IT FOR YOU?Holiday Incentive (We are closed Thanksgiving & Christmas Day, but we pay time and a half on select holidays to show appreciation for our dedicated crew!)Obtainable WEEKLY bonuses + tips (based on service and store performance)Weekly paycheck - every Friday!Flexible schedules. We also make our schedules available online for easy access + you can request time off and/or pickup additional shifts!Room for advancement - we are always looking to promote from within.Paid Time Off (2 weeks for FT crew members)Medical Benefits (health, dental & vision)WHAT DO WE NEED FROM YOU?Offer genuine friendly and enthusiastic service to our guests.Receive and maintain fast and accurate service.Maintains restaurant with regards to cleanliness and customer accessibility.Ensures company standards on equipment, facility and grounds are maintained.Ensures food quality and 100% customer satisfaction.Works as a member of our team to support other crew members in their duties.Other duties as assigned by a member of our management team. We believe in teamwork, always!Job Types: Full-time, Part-timePay: Up to $16.00 per hourBenefits:Dental insuranceDisability insuranceFood providedHealth insurancePaid time offPaid trainingPet insuranceVision insuranceSchedule:Day shiftEvening shiftMonday to FridayNight shiftWeekend availabilitySupplemental Pay:Bonus payTipsShift availability:Day Shift (Required)Night Shift (Preferred)Work Location: One location", "url": "https://www.indeed.com/viewjob?cmp=Five-Guys&t=Team+Member&jk=9aeb84fec917ad54&vjs=3"},
{"job_title": "newWarehouse Worker- 6AM-2:30PM (Mid Shift B)", "summary": "$1000 Sign On Bonus.\nPay starting up to $21.60 per hour (Base of $17.50 + weekly attendance bonus + monthly production incentive).\nYou might be a great fit if….", "company": "FedEx Supply Chain", "location": "Hazleton, PA 18202+6 locations", "job_description": "$1000 Sign On Bonus\nPay starting up to $21.60 per hour (Base of $17.50 + weekly attendance bonus + monthly production incentive)\nClick HERE to schedule an on-site interview.\nGeneral Summary….\nThe Forklift Operator I is primarily responsible for safely operating basic powered material handling equipment (excluding the Order Picker, Turret and Drexel) for the purpose of product receipt, storage and order fulfillment. This position is responsible for product safety, quality and legality.\nThis position will be responsible for…..\nFull case order picking for replenishment, customer orders and packaging components.\nPallet retrieval and put away in narrow aisle bulk rack storage system.\nQuality control to ensure accuracy of all transactions.\nLoading and unloading of pallets and cases from trucks and conveyor lines, by hand or equipment.\nSorting and build product to pallets to ensure compliance to customer expectation.\nUse of machinery to apply shrink wrap to pallets.\nPerform a pre- and post-equipment checklist.\nMaintain accuracy of storage locations by performing daily cycle counts and routine inventory maintenance tasks.\nPerform other distribution work functions as needed due to business volume and need.\nYou might be a great fit if….\nEducation/Experience\nHigh school diploma or equivalent.\nAbility to operate powered basic material handling equipment, i.e. electric pallet jack, forklift, etc.\n6+ months previous forklift equipment experience strongly preferred, high reach equipment experience desired.\nAbility to work on equipment at extended heights.\nStrong sense of urgency, attention to detail and flexibility in meeting deadlines.\nExcellent verbal and written communication skills.\nCustomer service driven.\nStrong team player.\n\nPhysical/Cognitive Requirements\nWith or without accommodation:\nAbility to follow policies and procedures.\nAbility to read, write and interpret information.\nAbility to add, subtract, multiply and divide.\nAbility to use hands to finger, handle, or feel.\nAbility to sit/walk/stand for up to 10 hours per day.\nAbility to intermittently crawl, squat, climb, twist, bend, stoop, push or pull.\nMust possess visual acuity, i.e., close, distance, and color vision, depth perception and the ability to adjust focus.\nAbility to lift/carry items less than 60 pounds.\nADA – FedEx Supply Chain will make reasonable accommodations in compliance with the Americans with Disabilities Act of 1990. Reasonable accommodations are available for qualified individuals with disabilities throughout the subsequent application process.\nFed Ex Supply Chain is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, and other legally protected characteristics.\n\nJob ID: 40733\n\nSchedule: Full-time", "url": "https://www.indeed.com/viewjob?jk=c948f6f9f53ed05c&tk=1frer40p8t4m6800&from=serp&vjs=3&advn=4279618315281485&adid=380408404&ad=-6NYlbfkN0CtRhce1P3KYyt64vAZVRC-NCRoXhIqR30y-w5Uij6mKkgkB30gERqm_tlAw7KP5Gi0y-nKROeu4tBhKs6eeFcgjUnMffZhCWuT6NneTbsylL1GlRPlcPLeo0lV8OGNuReiHKTZJXeoWcFtVZ7fImpZqdJDI85wi6gaLzvPoCDg0n2bVVGeQvVSbVsC2xCwbHLtirwmkYNXROf4jeb02lgcWQEzuZWZIRPjag8wAsam918e9F2i_KRiY1Piv3xbHfrkIoKpSiV3gIsvdJVROHsXWsAILlfDJOnrpsLxzyVVtN3nYKhJrZl0iRW3msiymquo7znzk84ww7AfmCwimXJQDBeiWMoNNShZttEAD3y5vg==&sjdu=0ZFwD5rbjMRcHz87Kzx_g1EoQxBTFpETHFCUQUwsZF-40RVrVwZgDu7nPW9lV_1y0AMzuT5WElZ7cBSgH6xbrkiyPPbL-zyCL1tgycItICg"},
{"job_title": "Cashier-LAX", "summary": "Warm friendly immediate greet to guests at door.\nQuick service & fast food restaurant.\nState food handler’s or alcohol compliance cards.", "company": "Crews", "location": "Los Angeles, CA", "job_description": "1924 E Maple Ave. Unit B. El Segundo, CA 90245O 310.417.8616 F 310.417.8655 I N N O V A T I N G T H E T R A V E L E R S E X P E R I E N C E S I N C E 1 9 7 2 Position: CashierDepartment: Front of House OperationsReports To: General Manager or Manager on DutyClassification: Full Time/HourlyJob Summary: Warm friendly immediate greet to guests at door. Is also able to effectively process all transactions through the POS system quickly and accurately.Job Responsibilities: Primary duties and responsibilities include, but are not limited to, the following:Ability to communicate effectively with customers in order to provide the best customer service.Ability to work as a team member.Perform opening checklist duties.Process guests’ transactions through POS systemAssist with unit housekeeping.Make sure guests are greeted in a timely manner with a warm smile and proper words.Walk at pace of guest making eye contact and conversation.Listen for phone and answer using correct words. Always address guests in a positive manner.Sweep and clean front desk area regularly.Menus clean and organized in proper place. Make regular menu runs.Fill to go and merchandise orders if applicable following brand procedural checklists.Interact with guests in and as they leave restaurant in a warm, caring manner.Follow closing checklist and be checked out by manager before leaving.Skills and Competencies: Excellent communication skills.Basic mathematical skills.Basic reading and writing skills.Basic computer skills.1924 E Maple Ave. Unit B. El Segundo, CA 90245O 310.417.8616 F 310.417.8655 I N N O V A T I N G T H E T R A V E L E R S E X P E R I E N C E S I N C E 1 9 7 2 Ability to use a point of sale system by ringing items in, taking payment and making change.Organizational skills.Multi-task oriented.Knowledge of workplace safety procedures.State food handler’s or alcohol compliance cards.Must be able to work any shift (various hours-days off) and overtime as business dictates.Must be able to work weekends, evenings, and holidays .Other Skills and Physical Requirements: Must be able to freely access all areas of the store, including selling floor, stock area and register area.Must be able to lift, carry, push, pull and/or handle merchandise throughout the store weighing up to 35 lbs.Must be able to remain stationary, walk and/or stand for entire shift.Must be able to bend, kneel, climb, reach, and grasp.Frequent washing of hands following Health Department Guidelines.Must be able to operate and use all equipment necessary to safely perform all duties.The above statements are intended to describe the general nature and level of work being performed by the incumbent of this Cashier job. They are not intended to be an exhaustive list of all responsibilities and activities required of the position.I_________________________________ have read and understand the policy and procedures that is written, and I will abide by my job description.Signature: __________________________ Date: _______________Manager Signature: ___________________ Date: _______________Job Type: Full-timePay: From $17.50 per hourBenefits:401(k)Dental insuranceEmployee assistance programEmployee discountFood providedHealth insuranceLife insurancePaid time offReferral programVision insurancePhysical Setting:Fast casual restaurantQuick service & fast food restaurantSchedule:Day shiftEvening shiftHolidaysNight shiftWeekend availabilityCOVID-19 considerations:All Customers are required to wear a maskExperience:POS: 1 year (Required)Shift availability:Day Shift (Required)Night Shift (Required)Work Location: Multiple Locations", "url": "https://www.indeed.com/viewjob?cmp=crews&t=Cashier+Lax&jk=df77ded451454e5a&vjs=3"},
{"job_title": "newGeneral Labor", "summary": "Small manufacturer of concrete products.\nJob is very physically demanding.\nLocations in Livonia and Westland, with time split approximately 50/50 between the…", "company": "Livonia Pre Cast", "location": "Detroit, MI", "job_description": "Small manufacturer of concrete products. Job is very physically demanding. No experience required. Steel toed boots required. Locations in Livonia and Westland, with time split approximately 50/50 between the two locations.Job Type: Full-timePay: $16.00 per hourBenefits:401(k)401(k) matchingDental insuranceHealth insurancePaid time offSchedule:8 hour shiftMonday to FridayWork Location: Multiple Locations", "url": "https://www.indeed.com/viewjob?jk=5acac96670daab4e&q=Labor&l=USA&from=web&advn=2600074261263513&adid=383634488&ad=-6NYlbfkN0C7f3JHmCEpIh-r5-BmtKnsynIrXeIKWPpKTKFB5Qaqq7DG4Figcw8BtiN6W4NHZzq8o1swub4xnoRcopv0vVP_m-4ShnZZt-r7lSxd5UfCAZmCJ8xkxcTOiEp5jf_9aebApYoJHb_n1aQ9mi_qQawChs7mls7itE2EsQ_MtusHTj_q3dY-dkqdI9Flz0bmVSG1nmk3_oVv1qlCFOk47pyqJQwagZXxKtBNYMLRTFZltk_DaxF5kWzAJv0EuT1fGOx4rMJiGwMarBCK2tPwbQ8Lyj2KPTpc3yu6laEoeWzwNo2MmCfOkR1JceTVraxnOZvX9dkigRvikYPhkSQY0WMMAHlDxAni3XSYQ3JNJcfHtpPiaBwkZGMu&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "newDietary Staff", "summary": "Ancillary policies including AD&D, STD, Cardiac, Cancer, Critical Illness, Hospital Confinement.\nWhole and Term Life Insurance.", "company": "Greenbrier Nursing & Rehabilitation Center of...", "location": "Palestine, TX 75803+10 locations", "job_description": "Greenbrier Nursing & Rehabilitation Center of Palestine is currently hiring Full-Time Dietary Cooks & Dietary Aides!We offer the following outstanding benefits:Health/Dental/Vision InsuranceAncillary policies including AD&D, STD, Cardiac, Cancer, Critical Illness, Hospital ConfinementWhole and Term Life InsuranceTuition ReimbursementPaid Time OffImmediate 401(k)Unparalleled Corporate Support Hiring managers are conducting immediate interviews, so stop in today for a tour!Grab your resume, refer a friend, and apply today!Our company is an Equal Opportunity Employer (EOE).Job Type: Full-timeBenefits:401(k)401(k) matchingDental insuranceDisability insuranceHealth insuranceLife insurancePaid time offTuition reimbursementVision insuranceSchedule:Day shiftWork Location: One location", "url": "https://www.indeed.com/viewjob?cmp=Spanish-Trail-ALF&t=Dietary+Staff&jk=2b089deae1684ee3&vjs=3"},
{"job_title": "Host/ess", "summary": "Minimum one year food & beverage service or related work.\nThe hospitality business functions seven (7) days a week, twenty-four (24) hours a day and scheduled…", "company": "Four Seasons", "location": "Maui, HI+23 locations", "job_description": "DUO PM Host/ess\nStatus: Casual\nHourly Wage: $24.22/hr\nLocation: Four Seasons Resort Maui at Wailea, HI\nJoin the team of dedicated employees at Four Seasons Resort Maui at Wailea, named one of Fortune magazine's \"Best Companies to Work For\" and winner of Forbes Five Star and AAA Five Diamond awards.\nWe are looking for a Host/ess who is passionate in providing only the highest levels of customer service. This position reports to our DUO Management Team. Work authorization for this location is required.\nResponsibilities\nGreet and seat guests while coordinating guest reservations and responding to inquiries in an efficient, courteous and professional manner to achieve maximum customer satisfaction while complying with all Four Seasons’ policies.\nKnowledge and Skills\nEducation:\nHigh School education or equivalent experience.\nExperience:\nMinimum one year food & beverage service or related work.\nSkills & Abilities:\nRequires a working knowledge of the restaurant aspect of Four Seasons services, policies or operations and general knowledge of the hotel. Working knowledge is generally learned on-the-job. Requires knowledge or the ability to operate computer equipment and the reservations system. Requires reading, writing and oral proficiency in the English language.\nKey Competencies:\nConsistently demonstrates the following employee behaviours to:\n“Start with The Heart” by being caring and compassionate, aware and present and recognizing confidently\n“Master Your Craft” by constantly learning, delivering with passion and being a brave problem solver\n“Be You” by being genuinely yourself, honest and reliable and a committed team player\nLicenses or Certificates:\nTuberculosis Clearance\nHours Required\nThe hospitality business functions seven (7) days a week, twenty-four (24) hours a day and scheduled days and times may vary based on need.\nWhat to Expect\nBe part of a cohesive team with opportunities to build a successful career with global potential\nLearn more about what it is like to work at Four Seasons – visit us:\nhttp://jobs.fourseasons.com/\nhttps://www.linkedin.com/company/four-seasons-hotels-and-resorts\nhttps://www.facebook.com/FourSeasonsJobs\nhttps://twitter.com/FourSeasonsJobs\nFour Seasons is an Equal Opportunity, Affirmative Action employer. Minorities, women, veterans, and individuals with disabilities are encouraged to apply. To access the 'EEOC is The Law' Information poster please visit this website - http://www.eeoc.gov/employers/upload/poster_screen_reader_optimized.pdf", "url": "https://www.indeed.com/viewjob?jk=b73dafb2d97b5528&from=serp&vjs=3"},
{"job_title": "Host", "summary": "Our ideal candidate will be hospitality focused with a strong background in service.\nGenerous Paid Leave Policy for hourly employees.", "company": "Little Pearl", "location": "Washington, DC 20003 (Capitol Hill area)", "job_description": "Rose’s Restaurant Group (by James Beard Award winning Chef Aaron Silverman) is currently looking for a part-time Host at Little Pearl, our newest Michelin-starred restaurant.\n\nWe offer a creative six course price fix menu with optional wine pairings to match. We are seeking someone who is interested in joining our team for evening service.\n\nSome things to know about us:\n\nOur mission is “To make this the most enjoyable restaurant to work in and the most enjoyable restaurant to dine in.” This is the reason we are here. This is why we do what we do.\n\nWe are big on communication and organization. We believe these are huge keys to success. And the better we are able to communicate and organize ourselves, the more success we will have.\n\nWe are big on teaching and growth. We work hard to make sure everyone is constantly growing and learning. We want everyone who works with us to become a better cook, barista, chef, manager and most importantly, leader.\n\nWe like having fun. While we take our jobs very seriously, we also do so lightheartedly. In other words, we love to hustle and get better everyday but we also love to do it while laughing and having fun at the same time. (And yes, that is possible).\n\nSome of the benefits we offer:\n\nWages starting at $20/hour for non-tipped staff\nGenerous Paid Leave Policy for hourly employees\nParental Leave Plan\nComplimentary gym membership\nEmployee Assistance Program (covers mental health services, legal services, and additional support)\nWMATA SmartBenefits program\nMost major holidays off\nUnlimited (air) high fives!\n\nWho we are looking for:\n\nOur ideal candidate will be hospitality focused with a strong background in service. They will be dependable, motivated to learn, committed to working as a team member, possess excellent communication skills, and will be willing and able to provide our guests with authentically warm service each night.\n\nIf you have the background we are looking for and love making people happy, we’d like to hear from you. Please apply with your resume and a cover letter letting us know why you'd be a good fit.\nMore detail about Little Pearl part of Rose's Restaurant Group", "url": "https://www.indeed.com/viewjob?jk=7d84942dc776a989&from=serp&vjs=3"},
{"job_title": "Team Member", "summary": "Providing excellent guest service while executing operation and service standards at the highest level.\nGood interpersonal skills, including professionalism in…", "company": "Yogurtland", "location": "Fresno, CA 93722 (Bullard area)+2 locations", "job_description": "Providing excellent guest service while executing operation and service standards at the highest level. We seek individuals who can maintain a professional attitude while providing great service to our guests.Knowledge/Skills:Positive attitude, Positive attitude, friendly and upbeat personality. Good interpersonal skills, including professionalism in dealing with team members and the public. Able to manage and perform multiple tasks. Able to work effectively within and contribute to a team environment. Able to exercise sound judgment. Able to read, write, and communicate effectively. Able to perform and understand simple mathematical calculations. Computer skills required.Job Type: Part-timePay: $15.00 - $16.00 per hourPhysical Setting:Fast casual restaurantSchedule:Monday to FridayWeekend availabilityWork Location: One location", "url": "https://www.indeed.com/viewjob?cmp=Yogurtland&t=Team+Member&jk=e0ba75f0da3492a8&vjs=3"},
{"job_title": "newNutrition Resource Aide I", "summary": "Schedule: Full Time, Varied Shifts, 8 hours.", "company": "Madera Community Hospital", "location": "Madera, CA 93637", "job_description": "Location: Madera Community Hospital · Nutrition Resources\nSchedule: Full Time, Varied Shifts, 8 hours", "url": "https://www.indeed.com/viewjob?jk=12343bb9d0e76e57&from=serp&vjs=3"},
{"job_title": "Food Truck Worker", "summary": "Quick service & fast food restaurant.\nDaily set up, stocking and prep.\nEnd of day cleaning procedures.\nJob Types: Full-time, Part-time.", "company": "Colombo's Smoothies", "location": "St John, VI 00830", "job_description": "We are looking for a new employee to join our team at Colombo's!Duties include :-Greeting customers-Taking orders-Operating POS system-Making smoothies, smoothie bowls, coffee drinks-Daily set up, stocking and prep-End of day cleaning proceduresJob Types: Full-time, Part-timePay: $18.00 per hourPhysical Setting:Quick service & fast food restaurantSchedule:8 hour shiftSupplemental Pay:TipsWork Location: One location", "url": "https://www.indeed.com/viewjob?cmp=Colombo%27s-Smoothies&t=Food+Truck+Worker&jk=80b838278cbad6ca&vjs=3"},
{"job_title": "Greeter/Host/Hostess", "summary": "Compensation commensurate with experience ($38-$40/hour).\nMedical/dental benefits are available after an introductory period.\nJob Types: Full-time, Part-time.", "company": "Houston's Restaurant", "location": "Irvine, CA 92612 (San Joaquin Marsh area)+3 locations", "job_description": "Houston's Restaurant in Irvine, is currently seeking Maître d’ / Greeter candidates to join our successful team.Energy, poise, and an elevated sense of personal style are important.Upscale restaurant experience can be a plus, but these roles are open to candidates from all backgrounds.Compensation commensurate with experience ($38-$40/hour)Medical/dental benefits are available after an introductory period.Part-time and full-time positions available. Some weekend availability is required.To learn more, visit us at www.hillstone.com, or read this profile in Bon Appetit magazine: http://www.hillstone.com/press/bonappetitWe look forward to meeting you soon!Job Types: Full-time, Part-timePay: $38.00 - $40.00 per hourBenefits:Dental insuranceEmployee discountHealth insuranceSchedule:Day shiftMonday to FridayNight shiftWeekend availabilitySupplemental Pay:TipsExperience:Restaurant Experience: 1 year (Preferred)Work Location:One locationWork Remotely:NoWork Location: One location", "url": "https://www.indeed.com/viewjob?jk=ef8d194b8056c915&q=Food&l=USA&from=web&advn=8937939063231664&adid=374559416&ad=-6NYlbfkN0Dag-ruDzQiO6xfc8MhbXPWdPRu4c57jH9p22WyH1KcnRihu4vsv5Z3cz8goJVTK75WiuLo-Tf97RSpfSmCh5mCs1q4ArK6MwS8pEqHUnNHNxCnibTkUmn2NLgAB6_g2A8_RJSdHtVIH7cnmwafKH0QZKFMCTgGQR4QF8Xh1WXVVXLexW_RVCCKmSs_IvV4jD6_c63kfjzfHcaWQtSRbfCLRdLZinmgqieR0us4CNDuHuFPm7k6-NPvSEP1pVzaYAJZWwpCrvo1Q0P-ZPlDVczZN6TtefxDYh53QuNXL8KzgMfpe9UEZNqki5MCeTqOh7gU_uuFgsZbOCX4LJl0-2193jlIcuFRSDJqqeH-DqoWX2E8qm7wNQ38ZHneTiFchoQ%3D&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "newHost / Hostess - Starting at 19.00 per/hr", "summary": "Greet guests as soon as they walk through the door in a friendly and professional manner, seat guests, and communicate accordingly with the other service staff.", "company": "Desert Mountain Club", "location": "Scottsdale, AZ 85262 (Pinnacle Peak area)", "job_description": "Join the Food & Beverage team at one of the largest and most beautiful private country clubs in North America, Desert Mountain Club, as a Host / Hostess!\n\nIn this role, you are responsible for creating an excellent first impression. Greet guests as soon as they walk through the door in a friendly and professional manner, seat guests, and communicate accordingly with the other service staff.\n\nThe ideal candidate will bring great energy, teamwork, and a passion for delivering exceptional guest experiences. Prior restaurant experience is preferred.\n\nLIFE ON THE MOUNTAIN\n\nJoin a top 15, 5-Star Platinum Club of America and be a part of an exciting, challenging, and rewarding experience PLUS enjoy excellent benefits:\n\nCompetitive pay\nMedical, dental and vision coverage\nFREE onsite medical clinic to all employees & their dependents\nFREE employee meals during shifts\nFREE golf and tennis\nPaid Time Off\nMatching 401K\nTuition reimbursement\nRetail discounts\nPet insurance\nEmployee uniforms provided\n\nPlease note, benefits are dependent on your DOL Status (ex. Full-Time, Part-Time, Seasonal).\n\nWe believe our teammates are our greatest asset and are committed to fostering a culture of care, respect, and positivity with a sincere focus on the safety, health, and professional growth of every teammate. If you’re looking to join an incredible team, then Desert Mountain is the place for you!\n\nJOB DETAILS\nResponsibilities:\nGreet members and guests entering and leaving the restaurant with a warm welcome, name recognition, and a fond farewell.\nSeat guests. Responsible for fair rotation of cover counts.\nMaintain cleanliness of menus and host stand area and ensure all menus and wine lists are current.\nCommunicate special requests i.e. birthdays, anniversaries, and allergies.\nOther duties as assigned by management.\nPhysical Requirements & Working Conditions:\nRequired to work days, nights, weekends, and holidays.\nRequired to stand for long periods of time.\nOUR COMPANY\n\nDesert Mountain Club is one of the finest private residential communities in the world featuring world-class golf, indulgent amenities, and curated experiences. It is a private country club open to on and offsite property residents located in the elevated foothills of the beautiful Sonoran Desert in North Scottsdale, Arizona. The club spans across 8,000 acres featuring:\n\nSeven signature golf courses (six of which are Jack Nicklaus & an all new par 54 championship course)\nSeven distinctive clubhouses – each with its own unique restaurant plus banquets\nAn award-winning spa and fitness center\nSpectacular swim and tennis facility\nDozens of hiking and biking trails\nHorseback riding\nLuxury camping at The Ranch\n\nOur mission is that we will provide our members and teammates with an exceptional experience consistent with our vision to be the finest club and community for golf and recreational lifestyle activities in North America.\nDesert Mountain is proud to be an Equal Opportunity Employer and is committed to providing an environment of mutual respect. We do not discriminate or tolerate discrimination against any employee or applicant based upon race, color, national origin, religion, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, physical or mental disability, military and veteran status, genetic information, or any other characteristic protected by applicable law.", "url": "https://www.indeed.com/viewjob?jk=e614f60d7c6c4947&from=serp&vjs=3"},
{"job_title": "Food Services - Cashier", "summary": "The Cashier receives and disburses money for payment of goods purchased in the cafeteria and assists customers as needed.\nHigh School Diploma or GED.", "company": "Tanner Health System", "location": "Carrollton, GA 30117+4 locations", "job_description": "The Cashier receives and disburses money for payment of goods purchased in the cafeteria and assists customers as needed. The Cashier will assist in department sanitation and closing procedures.\n\nEducation\n\nHigh School Diploma or GED\n\n\nExperience\n\nThree months of related experience\n\n\nQualifications\nFood service experience preferred, but not necessary.\nMature, responsible, neat, clean in appearance, and have good personal hygiene.\nMust be able to read and write to the degree of counting for inventory, cash register operation, and cash handling and stocking purposes.", "url": "https://www.indeed.com/viewjob?jk=3474010a42b11fa4&from=serp&vjs=3"},
{"job_title": "newTeam Member", "summary": "Ability to take and prepare food orders.\nJob advancement potential for qualified and determined candidates.\nMaintain a clean, safe, and sanitary environment for…", "company": "Popeyes Louisiana Kitchen | Supreme Foods", "location": "Paragould, AR 72450+7 locations", "job_description": "SUPREME CAJUN FOODS, a growth oriented Popeyes Louisiana Kitchen franchisee, is now hiring friendly, smiling energetic full-time and part-time Team Members at one of our Popeyes Louisiana Kitchen restaurants.\nPosition offers:\nJob advancement potential for qualified and determined candidates\nTeam Member duties and responsibilities:\nWork as a team with Restaurant General Manager, Hourly Shift Manager, and other Team Members to provide a great restaurant guest experience\nMaintain desired restaurant outcomes:\nSales\nCustomer experience\nEnvironment of Service\nGreet customers\nTake customer orders\nExpedite Food Orders\nMaintain a clean, safe, and sanitary environment for guests\nHandle cash accurately\nJob requirements for the Team Member:\nAbility to follow written and oral instructions and procedures\nAbility to receive and count cash and give correct change\nAbility to interact with customers in a courteous manner\nAbility to take and prepare food orders\nAvailability to work 15 29 hours a week\nLifting and carrying 30 lbs.\nAbility to operate timers and cash register key pads\nInteract with:\nTeam Members\nHourly Shift Coordinators\nDistrict Managers\nJob Type: Full-time and Part-time\n\nBrand: Popeyes Louisiana Kitchen\n\nAddress: 2001 W. Kingshighway Paragould, AR - 72450\n\nProperty Description: PLK13321\n\nProperty Number: 13321", "url": "https://www.indeed.com/viewjob?jk=88bf4c1d7e6a2732&from=serp&vjs=3"},
{"job_title": "Food Service Worker II", "summary": "Tracks food inventories, and receiving and issuing food and supplies.\nEnsures proper food presentation, quality, portion control and maintenance of appropriate…", "company": "Texas House of Representatives", "location": "Austin, TX 78701 (Downtown area)", "job_description": "TEXAS HOUSE OF REPRESENTATIVES FOOD SERVICE WORKER II SUMMARY: Provides refined food preparation and dining service. Assists with planning and hosting House special events. Ensures equipment and work areas are maintained in a clean and sanitary manner. Provides exemplary guest services through all forms of food service. All work performed under the direct supervision of the House Special Services Department Manager.ESSENTIAL JOB DUTIES:Assists with high quality food preparation as requested by the Special Services Manager.Develop and implement modified menus to accommodate dietary restrictions or preferences.Ensures proper food presentation, quality, portion control and maintenance of appropriate serving temperatures.Provides water, coffee and tea service for 2nd floor activities.Serves and monitors the distribution of meals, and ensures that guidelines for special diets are followed.Prepares creative menus and food items (fine foods, pastries & hors d'oeuvres) for special events and holidays.Arranges dining areas for the serving of seated meals and/or serving lines.Successfully executes the set up, hosting and break down of dining areas for special events.Sanitation and cleaning of House dining and kitchen facilities; ensures equipment and work areas are maintained in a clean and sanitary manner.Assists with inspecting grocery items on arrival for quantity, quality, and temperature conditions.Tracks food inventories, and receiving and issuing food and supplies.Daily duties may involve cleaning of House facilities including lavatories.Performs other duties as assigned.EDUCATION & EXPERIENCE: Graduation from a standard senior high school or equivalent is preferred. Experience and education may be substituted for one another. Advanced experience and skill in food service, fine dining, or catering is preferred.KNOWLEDGE, SKILLS & ABILITIES: Knowledge of and skill in food preparation methods, food storage, & preservation.Ability to read, scale, and prepare a recipe. Ability to keep the dining, service and food preparation areas maintained.Knowledgeable in kitchen equipment sanitation practices and maintenance. Ability to report defective equipment for repair. Ability to assist supervisor with scheduling and completing special projects. Knowledge of event planning and catering practices. Ability to communicate effectively and professionally with members, staff and the general public. Must be able to work in fast-paced and rapidly changing environment. Must be able to meet strict deadlines. Must have flexibility to work extended hours and weekends as required. Must adhere to department dress code and demonstrate the ability to follow all policies and procedures as set forth in thePersonnel Manual.GENERAL SALARY INFORMATION:SALARY RANGE: $4,571.00 per monthOPENING DATE: December 16, 2021CLOSING DATE: Until FilledAPPLY TO: Texas House of RepresentativesTo be considered an applicant for this position, you must complete a Texas House of Representatives application. Applications may be found at: https://house.texas.gov/resources/employment/.Mail employment application(s) and resume(s) to:Texas House of RepresentativesPayroll/ Personnel DepartmentPO Box 2910Austin, Texas 78768Please Note: Only applicants scheduled for an interview will be contacted. The Texas House of Representatives is an Equal Opportunity Employer and does not discriminate on the basis of race, color, national origin, sex, religion, age or disability in employment or the provisions of services. In compliance with the Americans with Disabilities Act, if you require reasonable accommodations during the application process, please call (512) 463-0865.Job Type: Full-timePay: $4,571.00 per monthBenefits:401(k)Dental insuranceDisability insuranceEmployee assistance programEmployee discountFlexible spending accountHealth insuranceLife insurancePaid sick timePaid time offRetirement planVision insuranceSchedule:8 hour shiftDay shiftHolidaysMonday to FridayNight shiftWeekend availabilityWork Location: One location", "url": "https://www.indeed.com/viewjob?cmp=Texas-House-of-Representatives&t=Food+Service+Worker&jk=f2c22ec0d372be93&vjs=3"},
{"job_title": "newFloat Cook (Part-Time)", "summary": "Pursues and participates in global partnerships that provide CTECS students with international exposure and experience.", "company": "State of Connecticut - State Department of...", "location": "Bridgeport, CT", "job_description": "Are you a Culinary Professional? Do you enjoy making nutritious and delicious meals for students? If so, read below & apply today!\n\nThe State of Connecticut, Department of Education (SDE), is now accepting applications for a part-time (32.5 hours per week) Float Cook role located at Henry Abbott Technical High School in Danbury, CT.\nIt is Connecticut Technical Education and Career System (CTECS) mission to provide a world-class, unique, and rigorous learning environment for high school students and adult learners that:\nEnsures both student academic success and career technical education mastery, as well as promotes enthusiasm for lifelong learning.\nPrepares students for post-secondary education, including apprenticeships and immediate productive employment.\nEngages regional, state, national and international employers and industries in a vibrant collaboration to respond to current, emerging and changing global workforce needs and expectations.\nPursues and participates in global partnerships that provide CTECS students with international exposure and experience.\nThe Role & Schedule: CTECS serves approximately 11,200 full-time high school students. You will work in the school cafeteria in a high school environment, Monday-Friday from 7:00 a.m. to 1:30 p.m. Note: This is a 10-month opportunity. You will be assigned as necessary to regional alternate sites (Milford, Stamford, Bridgeport). Please be sure to select all the locations listed on this job posting, failure to do so may result in not being considered for this role.\n\nBenefits: We participate in a competitive benefits package that includes comprehensive healthcare policies including medical and dental coverage, retirement plan options, paid time off, and more! We also encourage a healthy work-life balance for all employees and provide professional growth and development opportunities!\nWatch the video below to see what it's like to be a State of CT employee!\n\n\nSelection Plan\nAll state employees shall follow Executive Order 13G (as amended by Executive Order 14C).\n\nTo Apply:\n\nIn order to be considered for this job opening meet the Minimum Qualifications as listed on the job opening. You must specify your qualifications on your application. The minimum experience and training requirements must be met by the close date on the job opening, unless otherwise specified.\nEnsure that your application is complete and detailed before submitting it. In order to comply with Public Act 21-69, the State of Connecticut is no longer asking for resumes during the initial application process. You will not be able to make revisions once your application is submitted into the JobAps system.\nPlease select all location(s) and shift(s) you are willing to work on your application. Failure to do so may result in not being considered for vacancies in that specific location.\nImportant Information After You Apply:\nThis posting may require completion of additional referral questions (RQs). You can access these RQs via an email that will be sent to you after the posting's closing date or by visiting your JobAps Personal Status Board (Certification Questionnaires section). Your responses to these RQs must be submitted by the question's expiration date. Please regularly check your email and JobAps Personal Status Board for notifications. Please check your SPAM and/or Junk folders on a daily basis in the event an email provider places auto-notification emails in a user's spam.\nNote: At any point during the recruitment process, applicants may be required to submit additional documentation which support their qualification(s) for this position. These documents may include: a cover letter, resume, transcripts, diplomas, performance reviews, attendance records, supervisory references, licensure, etc., at the discretion of the hiring agency. Applicants must meet the minimum qualifications as indicated to apply for this position.\nInterviews will be limited to candidates whose experience and training most closely meet the requirements of the position. The immediate vacancy is listed above, however, applications to this recruitment may be used for future vacancies in this job class.\nConnect With Us:\nDue to the large volume of applications received, we are unable to provide confirmation of receipt or status during the recruitment process. Updates will be available through your JobAps portal account.\nShould you have any questions about this recruitment please contact faith.macdonald@ct.gov.\n\nPURPOSE OF JOB CLASS (NATURE OF WORK)\nThis class is accountable for independently performing a full range of tasks involved in preparing and cooking food.\nEXAMPLES OF DUTIES\nPrepares and cooks a wide variety of foods including special diets; operates various types of cooking equipment such as stoves, ovens, steam cookers, mixing machines, choppers, etc.; cleans kitchen areas and equipment; rotates stock on a regular basis; assists with the ordering of food and supplies; inspects food received; may serve food or assist in serving; may prepare production records; performs related duties as required.\nKNOWLEDGE, SKILL AND ABILITY\nKnowledge of and ability to apply cooking principles and techniques on a quantity basis; knowledge of liquid and dry weights and measures; some knowledge of health and safety requirements in food service; some interpersonal skills; some oral and written communication skills; some ability to utilize computer software; some ability in menu preparation and record keeping; some mathematical ability.\nMINIMUM QUALIFICATIONS - GENERAL EXPERIENCE\nTwo (2) years of experience in the preparation of food on a quantity basis.\nMINIMUM QUALIFICATIONS - SUBSTITUTIONS ALLOWED\nSuccessful completion of a cook training course under the auspices of State or Federal Apprentice Training Bureaus may be substituted for one (1) year of the General Experience.\nPREFERRED QUALIFICATIONS\nExperience following a standardized recipe and completing required production records.\nPossession of or ability to acquire a ServSafe certification or other comparable certification.\nExperience using commercial kitchen equipment such as convection ovens, steamers, tilt skillets, and dish machines.\nPHYSICAL REQUIREMENTS\nIncumbents in this class must have adequate physical strength, stamina, physical agility and visual and auditory acuity, and must maintain such physical fitness as to be able to perform the duties.\nIncumbents must be free from communicable diseases\nA physical examination may be required.\nWORKING CONDITIONS\nIncumbents in this class may be required to lift moderate to heavy weights; may be exposed to risk of injury from equipment and utensils used in the kitchen and from individuals.", "url": "https://www.indeed.com/viewjob?jk=ba102003ad3f2ebb&from=serp&vjs=3"},
{"job_title": "Fast Food Cashier/kitchen helper", "summary": "Customer service/ prep food /cleaning.", "company": "Thai max", "location": "Bronx, NY 10475 (Country Club area)", "job_description": "Customer service/ prep food /cleaning. Able to work 4pm to 9Job Type: Part-timePay: $15.00 per hourSchedule:HolidaysMonday to FridayNight shiftWeekend availabilityWork Location: One location", "url": "https://www.indeed.com/viewjob?cmp=Thai-Max&t=Fast+Food+Cashier+Kitchen+Helper&jk=cbe66f308ed17e64&vjs=3"},
{"job_title": "Dishwasher", "summary": "Come to work properly dressed according to the dress code.\nKnowledge of HACCP practices for handling dishware and food deliveries.", "company": "us issworld", "location": "San Francisco, CA 94104 (Financial District area)+10 locations", "job_description": "Dishwasher\n\nHourly Wage\nISS offers a competitive compensation package including Benefits, Paid Time Off, and a starting hourly salary of 19.00 USD\n\nKey Purpose\n\nWash pots and pans, wash dishes, maintain floors.\nAssist with general cleaning and sanitation as assigned.\nMaintain storage areas and equipment as assigned.\n\nSuccess Criteria\n\nPassion for customer service\nPositive attitude\nDependable\nAbility to communicate effectively and work within a team environment\n\nKey Areas of Collaboration and Influence\n\nWork with catering to deliver food and assist with the setup of events\nWork well under time restraints\nRealize the importance of a team working environment\nCommitment to the service values and ethics of the client managers\nAbility to understand and follow direction from chefs and managers\nSupporting the Chef and culinary team when needed\nSupporting dish room operators as needed\n\nIdeal Candidate Experience\n\nKnowledge of HACCP practices for handling dishware and food deliveries\nPassion of customer service\nA positive attitude\nAccountability and dependable in all that you do\nAbility to communicate with teammates\n\nKey Accountabilities\n\nSetup pot sink correctly according to HACCP practices and wash pots and pans as required, putting them away as them as directed\nClean or sanitize work areas, utensils, or equipment\nSweep and mop floors in the kitchen and service areas as required\nRemove garbage as directed in a safe manner\nPerforms other duties as assigned\nMust follow all safety rules and actively prevent accidents\n\nPhysical Demands & Work Environment\n\nWork up to 8 hours a day on your feet, excluding breaks\nMust be able to lift a minimum of 25lbs\nCome to work properly dressed according to the dress code\nEmployee must be able to work under pressure and time deadlines during peak periods\n\nAs a global organization, ISS Group is committed to making the international community more resilient and just for all people. We encourage diversity and inclusion in their broadest terms, including ethnicity, race, age, gender, gender identity, disability, sexual orientation, religious beliefs, language, culture, and educational background. We look to lead our industry by example and to positively influence the market wherever we operate.\nDate posted: Jan 27, 2022\nRegion: Americas\nLocation:\nSAN FRANCISCO, CA, US, 94104-2804\nJob Category: Food Services\nFull time/Part time: Full Time\nRequisition ID: 3202", "url": "https://www.indeed.com/viewjob?jk=36e33dffdc4b62ee&from=serp&vjs=3"},
{"job_title": "newCondo Cleaner- Sapphire", "summary": "We are offering industry-leading competitive pay and full benefits package.\nSign-On and Refer-a-Friend Bonus potential.", "company": "MasterCorp Inc.", "location": "Sapphire, NC 28774+2 locations", "job_description": "Overview: Kick-off your hospitality career with MasterCorp, the industry leader in housekeeping and hospitality services! Join an amazing team of hard-working, passionate individuals. We are offering industry-leading competitive pay and full benefits package.Don’t miss out. APPLY TODAY!***WHAT WE OFFER YOU*Potential to make more than $17.00 per hour – Our system is designed to reward your efficiency and timeliness!Sign-On and Refer-a-Friend Bonus potentialImmediate hire – Full-time and part-time positions availablePaid trainingFull benefits package including: Paid Time Off, Medical, Holiday Pay, Vision and Dental (after 6 months of employment)Opportunities for growth and career developmentWHAT WE’RE LOOKING FORFriendly, enthusiastic, hard-working individuals with a passion for hospitality and for providing excellent service to help guests feel safe and cared for while on vacation.***ABOUT US*Family-owned and operated business with over 40 years in business. MasterCorp provides turnkey services for housekeeping, engineering, floor care, and laundry to most major hospitality brands and commercial clients. From recruiting to training and managing operational execution, we take care of all our client’s needs while representing their brand to the highest quality standards.Our people are our most valuable asset and our most significant source of pride. We provide the tools, training, and opportunities to help transform your career and our client’s guest experience.Qualifications:Must be available to work a flexible schedule, including weekends and holidays.Able to lift 25 pounds (with or without accommodation).Previous experience a plus, but not required.Essential Functions: WHAT YOU’LL DOAs a Housekeeper, you help shape the guest experience.Clean resort units following our proprietary 7 Step Process.Maintain high-quality standards of cleaning and appearance for resort units.Report to work as scheduled, in proper uniform, and following company appearance standards.Ensure equipment and work area are kept clean and in good condition.Consistently maintain a positive, friendly, helpful attitude that ensures a positive guest experience.Comply with safety regulations and procedures.Join the MasterCorp family and take the first step to your new hospitality career!Location: 3700 Hwy. 64 W, Sapphire, NC 28774Location: 3700 Hwy. 64 W, Sapphire, NC 28774Job Type: Full-timePay: $17.00 per hourBenefits:401(k)Dental insuranceHealth insurancePaid time offVision insuranceSchedule:8 hour shiftWeekend availabilityWork Location: One location", "url": "https://www.indeed.com/viewjob?jk=b83806121c34bf99&q=Labor&l=USA&from=web&advn=6298307535040518&adid=383610922&ad=-6NYlbfkN0A2QFmik0Rb9EA9nKNGDXtznjd4yL42f2IE-KtXLCGWpPe0TpYlHn0gDhVAChUL-Tt0DNQRZAEFBHOgxY3YH_Qs3fil6NVkAKhctLjDNYE1HxadYBiv5JWD3vaB1NPX74PXxXHI9ntM_qqw2Ek7Oz6KA5rq4nLAnRXwZ588-_ouffT1AhpaOo6ZTEH-i18Dypaq4SIYjnyIGR2kdQg6o8JKZkYXON9btHOtBO1bi2pFlTPE97nhiVwigU0ApAcWAyzAy8bZm8KCu6nMrECTVHcpUIFWAw7V5LA2tB0ltepTlrAQcxpYHdCfiiQH0sDdn6JM84_gNH7-_NgNyMrGf2OhBiFOJpOn3X3yYeJvEtfZ4B857NrmgSId&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "newDishwasher (Beverly Center)", "summary": "The Dishwasher is responsible for the washing and sanitation of all flatware, glassware, and china being brought back to the dish pit, for maintaining the dish…", "company": "Tocaya Modern Mexican", "location": "Los Angeles, CA 90048 (Mid City West area)+6 locations", "job_description": "We are looking for future leaders who are ready to grow with our brand!At Tocaya we use bold flavors and the best ingredients to proudly create our signature \"Modern Mexican\" cuisine. Our versatile menu is rooted in traditional Mexican recipes and naturally accommodates a variety of preferences including vegan, vegetarian, and gluten-free.Our methods and flavor-focused menu inspire a growing group of loyal guests who join us multiple times a week, eager to introduce the Tocaya experience to their friends as well.The Dishwasher is responsible for the washing and sanitation of all flatware, glassware, and china being brought back to the dish pit, for maintaining the dish washing area to meet department of health standards, removing trash, and keeping all exterior trash areas clean.This person will be working closely with the Executive Chef, Prep and Line cooks and all front of house employees to ensure all dishes are properly washed, sanitized, and returned to service.Setting the tone: Successful dishwashers know the importance of working in a team with positivity and \"leaving our baggage at the door.\"They maintain a positive and professional approach with coworkers and customersCommunicates well with others and is a great team playerSkill: Keeps work areas, food storage areas, and garbage area clean and safe at all times.Assists in control of inventory and supplies, by not breaking dishes and handing all items properly.Assumes 100% responsibility for quality of products served.Reading and following department of health standards and food industry standards.Perform all other duties as required, including prep work or additional tasks as needed.QUALIFICATIONS / REQUIREMENTSQualifications: Must be available on weekends and for evening shiftsAvailable to work nights, weekends, and holidays as neededDetail oriented and able to maintain a high standard of cleanlinessFollows instructions thoroughlyKnowledge of the industry and relevant health and safety regulationsCurrent Food Handlers cardAccuracy and speed in executing assigned tasksAbility to maintain a clean stationRequirements: Must be able to lift up to 50 lbs, and frequently lift and bend from the waist.Must be able to stand for long periods.This position requires frequent use of hands and arms in repetitive motions.Job Types: Full-time, Part-timePay: Up to $20.00 per hourBenefits:Dental insuranceEmployee discountHealth insuranceLife insuranceReferral programVision insurancePhysical Setting:Casual dining restaurantFast casual restaurantSchedule:8 hour shiftDay shiftMonday to FridayNight shiftWeekend availabilitySupplemental Pay:TipsCOVID-19 considerations:All employees are required to wear masks and maintain a high standard of cleanliness. Thorough cleaning is conducted nightly. Work stations have been evaluated and arranged to keep a six foot distance between employees whenever possible.Work Location: One location", "url": "https://www.indeed.com/viewjob?cmp=Tocaya-Modern-Mexican&t=Dishwasher&jk=84da4591f9e8e1be&vjs=3"},
{"job_title": "General Manager 4 - Food", "summary": "Sodexo is committed to providing working conditions and client services that are safe and healthy and will follow all applicable COVID-19 prevention measures,…", "company": "Sodexo", "location": "Cheshire, CT 06410+88 locations", "job_description": "Unit Description:\n\nSodexo is committed to providing working conditions and client services that are safe and healthy and will follow all applicable COVID-19 prevention measures, including state/local or client-mandated mask, testing and/or vaccine requirements.\nYou believe in an open, inclusive culture where everyone can thrive. Lead a team where engagement, productivity and innovation are born in this environment.\nSodexo is seeking a General Manager for it's operations at Elim Park, an upscale retirement community in Cheshire, CT. This an exciting opportunity for an seasoned, entrepreneurial manager who is constantly seeking a better way to conduct business. This key leadership position is directly responsible for the successful operation of Dining Services. The General Manager ensures client, customer service/satisfaction with efficient cost effective management that both meets and exceeds expectations.\nIs this opportunity right for you? We are looking for candidates who:\nhave a work history demonstrating strong leadership skills and the ability to work collaboratively with all levels of an organization;\npossess the ability to manage multiple priorities, demonstrate professional communication skills, and exhibit a passion for a high-level of customer service;\nhave culinary experience or knowledge and a strong background in safety and sanitation compliance;\nhave commercial acumen and a good level of computer literacy;\nare enthusiastic, confident and warm;\nhave a positive approach to tasks with a can-do attitude and impeccable attention to detail.\nLearn more about Elim Park at https://www.elimpark.org/\nAt Sodexo, we believe every employee should have the resources to be their best. As part of our overall rewards, we offer benefits programs designed to help you maintain a healthy lifestyle including health, dental and vision insurance. We also offer other benefits like paid time off, financial and savings programs, 401k, and access to our employee assistance program and other discounts. Click here for more information about Sodexo’s Benefits\nNot the job for you?\n\nWe offer Food Service Management positions in a variety of business segments, including Corporate, Schools, Universities, Government and Agencies, Healthcare, Senior Living and Sports and Leisure locations across the United States. Continue your search for Food Service Management jobs.\n\nWorking for Sodexo:\nAt Sodexo, you will find the ingredients for a great career in food service management. With benefits including schedules that encourage work-life balance and continuing education opportunities, you’ll enjoy an improved quality of life that’s unique in the hospitality industry.\nCompensation Range $90,000 -$95,000\nPosition Summary:\n\nDirects all contract management service operations at a single account/unit. Plans and supervises special functions. Maintains cash control and payroll records. Hires and trains unit personnel. Maintains customer satisfaction and good public relations. Manages through managers and is accountable for the contract. Senior-most person assigned to a one client account.\nProvides local leadership and strategic direction while developing team for new and emerging business solutions that sustain growth in the day to day operations.\nKey Duties\nDirects all contract services.Oversees management/administrative team who are responsible for special functions, cash control and payroll.Customer and client satisfactionDrives growth\nFinancial management\n\nQualifications & Requirements:\n\nBasic Education Requirement - Bachelor’s Degree or equivalent experience\nBasic Management Experience - 5 years\nBasic Functional Experience - 5 years\nSodexo is an EEO/AA/Minority/Female/Disability/Veteran employer.", "url": "https://www.indeed.com/viewjob?jk=6812fcdfeda5106d&from=serp&vjs=3"},
{"job_title": "Food Service Worker I 6 hrs", "summary": "Applies heat to appropriate foods and/or chills foods.\nLifts, moves and stores food and food service supplies.\nWaits on customers in a fast and friendly manner.", "company": "Baltimore City Public Schools", "location": "Baltimore, MD 21202 (Barclay area)+1 location", "job_description": "In agreement with our union partners, we are now requiring all staff members to have received both doses of the Pfizer or Moderna COVID-19 vaccines or the single dose of the Johnson & Johnson COVID-19 vaccine.\n\n\nPerforms basic food preparation, distribution and related maintenance tasks.\nEssential Functions\nAssembles food such as salads, sandwiches and box lunches and slices meats as necessary.\nApplies heat to appropriate foods and/or chills foods.\nMixes ingredients following simple instructions.\nAssists the Cook and/or Manager in cooking foods properly.\nHandles small amounts of cash, makes change per transaction, total meal counts and/or cash at the end of the day.\nWaits on customers in a fast and friendly manner.\nMaintains work area in a clean and orderly condition by performing such duties as cleaning tables, sweeping and mopping floors; cleaning refrigerators and other equipment and appliances, dishes, steam tables, carts, pots and pans.\nDisposes of garbage.\nPrepares and serves appropriate portions of food to meet daily menu requirements.\nLifts, moves and stores food and food service supplies.\nDemonstrates, through role modeling: high expectations, teamwork, cultural competence and strong commitment to customer service.\nAssists in training of student interns.\nPerforms and promotes all activities in compliance with equal employment and nondiscrimination policies; follows federal laws, state laws, school board's policies, and the professional standards.\n\nMaximum Salary 16.07\n\nMinimum Salary 15.00\n\nDesired Qualifications\nKnowledge of food preparation preferred.\nAbility to follow oral and written instructions.\nAbility to lift and carry heavy objects.\nAbility to perform simple arithmetic computations.\nAbility to maintain effective working relationships with others.\n\nFull time or Part time Part time\n\nAdditional Details\n Requires moderate physical exertion.\nLift items with and without handles up to 50 lbs. approximately 50% of work time.\nCarry items up to 150 feet approximately 50% of work time.\nGrasp slippery, heavy or moving objects approximately 90% of work time.\nWalk approximately 70% of work time.\nStand approximately 100% of work time.\nUtilize hands (special dexterity, special touch sensitivity, repetitive movements, tapping) approximately 100% of work time.\nQualified candidates for the above position must submit the following:\nCompleted online application\nResume that clearly demonstrates the above minimum qualifications. It is important that you include all experiences and education related to the position to which you are applying.\nMust provide three (3) professional references to include: name, title, business address, e-mail address and phone number\nAll documentation/certification necessary (scanned copies accepted) to substantiate minimum qualifications; must be uploaded into application\nBenefits - This position is eligible for benefits. To review the available options please see the information relevant to the union for this position by viewing the following link: http://www.baltimorecityschools.org\nBaltimore City Public Schools does not discriminate on the basis of race, color, ancestry or national origin, religion, sex, sexual orientation, gender identity, gender expression, marital status, disability, veteran status, genetic information, or age in its employment, programs and activities and provides equal access to the Boy Scouts of America and other designated youth groups. For inquiries regarding the nondiscrimination policies, please contact Equal Opportunity Manager, Title IX Coordinator Equal Employment Opportunity and Title IX Compliance Office 200 E. North Avenue, Room 208 Baltimore, MD 21202; 410-396-8542 (phone); 410-396-2955 (fax).\nThis position is affiliated with Local 44 (L44) bargaining union.", "url": "https://www.indeed.com/viewjob?jk=e3aeb81044f414ae&from=serp&vjs=3"},
{"job_title": "Banquet Server - $20.63/hr", "summary": "The hourly rate for this position is $20.63 per hour and offers health care benefits, flexible spending accounts, 401(k) plan, earned paid time off and/or sick…", "company": "Marriott International, Inc", "location": "Denver, CO 80202 (Central Business District area)+82 locations", "job_description": "Posting Date Dec 29, 2021\nJob Number 21154282\nJob Category Food and Beverage & Culinary\nLocation The Westin Denver Downtown, 1672 Lawrence St, Denver, Colorado, United States\nBrand Westin Hotels & Resorts\nSchedule Full-Time\nRelocation? N\nPosition Type Non-Management\nLocated Remotely? N\n\nAt Westin, we are committed to empowering the well-being of our guests by providing a refreshing environment, thoughtful amenities, and revitalizing programming to help ensure that they leave feeling better than when they arrived. We recognize that travel can be disruptive to our guests’ well-being, and we’re energized to assist as partners in helping them maintain control and soaring above it all while on the road. Everything we do is designed to help guests be at their best, and they appreciate our supportive attitude, anticipatory service and extensive knowledge on how to best assist them throughout their stay. We are looking for dynamic people who are excited to join the team and ready to jump into any situation to give a helping hand. If you’re someone who has is positive, adaptable and intuitive, and has a genuine interest in the well-being of others around you, we invite you to discover how at Westin, together we can rise.\nJOB SUMMARY\nOur jobs aren’t just about serving guests during a banquet or event. Instead, we want to build an experience that is memorable and unique. Our Guest Event Experts are skilled in a wide range of event functions with responsibility for making sure the event is well-executed from start to finish. Whether setting up or breaking down the materials, transporting supplies, taking orders, interacting with guests, or anything in between, the Guest Event Expert makes transactions feel like part of the experience.\nNo matter what position you are in, there are a few things that are critical to success – creating a safe work place, following company policies and procedures, upholding quality standards, and ensuring your uniform, personal appearance, and communications are professional. Guest Service Experts will be on their feet and moving around (stand, sit, or walk for an extended time) and taking a hands-on approach to work (move, lift, carry, push, pull, and place objects weighing less than or equal to 25 pounds without assistance). Doing all these things well (and other reasonable job duties as requested) is critical for Guest Event Experts – to get it right for our guests and our business each and every time.\nThe hourly rate for this position is $20.63 per hour and offers health care benefits, flexible spending accounts, 401(k) plan, earned paid time off and/or sick leave, life insurance, disability coverage, and other life and work wellness benefits. Benefits may be subject to generally applicable eligibility, waiting period, contribution, and other requirements and conditions.\nMarriott International is an equal opportunity employer. We believe in hiring a diverse workforce and sustaining an inclusive, people-first culture. We are committed to non-discrimination on any protected basis, such as disability and veteran status, or any other basis covered under applicable law.", "url": "https://www.indeed.com/viewjob?jk=228a8c355f57836b&from=serp&vjs=3"},
{"job_title": "newLaundry Attendant", "summary": "Fold, assemble, and package by hand different types and sizes of medical linen.\nFeed medical linens into the equipment.\n401K up to 3.5% company match.", "company": "Nixon Medical", "location": "Hartford, CT 06108+4 locations", "job_description": "Our Associates enjoy full-time hours, job stability and job growth. We take care of you, as you help us take care of thousands of medical patients and providers.What you will be doing: Fold, assemble, and package by hand different types and sizes of medical linen.Feed medical linens into the equipment.Place finished product onto conveyors or into carts, dump slings of product onto worktables.Move loaded or empty carts/bins within the production area.Position Requirements: Maintain good attendance.Must be able to meet physical demands that consist of standing, walking, reaching overhead, pushing, pulling and lift-up to 50 lbs.Tolerate loud noise, extreme temperatures (heat & cold), and other exposures in the production areas - Personal Protective Equipment (PPE) provided.Ability to work in a fast-paced environment, while following safety guidelines.What we offer: Weekly PayComprehensive benefit plans including – Medical, Dental, Vision, Company paid Life Insurance up to $50,000 and Virtual Medical Consultation – 24/7 access to a doctor via phone, video, or mobile app visits and Short-Term & Long-Term disability Insurance401K up to 3.5% company matchReferral Bonus Program – Up to $500Generous Paid Time Off & Paid Holidays – New Year’s Day, Memorial Day, 4th of July, Labor Day, Thanksgiving & ChristmasEmergency Loan - Interest Free payroll advance up to 1 weeks’ payAbout Nixon Medical: For over 50 years, Nixon Medical has been an industry leader in providing high-quality medical apparel and linens to outpatient healthcare centers. We pride ourselves in providing outstanding service to our customers. We partner with the largest, regional health systems in the Mid-Atlantic, Northeast and Southwest and provide service to more than 8,500 locations each week.We are a mission-driven company, proud to have built an award-winning workplace culture on respect, integrity, and growth. Our mission is to grow and create opportunities that enrich each other’s lives. To achieve this mission, our culture is focused on helping our associates become the best versions of themselves and empowering our customers to provide the best patient care possible.Nixon Medical is an EEO/Affirmative Action Employer.Job Type: Full-timePay: From $14.00 per hourSchedule:8 hour shiftMonday to FridayApplication Question(s):Are you able to work the 5:00am - 1:30pm or 1:30pm - 10:00pm shift?Work Location: One location", "url": "https://www.indeed.com/viewjob?jk=b81d9af4e0d72245&q=Labor&l=USA&from=web&advn=7321407349025014&adid=383240117&ad=-6NYlbfkN0BAq7xo-LRTy41akrfvtA9C2BWYmz0SkcDgsk6mPpDt_SBETuYfqh5Ut0Q73K-18dcHs76fVj5D-mHzflsfwZRcgsh_pPijZ73C9DPMbcKcozAikeR1pKxbvCfnxl4x3ITwa6u3hOOPhZYdPOmc1YjYOY9hesSHKZ41wQNcdCB3_ic3rx5DE69uVj2liCaDgQr3WIiZ4bU5L5Ljfrjw2LJba6VEEJrZkzTkW6U-aeUmXCsMWYHsaBTSoa3YwkoCPqlITLRrAoGI35X0oD-jQaxUXBMs89yOJrSw57Y-qtdH4kvM34oZvqk8vUTZfzXBDHdQ3fxsH5EsNFp1UuYvqQpknIHPWf0oMuGVxjjR8luE254ousKUoKBE&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "Warehouse Worker", "summary": "Get paid weekly – Rewarding production pay – your output means earnings, the harder you work the more you can make.\n5:30 AM - 4:00 PM Monday - Thursday.", "company": "Capstone Logistics LLC", "location": "Windsor, CT+38 locations", "job_description": "Warehouse AssociateWindsor, CTJoin our growing team! We are looking for motivated individuals who want to further their career in warehousing with Capstone Logistics. Capstone Logistics, is part of The Transportation and Logistics industry which has been designated a “Critical Infrastructure Segment”, our associates are Essential.· Potential to earn over $1000+ per weekShifts: · 5:30 AM - 4:00 PM Monday - Thursday· 5:00 PM - 5:30 AM Sunday - Tuesday· 5:00 PM – 5:30 AM Wednesday - FridayOur Warehouse Associates load and unload both by hand and with equipment.Associates are paid by the truck. The harder you work, the more you earn!Requirements· High-energy individual with a strong work ethic, the work is fast paced and very physical· Lift and carry a minimum of up to 25-75lbs, materials handled vary· Prior warehouse and/or equipment experience is preferred but we are willing to train the right candidate· All candidates should be over the age of 18 and will have to undergo a pre-employment drug test and background checkWhy you should work with us: · Get paid weekly – Rewarding production pay – your output means earnings, the harder you work the more you can make· Benefits -- after 60 days of employment· Career growth, Over 580 Sites nationally· Join our travel team, see the country, learn how all our sites operate· Paid Training, Safety IncentivesAbout the Company: Capstone is a leading North American supply chain solutions partner with more than 580 operating locations,16,500 associates, and 60,000 carriers. We have capabilities in freight management, warehouse and distribution center support, last mile delivery, supply chain analytics and optimization, and more. We are uniquely positioned to help our customers reduce warehousing and transportation costs.Job Type: Full-timePay: Up to $1,000.00 per weekBenefits:401(k)Dental insuranceHealth insurancePaid time offVision insuranceSchedule:8 hour shiftExperience:Warehouse: 1 year (Preferred)Pallet Jack: 1 year (Preferred)Work Location: One location", "url": "https://www.indeed.com/viewjob?jk=daab33fcffd04af0&q=Labor&l=USA&from=web&advn=7407511792984335&adid=368434938&ad=-6NYlbfkN0C5_tnIROqlxtxWQi4Pxs6tsSv2pO3cJairTpj1EPq7cg_iTv3B3pXMDR67VGXcQN50NiuwQLpn1NZQ4yVZtRo4uu2Z3J2dhnjV7YqMo1qnPRA5-LoHg5VcXcwbtGc2p9iX8BzG0GyFJyLUqyM31YwEZjOen1ri3q8y2zE3btpOc4luYloZKQm828VNhsZAvBMKcVb25eEqnvg1V3oAdW-md571f6SQkORr-lPjff_XnvG5kdG1IOlCwxV9EeSmqvmGFonWLgIFLJXf9mPgdArlGrYsctprqNI_pYSYfHKPAhuJiyrCa6xbqyj5c5Y_CqW9gqR9GNLxtT1uhyRjvMf0YEZ7815essBCsqwtcEtTPQyVfr3MUoBT&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "newConstruction Laborer", "summary": "Our company does various types of construction including the corporate and retail space, site work and other miscellaneous projects.", "company": "Evergreen Construction", "location": "New York, NY", "job_description": "Our company based in Midtown, NYC is looking for talented individuals in the construction industry to join our team! We are looking to hire highly motivated, reliable and quality focused individuals. Our company does various types of construction including the corporate and retail space, site work and other miscellaneous projects.Job Types: Full-time, Part-timePay: $20.00 - $25.00 per hourSchedule:Monday to FridayOvertimeWeekend availabilityCOVID-19 considerations:All field staff are required to follow COVID-19 protocols.Experience:Construction Experience: 1 year (Preferred)License/Certification:Driver's License (Preferred)Work Location: Multiple Locations", "url": "https://www.indeed.com/viewjob?cmp=Evergreen-Construction&t=Construction+Laborer&jk=5446c7bfb56f3cb9&vjs=3"},
{"job_title": "Warehouse Lumper -PM Shift", "summary": "You’ll then safely remove pallets of product from the trailer and break down the product to be the correct height and width.\nFree BJ's Family Membership.", "company": "Burris Logistics", "location": "Rocky Hill, CT 06067+3 locations", "job_description": "Are you a hard-working, dependable, team player? If so, join the Burris Team as a Warehouse Lumper!As a Lumper you’ll ensure the the product coming into our warehouse is safe to unload. You’ll make sure it is the correct temperature and that there is no evidence of contamination, damage or infestation. You’ll then safely remove pallets of product from the trailer and break down the product to be the correct height and width.Our warehouses are temperature-controlled, ranging anywhere from 30 degrees in the cooler to -20 degrees in the freezer.Join the Burris Team!Excellent medical, dental & vision insurance: Burris covers 88% of your premium!Generous 80 hour PTO policy in the first year401K company match 100% up to 6% Fully vested after two yearsFree BJ's Family MembershipFree College Degree Program for Team Members and Discounted Tuition for Family MembersEmployee discount program at participating major retailorsCompany paid 35K life insurance, disability, appreciation events & much more!You’ll be Responsible for: Completing trailer inspection of incoming productSafely removing pallets of product from trailerBreaking down pallets of product to be the correct height and width to be stored in the warehouseMust-Have Qualifications: Being a lumper can be physically demanding. You need to be able to stand, walk, bend, squat, reach, grasp on a frequent to continual basis in a warehouse environment.High school diploma or GEDAble to speak, read, and understand EnglishAble to work in a cold warehouse environmentWe offer benefits to meet a wide range of needs. From medical, dental, and vision plans, to 401k with a company match and flexible spending accounts, and legal aid, we’ve got you and your family covered.Since 1925 Burris has been growing its business and its family of team members. From driver to warehouse, dispatcher to administration, the Burris team is known for integrity, reliability, and a dedication to customers. Join our team and experience a reputation to be proud of.Burris Logistics is an Equal Opportunity Employer.Job Type: Full-timePay: From $18.00 per hourBenefits:401(k)Dental insuranceEmployee assistance programEmployee discountFlexible spending accountHealth insuranceHealth savings accountLife insurancePaid time offProfessional development assistanceReferral programRetirement planTuition reimbursementVision insuranceSchedule:10 hour shiftWork Location: One location", "url": "https://www.indeed.com/viewjob?cmp=Burris-Logistics&t=Warehouse+Lumper&jk=e8c533cb21aeca87&vjs=3"},
{"job_title": "Tractor Driver 1", "summary": "With training, a Tractor Driver must have ability to learn to operate any tractor and/or ATV safely and properly.\nAttend company training and classes.", "company": "Jackson Family Wines", "location": "Salem, OR 97304+1 location", "job_description": "General Description of Duties:\nWith training, a Tractor Driver must have ability to learn to operate any tractor and/or ATV safely and properly. A tractor driver must maintain all of his equipment and/or implements in a clean and operational manner. He must also take excellent care of all vineyard property and maintain a safe and quality based approach while working around all personnel and operate a tractor in a safe manner.\nEssential Duties and Responsibilities:\nMowing\nDiscing\nFungicide spraying\nHarvest (hauling gondolas)\nATV operation (1. Spreading wire 2. Spreading hose)\nLaying out all types of trellis materials with trailer\nDusting\nVineyard Maintenance (e.g. repairing erosion control damage)\nPerform maintenance or equipment as well as troubleshoot and report problems.\nReport all injuries and mechanical problems to supervisor immediately.\nMust follow all of the company’s safety rules and regulations at all times.\nOther duties as assigned.\nExperience and Training:\nMust have willingness to learn by on the job training.\nMust pass physical exam.\nAttend company training and classes.\nPhysical Demands and Work Environment:\nTractor Driver will be exposed to mixing chemicals and will be required to work at night. The employee must be able to lift and/or move up to 50 pounds. The employee will be exposed to wet and or humid conditions, dust, farming chemical and fertilizers as well as seasonal weather conditions (summer heat, cold weather rain). This position also requires repetitive sitting, foot controls, kneeling, bending and stooping.\nOther Requirements:\nMust be able to work nights, weekends and overtime as required.\nGood oral communication skills.\nAble to read documents such as safety rules of operation and maintenance manuals.", "url": "https://www.indeed.com/viewjob?jk=e71ff598655c6101&from=serp&vjs=3"},
{"job_title": "School Baker", "summary": "Except for the substitutions provided for below, applicants must have had progressively responsible work experience of the kind, quality, and quantity as…", "company": "Hawaii State Department of Education", "location": "Oahu Island, HI+4 locations", "job_description": "Amended 1-5-21: Monthly Salary\n\nSCHOOL BAKER\n\n$4,270.00 per month (BC-06)\n\nLocation\n\nLeeward District, Oahu\n\nJob Summary:\n\nResponsible for all aspects of the preparation and baking of a variety of baked goods for school meals; provides direction/instruction to assigned cafeteria helper(s) and/or other adult/student helper(s); and performs other related duties as assigned.\n\nApplicants must meet all the requirements for the position they are seeking as of the date of the application, unless otherwise specified. Unless specifically indicated, the required education and experience may not be gained concurrently.\n\n\nNote: Calculation of experience is based on full-time, 40-hour workweeks. Part-time experience is pro-rated. Example: Twelve months of experience at 20 hours/week is equivalent to six months of experience, not one year. Also, hours worked in excess of 40 hours/week will not be credited. Example: Twelve months of experience at 60 hours/week is equivalent to one year of experience, not one and a half years.\n\n\nTo qualify, you must meet all of the following requirements:\n\nMinimum Qualification Requirements:\n\n\nEducation Requirement:\n\nGraduation from high school or equivalent.\n\n\nExperience Requirement:\n\nExcept for the substitutions provided for below, applicants must have had progressively responsible work experience of the kind, quality, and quantity as described below.\n\n\nGeneral Experience:\n\nSix (6) months of work experience as an apprentice or helper in a kitchen where the applicant has acquired basic skills in baking by assisting with such tasks as weighing, measuring, and combining ingredients; mixing dough for simple baked products; scaling and shaping dough for rolls, buns, etc.\n\n\nSpecialized Experience:\n\nOne (1) year of work experience as a baker in a restaurant, hotel, hospital, school, or institution which included actual hands-on experience in producing a variety of baked goods from scratch and in large quantities. Such experience must demonstrate the applicant's proficiency in quantity baking which includes knowledge of types of ingredients used in baking, their properties, functions, and substitutions; standard procedures for adjusting standardized recipes to meet production needs, calculating bread equivalents, and determining baking times for non-standard batch sizes (e.g., 8 dozen cupcakes rather than 2 sheet cakes); the use, care, and safe handling of utensils, tools, and equipment used in baking; methods of handling and storing foods; and food and kitchen safety and sanitation practices.\n\n\nThe overall knowledge and experience must conclusively demonstrate the applicant's ability to perform quantity baking required for the school food services program.\n\n\nNon-Qualifying Experience:\n\nApplicants must have had experience in the whole process of baking in large quantities. Experience which is limited to serving food, cleaning, and washing dishes; only one phase of baking such as weighing, measuring, and combining ingredients, mixing and shaping dough; or other kinds of work not affording the opportunity to acquire the knowledge and skills of quantity baking will not be accepted as qualifying for the Specialized Experience requirements.\n\n\nSubstitutions Allowed:\n\n1. Possession of an associate's degree from an accredited community college in a food service/culinary arts program which included training in quantity baking may be substituted for all of the required experience.\n\n\n2. Successful completion of a substantially full-time curriculum from an accredited technical school, community college or university which included coursework which provided the applicant with the knowledge of and hands-on practice in quantity baking comparable to the above required Specialized Experience may be substituted for the pertinent experience on a month-for-month basis.\n\n\n3. Excess Specialized Experience may be substituted for General Experience on a month-for-month basis.\n\nAll documents submitted to us become the property of the Department of Education.", "url": "https://www.indeed.com/viewjob?jk=4239f8d7412fa5cd&from=serp&vjs=3"},
{"job_title": "newAfternoon Crew Member", "summary": "Work well with others respectfully, and can interact in a positive efficient manner.\nRespond positively to coaching and feedback.", "company": "Dunkin Donuts | Cafua Management Company", "location": "Syracuse, NY+11 locations", "job_description": "Hiring Immediately!Dunkin Donuts!*Crew Members*RESPONSIBILITIES INCLUDE (BUT NOT LIMITED TO) THE FOLLOWINGTeam EnvironmentWork well with others respectfully, and can interact in a positive efficient mannerRespond positively to coaching and feedbackAble to communicate with team members, as well as with supervisors within the organizationAble to learn and execute multiple tasksSkills/QualificationsProvide great guest serviceFluent in EnglishBasic computer skillsCapable of counting money and making changeAble to operate restaurant equipment (18 years or older)Must be able to lift a minimum of 50 lbs.Problem Solving and Decision MakingIdentifies and resolves issues and problemsUses information at hand to make decisions and solve problems; includes others when necessaryWith 200+ locations in 7 states, Cafua Management Company is the largest private Dunkin Donuts franchise in the US with a People First culture. You are applying for work with a franchisee of Dunkin' Donuts, not Dunkin' Brands, Inc., Dunkin' Donuts or any of their affiliates. If hired, the franchisee will be your only employer.''Work Location:One locationWork RemotelyNoJob Types: Full-time, Part-timeSchedule:Monday to FridayWeekend availabilityWork Location: Multiple Locations", "url": "https://www.indeed.com/viewjob?cmp=Cafua-Management&t=Afternoon+Crew+Member&jk=39db4a249de1f19d&vjs=3"},
{"job_title": "Dishwasher - Kumi (Le Méridien)", "summary": "Scrapes and pre-rinses food from dirty dishes and places them in dish washing machine.\nWashes work area tables, walls, refrigerator equipment, cooking equipment…", "company": "SBE Restaurant Group", "location": "New York, NY 10019 (Midtown area)+4 locations", "job_description": "Job Responsibilities: Scrapes and pre-rinses food from dirty dishes and places them in dish washing machine.Washes pots, pans and trays by hand and/or machine.Completes all assigned prep work.Removes trash and garbage to dumpster area.Washes work area tables, walls, refrigerator equipment, cooking equipment and floors.Cleans garbage cans and trash receptacles.Assembles, maintains and breaks down dish machine.Skills & Requirements: Ability to perform tasks with accuracy, speed, and attention to detail.Ability to thrive in a fast paced environment.Ability to work on feet for the duration of shift.Must be able to work a flexible schedule to include days, nights, weekends and holidays.Minimum age requirements may apply depending on concept.Job Types: Full-time, Part-timeBenefits:401(k)Dental insuranceEmployee assistance programEmployee discountFlexible scheduleHealth insuranceLife insurancePaid sick timeReferral programVision insurancePhysical Setting:Casual dining restaurantFine dining restaurantSchedule:10 hour shift8 hour shiftDay shiftEvening shiftHolidaysMonday to FridayNight shiftWeekend availabilityWork Location: One location", "url": "https://www.indeed.com/viewjob?cmp=Sa%27Moto-(Doheny-Room)&t=Dishwasher&jk=9807421896dc0001&vjs=3"},
{"job_title": "newCase Picker/Order Picker/PIV Pick machine Drivers", "summary": "ASK ABOUT OUR $2,000 REFERRAL & $500 SIGN ON BONUS!!!*.\nImmediate hire for Full Time Case Picker/Order Picker/PIV Pick machine Driver positions.", "company": "Amscan International", "location": "Chester, NY 10918+1 location", "job_description": "ASK ABOUT OUR $2,000 REFERRAL & $500 SIGN ON BONUS!!!Immediate hire for Full Time Case Picker/Order Picker/PIV Pick machine Driver positions. As a Driver in our Stock Department, you will be responsible for operating a Case Picker/Order Picker/PIV Pick machine to move, locate, relocate, stack, and count merchandise. The Driver is accountable for the safe and efficient operation of the vehicle. Comprehensible benefits offered. Apply now and call 845.572.2180Hours/Days2nd shift Mon-Fri 4pm-12:30am3rd shift Mon-Thu 8:30pm-7:00amRESPONSIBILTIES AND DUTIESPick from reserve to Replenish primary locations.Pick Outbound Cartons.Transport pallets of merchandise to and from reserve locations.Transport all merchandise received into warehouse from receiving dock to reserve locations.Transfer merchandise from location to location to make space (re-warehousing).Maintain a clean, neat, and orderly work area.Conduct operations in a manner that promotes safety complying with OSHA Standards including daily check list prior to operating machine.Job Type: Full-timePay: $20.00 - $22.00 per hourBenefits:401(k)401(k) matchingDental insuranceEmployee discountFlexible spending accountHealth insuranceHealth savings accountLife insurancePaid time offReferral programRetirement planTuition reimbursementVision insuranceSchedule:10 hour shift8 hour shiftDay shiftMonday to FridayNight shiftWork Location: One location", "url": "https://www.indeed.com/viewjob?jk=be5a00ff9cd16510&q=Labor&l=USA&from=web&advn=6223161476900120&adid=58670771&ad=-6NYlbfkN0ALyhAUN4-rMnQis_n0DgkUvmAya-wWUdlU29uRgGT9KIzKCXIeS5itAw0GIAujaTyrUFmpmM78Uj2Ee_CTAhODzUvqcfpD6XXQ6GM-SESA8TjaEPKl3prMkdW7lT6icv6yuEtfP0qeZio7XWVOQTY_FWF61wSPNvk4Om9ftQMnDgKODPrjCrJk08VWyiaqOGgb7RnK-3UkYmbFBK-FUKw_7BUcctDxekfvgbtAu37U6Cc8Ob07-QiUeDdptLPQMLVAQEBkofHFfEBhxRv0lM8jOf_eDznIvAoNcH263HtG6ByjrSxlkn5SgN7G5oXvTR_Z0cv2edDpfcjGeRbxbrHy5EW-KgHd7HcdytDFT9QPJibCV_b9LdCc&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "newFood Service Assistant - Contingent - Kingswood", "summary": "Education and training, the health system has trained nearly 40% of physicians currently practicing.\nPersonal computer and data entry skills, preferred.", "company": "Henry Ford Health System", "location": "Ferndale, MI 48220+11 locations", "job_description": "Under the direction of department leadership, performs a variety of duties related to preparing and serving meals to patients, employees and visitors; performs cashier, diet office, inventory/supply or dish room duties and other duties as assigned.\nEDUCATION/EXPERIENCE REQUIRED\nHigh School Diploma, G.E.D., or six (6) months to one (1) year of previous work experience in a food service or cash handling setting preferred.\nAble to read, write, speak English and follow oral and written instructions.\nPersonal computer and data entry skills, preferred.\n Overview\n\n Under the leadership of President and CEO Wright L. Lassiter, III, Henry Ford Health System is a\n $6 billion integrated health system comprised of six hospitals, a health plan, and 250+ sites\n including medical centers, walk-in and urgent care clinics, pharmacy, eye care facilities and\n other healthcare retail. Established in 1915 by auto industry pioneer Henry Ford, the health system\n now has 32,000 employees and remains home to the 1,900-member Henry Ford Medical Group, one\n of the nation’s oldest physician groups. An additional 2,200 physicians are also affiliated with the\n health system through the Henry Ford Physician Network. Henry Ford is also one of the region’s\n\nmajor academic medical centers, receiving between $90-$100 million in annual research funding and\n remaining Michigan’s fourth largest NIH-funded institution. Also an active participant in medical\n education and training, the health system has trained nearly 40% of physicians currently practicing\n\nin the state and also provides education and training for other health professionals including nurses,\n pharmacists, radiology and respiratory technicians. visit HenryFord.com.\n\n Benefits\n\n Whether it's offering a new medical option, helping you make healthier lifestyle choices or\n making the employee enrollment selection experience easier, it's all about choice. Henry\n Ford Health System has a new approach for its employee benefits program - My Choice\n Rewards. My Choice Rewards is a program as diverse as the people it serves. There are\n dozens of options for all of our employees including compensation, benefits, work/life balance\n and learning - options that enhance your career and add value to your personal life. As an\n employee you are provided access to Retirement Programs, an Employee Assistance Program\n (Henry Ford Enhanced), Tuition Reimbursement, Paid Time Off, Employee Health and Wellness, and a whole host of other benefits and services. Employee's classified as contingent status are not eligible for benefits.\n\n Equal Employment Opportunity/Affirmative Action Employer\n\n Equal Employment Opportunity / Affirmative Action Employer Henry Ford Health System is\n committed to the hiring, advancement and fair treatment of all individuals without regard to\n race, color, creed, religion, age, sex, national origin, disability, veteran status, size, height,\n weight, marital status, family status, gender identity, sexual orientation, and genetic information,\n or any other protected status in accordance with applicable federal and state laws.", "url": "https://www.indeed.com/viewjob?jk=b99b3dd3801f191b&from=serp&vjs=3"},
{"job_title": "Construction worker", "summary": "Must be able to travel.", "company": "Interior Experts General Builders", "location": "Douglas, AZ+1 location", "job_description": "Construction workersIn Douglas AreaMust be able to travel.Rate of pay: $22/hr - $35/hr DOEJob Type: Full-timeSalary: $22.00 - $35.00 per hourSchedule:8 hour shift", "url": "https://www.indeed.com/viewjob?cmp=Interior-Experts-General-Builders&t=Construction+Worker&jk=868decfec5166cf8&vjs=3"},
{"job_title": "Food Production / General Labor - All Shifts!", "summary": "Production / General Labor Jobs Available Now!.\n$500 Sign-on Bonus!.\nPepper Source Van Buren is increasing our team with full-time employment opportunities!", "company": "Pepper Source, Ltd.", "location": "Van Buren, AR 72956+1 location", "job_description": "Production / General Labor Jobs Available Now!New Hiring Rates!$500 Sign-on Bonus!Immediate hire for qualified applicants! Pepper Source Van Buren is increasing our team with full-time employment opportunities!Packager. Portion Control Packagers work closely with Machine Operators to verify quantity, quality, and labeling of products: ensuring correct box type, box liners, and packaging methods are used per customer specifications.Batch Mixer. Mixers blend ingredients into custom products by verifying ingredients, loading ingredients into mixer, and adjusting valves or devices during the mixing process.Pepper Source and its affiliates are equal opportunity employers offering the following benefits:FULL BENEFITS (HEALTH, VISION, DENTAL, LIFE)401(k)/PROFIT SHARING PAID VACATION/PTO/HOLIDAYS WEEKLY PAY PERIOD / DIRECT DEPOSIT PAYROLLATTENDANCE & REFERRAL BONUSESCONSISTENT GROWTH / RAISE OPPORTUNITIESRequirementsWorking overtime and altered work schedules are required as deemed necessary by management. This may include working more than 8 hours per day, and more than 5 days per week to meet production requirements.While performing the duties of the above jobs, an employee is regularly required to lift and/or move up to 50 pounds; an employee also must be able to climb above floor height and work with food ingredients containing common allergens.About UsPepper Source is a family-owned company that provides custom sauces, seasonings, and dry coating systems to all of the major poultry companies in the United States as well as the frozen food, meat, and food service industries. We develop and manufacture custom flavor profiles that meet our customers’ specific needs. Our process takes innovation and extensive knowledge of the food industry.How to ApplyWALK-IN INTERVIEWS WELCOME! Stop by our office at 5800 Alma Hwy, Van Buren, AR 72956 today, or text Brandy at 479-337-7050 / call 479-474-5178 to schedule your interview for one of our production opportunities!You can also apply on our web site at http://peppersource.com/employment.aspx or through our job postings on www.indeed.com. Come join our team!Job Type: Full-timePay: From $14.00 per hourBenefits:401(k)401(k) matchingDental insuranceHealth insuranceHealth savings accountLife insurancePaid time offReferral programVision insuranceSchedule:Monday to FridayNight shiftOvertimeWeekend availabilitySupplemental Pay:Bonus paySigning bonusCOVID-19 considerations:Masks/PPE, hand sanitizing, and temperature checks are required in the production facility.Experience:Manufacturing: 1 year (Preferred)Shift availability:Night Shift (Preferred)Day Shift (Preferred)Overnight Shift (Preferred)Work Location: One location", "url": "https://www.indeed.com/viewjob?jk=2c830bd303267132&q=Labor&l=USA&from=web&advn=8968242431880144&adid=369895268&ad=-6NYlbfkN0DPmydUTXSG67EDfJhppf-ZjQSRrOvTwUQF2vT4QXQKKu8iCDGAVMJDWuKya6inH4sJMpl-_HBHdMrcyfpuqOvrpLUyhAM_d9Yq4vC97une91sZbJiqNnMZU7McnEpzPVAEteItIdPPfwb6eS9CNpieoX966VNVk8cxPYGQCL8nITXzRosXchb7n4wGdeiHmajq0zzAybQ0TnuF00fcr9bPVw9DHQ6bPzeAtW1QiK3voujQQyVw0auNC_FhgXNbWObwR-FfXjXDw79_52thZx0kYHF0moUBb6Yss1oAVwpTXbV9hk39HrdShrgyRj8Va90Nmu2oihuKli5zDxMa6BOdob3DGRPrBAoFXc6n33F_KyCOoYSwEvwi&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "Freight Conductor- Birmingham, AL", "summary": "A conductor's primary responsibility is to safely coordinate train crews on a freight train, place rail cars to facilitate loading and unloading, and makeup…", "company": "CSX", "location": "Birmingham, AL 35242+13 locations", "job_description": "Job Summary\nA conductor's primary responsibility is to safely coordinate train crews on a freight train, place rail cars to facilitate loading and unloading, and makeup/breakdown trains in a rail yard, customer facility or similar locations.\nTo see more of what a day-in-the-life video looks like, please see here.\n\nPrimary Activities and Responsibilities\nEnsure compliance with all train orders, signals, railroad and safety rules and Federal Railroad Administration (FRA) regulations\nBe able to safely perform all job responsibilities\nInspect all equipment on cars prior to departures\nReceive and transmit information by radio and telephone\nRead and understand bulletins, work orders, and switch lists\nAssist with the coupling and uncoupling of cars, operate switches, and make minor repairs to railcars, including replacing heavy couplings or air brake hoses\nWork with customers to ensure accurate movement and placement of cars; delivers excellent customer service by identifying customer needs and meeting or exceeding expectations\nMaintain awareness of surrounding area and suspicious activity to ensure rail safety\nOperate locomotive equipment through the use of remote control device\nQuickly and repeatedly make precise adjustments in moving the controls of a machine or vehicle to exact positions\nComprehend color and/or hand signals and systems\nReview instructions from dispatchers and other transportation employees, and discuss with locomotive engineer\nMiscellaneous activities and responsibilities as assigned by manager\n\nPay Rate CSRA\nTraining rate while in Atlanta $991.20 weekly\nOJT Training Rate $1,189.44 weekly\nAfter OJT, guaranteed extraboard pay of $1002.28 weekly\n$67,000 average first year earnings including training. After training first year conductor average $72k and 5% progression rate per year to achieve full rate within 5 years per the collective bargaining agreement.\n\nTraining\nYou will attend four weeks of training at the Atlanta Training Center (ATC) in Atlanta, GA. CSX will pay for travel, lodging and meals. You will complete an additional 6-15 weeks of on-the-job training at your assigned location.\n\nQualifications\n\nMinimum Qualifications\n18 years of age or older\nHigh School Diploma/GED\nOne year verifiable work experience\nPreferred Qualifications\nOne or more years of outside work exp (e.g. construction, heavy equipment op, farming,etc)\nExperience working in a safety sensitive environment\nPhysical Requirements\nMust be able to mount and dismount moving equipment\nStoop/bend/kneel/crouch/crawl/balance/climb\nWork in cramped, confined, enclosed, or awkward places\nRide on the outside of rail equipment for long periods of time\nWalk long distances over uneven terrain\nDemonstrate auditory and visual acuity/tracking/inspection\nMust meet color vision and hearing requirements as described in FRA Regulations\nFrequent lifting up to 50 lbs\nBasic Competencies\nVerbal comprehension (Understand oral and written communications)\nCommunication skills (provide clear instructions/directions)\nReasoning skills (problem solving and troubleshooting skills)\n\nJob Requirements\nWork safely to prevent on the job accidents and injuries\nWear protective equipment such as hard hat, hearing protection, or safety-toe boots\nWork hours may include a nonstandard workweek, overtime, and various shift work\nWork hours are based on seniority, new hires primarily work nights, weekends, and holidays\nMust be able to safely report to work within two hours of being notified to report in\nComplete annual training and pass safety rules examinations\nFederal regulations require random testing for drugs and/or alcohol\nMust pass all required assessments\nMust pass a background screening\nStrict disciplinary policy regarding inability to report to work within proper time frame\nAdvance to engineer position when required, based on seniority\nThis position is governed by a collective bargaining agreement and membership is req.\nMust pass a post-offer medical examination, including a drug test\nOur Commitment to Operate Safely\nLed by our Guiding Principles, CSX is committed to protecting its employees, customers and the communities in which we operate. Therefore, as a condition of employment, successful external candidates for all positions and internal craft employees accepting management positions must be fully vaccinated for COVID-19. Successful candidates will be required to provide proof of full COVID-19 vaccination within three days of the position start date unless approved for a medical or religious accommodation. Should the successful candidate seek a medical or religious accommodation, appropriate documentation must be provided in support of such request.\n\nAbout CSX\nCSX, based in Jacksonville, Florida, is a premier transportation company. It provides rail, intermodal and rail-to-truck transload services and solutions to customers across a broad array of markets, including energy, industrial, construction, agricultural, and consumer products. For nearly 200 years, CSX has played a critical role in the nation's economic expansion and industrial development. Its network connects every major metropolitan area in the eastern United States, where nearly two-thirds of the nation's population resides. It also links more than 230 short-line railroads and more than 70 ocean, river and lake ports with major population centers and farming towns alike. More information about CSX Corporation and its subsidiaries is available at www.csx.com. Like us on Facebook and follow us on Twitter.\n\nClosing Statement\nAt CSX, two of our five Guiding Principles are Valuing and Developing Employees as well as Operating Safely. We are committed to offering our team members the most competitive compensation and benefits package available, unlimited opportunities for development and growth throughout an exciting and rewarding career, and the safest work environment possible.\n\n\nCSX is an Equal Opportunity Employer Veterans/Disabled. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, or protected veteran status and will not be discriminated against on the basis of disability. Click here to view the EEO is Law poster. Click here to view the OFCCP pay transparency provision information.\n\n\nCSX Transportation and its subsidiaries are not seeking outside assistance or accepting unsolicited resumes from staffing agencies or search firms for employment or contractor opportunities. Any resumes submitted by an outside vendor to any employee at CSX via e-mail, Internet, or directly to hiring managers without a valid written search agreement in place with the Talent Acquisition / HR department will be deemed the sole property of CSX. No placement fee will be paid in the event a candidate is hired as a result of the referral, or through other means.\n\nCSX Company: CSX Transportation\nPrimary Location: United States-AL-Birmingham\nTax Status: Railroad Retirement\nOvertime Status: Non-exempt\nClosing Date: Feb 15, 2022, 10:59:00 PM\nNumber of Openings: 16\nTravel: Yes, 75 % of the Time", "url": "https://www.indeed.com/viewjob?jk=7472b56f25cf1289&tk=1frerl1s9u2jt800&from=serp&vjs=3&advn=1175678376742128&adid=66934159&ad=-6NYlbfkN0B4r7QDcS1FYldRU7VPv1R0Vj7kpMu-sKqn6UUkSgegOydivzZDyt9sEkzJ1oC44s3jzftATyVKMKbGMxgWQySMqmiO1srKyOzY2vOmorUFjuQO7aknvX4o0-q4R8xfPykpKOKt6tvBB9BTLS_6rdN1OmVDmkl8vF87LQ0ZiQ5PEqIBXR2_m6EDMAFnymbfkuvQyQ3Wd2PvUV335ijLrTwX0pZKyxz15util7K0pcXnxbLOp-NqWbOZqgzyyhUmD3k33O1WziJwMXqimq88Y25Zq_t_dv79K3gWqG6Cm6KwuYYoO0SlNGzfMD3GdYoMmEY-MvT4ZMc7L5tcX4-cApyvx4qgGm7vbKU=&sjdu=yFGnR6TD85yL4qsviYUZxO-bPylNW2vvO3WAHEKN7JgEuyl-uSLk6boycRtdWr-cxOfZMYZkHFvv0bguyXXCEa0K7GRpQF6vKExcHtl6Bjz5ArFzKsyIzzF4pUPSwRXlyD3ZRN9Gx1-HVgRyeJ4RShFFWhnfH-S0eu3C08pYIVE"},
{"job_title": "newHandyman / Groundskeeper", "summary": "Ability to lift up to 50 pounds and provide manual labor including but not limited to lifting, pushing, and pulling.\n$30-$38/hour DOE.", "company": "Excellence Services, LLC", "location": "Atherton, CA 94027", "job_description": "LOCATION: Atherton, California, USA.COMPENSATION: $30-$38/hour DOE.Health Insurance.Paid Vacation, Holidays, Sick days.Paid rest & meal breaks.Discretionary Bonus (generous).Regular reviews & advancement opportunities.ABOUT US: Excellence Services LLC is a privately owned company that provides luxury service for one HNW family exclusively. We help our client enjoy their life and encourage employee success.SUMMARY: Seeking a professional handyman/groundskeeper with maintenance and landscaping experience to join our team on a private Atherton, CA estate. We are devoted to providing our clients with a safe, beautiful place to live and enjoy themselves. We will rely on you to keep the home and grounds in peak condition. A well-organized and detail-oriented person will be valued greatly in this position.RESPONSIBILITIES: Proactive planning and scheduling of work duties either on your own or with a team and management.Follow a to-do list and procedures as well as be proactive to create lists for property care and improvement.Maintain landscape and garden areas as needed by planting, trimming, fertilizing, mowing, or other activities.Ability to troubleshoot pipes and/or potential irrigation leaks/problems.Keeping outdoor living spaces, furniture, light fixtures, and equipment clean at all times.Power washing sidewalks, gutters, walls, patios, decks, and more.Assisting in inventory, organizing tool sheds and garages.Assisting Property Manager in supervising outside contractors and vendors.Perform minor fixes and maintenance with plumbing, electrical, mechanical, carpentry, and painting (if qualified).Picking up supplies or materials from local hardware and/or landscaping stores.Picking up packages and package cartons - unfolding and collecting.Perform sanitation duties including trash sorting, removal, shredding, and trash bin cleaning.Responsible for pest control and removal including placing bait stations for rodents such as rats, moles, voles.Respond to the Property Manager and maintenance staff with a clear plan and solutions to any concerns in a timely and professional manner if needed.Responsible to provide clients with support and guidance on maintaining their equipment and keeping recordsQUALIFICATIONS: Must be Fluent in English with excellent communication skills. Ability to communicate well with the property manager and maintenance staff.5+ years of related professional experience working in a high-level private home or in a similar role or capacity.Excellent direct manager-level verbal references are required from both current and previous employers.Valid Driver's License required and legally eligible to work in the United States.Must pass a background check and drug screen.Must be professional, proactive, reliable, and respect the boundaries, privacy, and confidentiality of the family.Ability to work in all weather and temperature conditions.Ability to lift up to 50 pounds and provide manual labor including but not limited to lifting, pushing, and pulling.Education in HVAC, electrical, plumbing, mechanical, irrigation or any similar trade is a plus.Knowledge of methods of landscaping and proper use of chemicals, fertilizers, and pesticides.Basic knowledge of ornamental horticulture and skill in the performance of a wide variety of gardening tasks.Knowledge of workplace safety and appropriate safety protocols.Must know how to operate basic power tools.Consistently demonstrate excellent technical knowledge of the job.Ability to identify common plants, be able to identify insect or disease conditions on plants.Desire and ability to provide high-quality service.Strong attention to detail and organized, with great time-management and problem-solving skills.Ability to safely operate equipment such as mowers, trimmers, edgers, pruners, chainsaws, and blowersAble to work in both large and confined spaces.Physical stamina and mobility including the ability to reach, kneel, squat, crouch, bend and crawl.Able to respond to requests in a timely fashion and follow through until completed.Can show flexibility and go the extra mile when needed to get the job done.OUR CORE VALUES: Principal's FirstAbility to stay focused on meeting and exceeding Highly Private Principals/Clients needsLearn from mistakesAble to admit mistakes upfront and seek the truth. Learns and grows from mistakes. Makes thoughtful choices and provides solutions to avoid future mistakes. Keeps improving.ConscientiousFinishes duties mindfully, effectively and promptly.DedicationShows a deep commitment to the role and people.AccountableTakes ownership of tasks and time for Due diligence.IndependentThinks and acts independently.ResilienceDo not complain or shy away from assigned work. Confronts difficulties with a positive outlook. When the going gets tough the tough get going.Job Types: Full-time, Part-timePay: $30.00 - $38.00 per hourBenefits:Health insurancePaid time offSchedule:8 hour shiftMonday to FridayWeekend availabilitySupplemental Pay:Bonus payWork Location: One location", "url": "https://www.indeed.com/viewjob?cmp=Excellence-Services,-LLC&t=Handyman&jk=3a8119a9a701688d&vjs=3"},
{"job_title": "Packer - 1st, 2nd, 3rd shift - $17.50-$19.00/hr", "summary": "Pack boxes, erect cartons, assist on startups, shutdown, and product changes.\nMaintain a clean and organized work area.\nUse hand saw to cut material.", "company": "Associated Materials", "location": "Ennis, TX 75119", "job_description": "Company Description\nWith a legacy of over 70 years in business we are proud to announce that due to growth and continued business we are hiring for Extrusion Operators at our Ennis, Texas location. This position is a full time 1st, 2nd, or 3rd shift position working in an environment with multiple departments to create a cohesive work place for its associates.\nAt Associated Materials we create, develop, manufacture, extrude, and distribute beautiful siding, windows, and more throughout our network in North America and Canada. Our facility in Ennis consists of roughly 150 employees that demonstrate our company culture of safety, quality, teamwork, and dedication. If those things are important to your career apply now!\n\nJob Description\n\nPack boxes, erect cartons, assist on startups, shutdown, and product changes\nMaintain a clean and organized work area\nPerform line quality checks\nConduct box count and output data regularly\nUse hand saw to cut material\n\nQualifications\n\nHigh School Diploma, GED, or work equivalent work experience\nSafety oriented\nAble and willing to work overtime\nAble to work in a hot, fast paced eviornment on feet 8 or more hours a day\nAble to use small hand tools\nAdditional Information\nBenefits of Working with Associated Materials\n$17.50-$19.00/hr\nOpportunity for growth\nLong standing business model in a changing market\nPremier company culture\nMedical/Dental/Vision\nPaid Time Off, Holiday Pay, Month Bonus\n#AM-EnnisPlant", "url": "https://www.indeed.com/viewjob?jk=8ec8ae8773caa503&q=Labor&l=USA&from=web&advn=1319158078966022&adid=364978274&ad=-6NYlbfkN0A4LF-RvfOcb8oQSBrxobfMbWvqkkzD2dDPK2Yf6KRznVkGnoU1KdBfrG9SKg0vgfaFOavanv1JQJds4BLXKZs_N41TZnA4r2lRheaZmEPonSiSA6pbztve2Wa5Rus9CkOmrpP6cg6RoahvvYBrjfx40_WhY2_xf-mkQc7Leu20Qx_8SOAQZXWmGygu1sbPsbBDNV9h5sYCBkJnUsmVZaZE8YRSq9V7sGhpqZirr0GzEbeQ7gCOz7LtHKI3b_WrJeTjBHQyrmZOLjAFh4hQcMlmjJPj3aVuOjAy0W_tkwtzffVBrPpV76LKwpFUKGXUBrhS-B5T3hMtnlnEX3c0d5EhBmU9LnmiAJNPq9xT3stDrsUbIa0VqzI6&sjdu=MEvlGseK1kdQEje15qlIOH-N481WKKPaaCOYTv3Jum_YFYkChZug_7PeAGooua0MBm4QDsodmv7h0IKr6l92El55LEX1JHx2rpNWbEgOm-Gm71AbkFI9wU2-7vZERCfk3EV4BGkEdbjCOXGMKt5Ynw&acatk=1frerl9ofu299802&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "newZaxby’s Food Service Worker", "summary": "As a Cook, working for an independently owned and operated Zaxby's, you will assist with all food preparation so that all food meets, or exceeds service…", "company": "Zaxby's", "location": "Apopka, FL 32703+1 location", "job_description": "Zaxby's is now hiring individuals with kitchen experience!\nAs a Cook, working for an independently owned and operated Zaxby's, you will assist with all food preparation so that all food meets, or exceeds service standards. No experience? No worries! Through our extensive training program, you will be blazing through our kitchen in no time. Our managers and team trainers will be there every step of the way.\nApply Now and become a part of the Zaxby’s Family!\nAre you looking for just some extra cash?\nDo you have experience working in a kitchen?\nDo you want to learn how to cook?\nDo you need a flexible schedule?\nDo you want to be part of something new and exciting?\nIf you said YES to any of the above, this could be an opportunity for you, apply now.\nJob Types:\nPay: $12.00 - $13.00+ per hour; based on availability and experience\nFull-time, Part-time\nPerks:\nFree meals on days worked\nFlexible scheduling\nManagement training program with a fast-growing company\nQuarterly reviews\nSchedule:\nDays/Nights/Weekends availability", "url": "https://www.indeed.com/viewjob?jk=fae5882a8e2b38fd&from=serp&vjs=3"},
{"job_title": "General Construction Worker", "summary": "We are looking to hire a few well-qualified individuals seeking FULL-TIME employment.\nAreas of construction include maintenance and repairs at various homeowner…", "company": "Humburg & Associates", "location": "Los Angeles, CA", "job_description": "Humburg & Associates Inc, general contractors, has a long standing reputation and is a well-established company that has been in business for 33 years specializing in property management repairs and maintenance for homeowners associations throughout Southern California.We are looking to hire a few well-qualified individuals seeking FULL-TIME employment. Areas of construction include maintenance and repairs at various homeowner associations throughout Southern California. Some of the types of work that we do are wood repair, concrete, stucco, drywall, painting, welding, and numerous other trades. Our main office / warehouse is located in the city of Fullerton and the job sites are predominantly Los Angeles and Orange Counties. Qualified employees must be punctual, reliable, able to follow instructions, and have the ability to work well with others or independently depending on the particular job need.SALARY NEGOTIABLE upon job offer.Job Type: Full-timePay: $20.00 - $30.00 per hourBenefits:Paid time offSchedule:8 hour shiftDay shiftMonday to FridayAbility to commute/relocate:Los Angeles, CA: Reliably commute or planning to relocate before starting work (Preferred)Education:High school or equivalent (Preferred)Experience:Construction: 1 year (Preferred)Work Location: Multiple Locations", "url": "https://www.indeed.com/viewjob?jk=6b414a3ac1196593&q=Labor&l=USA&from=web&advn=1999438061081825&adid=382792183&ad=-6NYlbfkN0C1EkyvPV2ioOQoAjaNuBYSImgVdKKvZL2x66aSMLn64o7V5QSc39tKC_wKYywURUZ1R4p9ca9jnJOaZrNUe_kTr_TfksypCXH1ZM2cwhbGhHm_JicrdZ1lwObAY7-aq97M8dKh8ev3rcCeS_nUugrm_xIN5lU9fSs08BbHozDMbhSxRT83x00_6YNuC0zZ9Hji-XIxrPHqH4-uuqi6qy1ZZjkoxzl6_QeVDhzSASAd4Etyd_0StNpuXmAgZ5344ehdbVlmfcQ6mAIdMz7s45tOSFmwrAcnItE1ZKGU6NNB_G4TtjEmEY6qm6MGerzG-taG-Ai0uu3q7N90Hb85boodokzobMabD4mz6XmaaIIW7Q%3D%3D&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "Concrete Laborer", "summary": "Your ability to meet job specifications and make top class finishes in concrete work will ensure your success.\nUsing wire mesh to reinforce the concrete.", "company": "Rewards Luxury Development", "location": "Olympia Fields, IL 60461", "job_description": "WE ARE A RESIDENTIAL CUSTOM DESIGN HOME BUILDER, BUILDING 15 SINGLE FAMILY RANCH HOUSES!We are looking to employ a Concrete Laborer to be responsible for designing and building forms, pouring concrete, then spreading and smoothing it using trowels or other tools. You may also be required to apply stains to finish the concrete, adding small stones for decoration, and concluding the process by applying waterproofing and sealants.To be successful as a Concrete Laborer, you should be up to date with the latest technology involving concrete work, possess the knowledge and skill of a specialist in the field, and maintain a high standard of work. Your ability to meet job specifications and make top class finishes in concrete work will ensure your success.Concrete Laborer Responsibilities:Designing and building forms.Setting up the forms.Pouring concrete.Using wire mesh to reinforce the concrete.Spreading and smoothing concrete.Molding expansion joints and edges.Using stains or colors to add the finishing touch.Adding small stones or other materials for decoration.Applying waterproofing and sealant to protect the concrete work.Monitoring the material to ensure it hardens to a durable finish.Concrete Laborer Requirements:High school diploma.3-year apprenticeship under journeymen workers.2,000 hours of hands-on experience.Ability to perform strenuous tasks with your hands.Ability to kneel, bend and lift heavy materials.Ability to measure accurately and read specifications.Job Types: Full-time, Part-timePay: $55.10 per hourBenefits:401(k)Dental insuranceHealth insuranceVision insuranceSchedule:8 hour shiftMonday to FridayExperience:Concrete forming: 4 years (Required)Concrete finishing: 4 years (Required)Language:English (Required)Work Location: One location", "url": "https://www.indeed.com/viewjob?cmp=Residential-Developers&t=Concrete+Laborer&jk=3672a7b9b70dfe67&vjs=3"},
{"job_title": "Food Service Helper", "summary": "Prior food service experience preferred, but not required.\nThe ability to collaborate and problem solve while maintaining a professional and even temperament.", "company": "Arlington Central School District", "location": "Lagrangeville, NY+1 location", "job_description": "The Arlington Central School District is currently recruiting for a Food Service Helper at its Arlington High School. The successful candidate will need to possess:\nThe ability to work well with others\nThe ability to follow directions\nThe ability to collaborate and problem solve while maintaining a professional and even temperament\nA Positive attitude\nGood attendance record\nPrior food service experience preferred, but not required\nFor the full job description please see: Food Service Helper\nPosition Start Date:02/17/2022\nApplication Deadline:02/17/2022\nCivil Service Title: Food Service Helper\nJob Number: CWA FSh AHS 1-21-22", "url": "https://www.indeed.com/viewjob?jk=627fffb1a195c497&from=serp&vjs=3"},
{"job_title": "newSlate Roofing Laborer", "summary": "No experience needed, training provided.\nA valid driver's license that qualifies for coverage from our insurance (typically 4 points or less) is preferred but…", "company": "The Durable Slate Company", "location": "Columbus, OH 43232 (Eastland area)+1 location", "job_description": "Are you looking for a job that can lead to a career? The Durable Slate Company is currently hiring Slate Roofing Laborers! No experience needed, training provided. Great starting pay and lots of growth potential!\nCORE REQUIREMENTS:\nA valid driver's license that qualifies for coverage from our insurance (typically 4 points or less) is preferred but not required.\nMust be able to carry 50 lbs regularly.\nMust be willing to travel and work over time.(Per Diem and travel expenses paid).\nMust be able to pass a pre-employment drug screen and random drug screens.\nWE OFFER:\nSTARTING PAY RATE OF $18 - $20/HR.\nQUARTERLY TRAVEL BONUSES, SATURDAY WORK BONUSES AND PERFECT ATTENDANCE BONUSES.\nUncapped Over Time and we work through the Winter.\nHealth, Vision, Dental Insurance and 401(k) after 90 days.\nPromotions based on performance, not tenure.\nIn house training and apprenticeships.\noqflaaCVTV", "url": "https://www.indeed.com/viewjob?jk=bdf25c4ecf7220d7&from=serp&vjs=3"},
{"job_title": "Laborer", "summary": "You will perform tasks such as lifting and carrying, and loading and unloading leather into specialized processing machines, pushing and pulling loads between…", "company": "Hermann Oak Leather", "location": "St. Louis, MO 63147 (North Riverfront area)", "job_description": "factory Laborer We are looking for a Factory Laborer to join our team, to support production of the top quality vegetable tanned leathers in the world for the equestrian trade, holster manufacturers and personal leather goods markets.You will perform tasks such as lifting and carrying, and loading and unloading leather into specialized processing machines, pushing and pulling loads between processing stations, and supporting work for the process. Pieces of leather weigh approximately 40 lbs. daily production is 550 pieces. Most tasks in the plant do not require 8 hours to complete, so expect to perform several different tasks in the average work day. The ideal candidate will have a strong work ethic, good attitude, and work well with others.ResponsibilitiesTreat other employees with respect at all timesWork safely and support other employeesFollow directions to maintain safety and quality production of our products.Consistently report for work on timeStay on task until each task is finished. Report to supervision when ready for another task.SkillsAbility to lift and carry 40-50 pounds repeatedly throughout shiftAbility to follow direction for safety and maintaining qualityAbility to push and pull loaded trucks between processing stationsAbility to effectively communicate with and work with others''Work Location:One locationWork RemotelyNoJob Type: Full-timePay: $19.20 - $20.05 per hourBenefits:401(k)401(k) matchingDental insuranceEmployee assistance programFlexible spending accountHealth insuranceLife insuranceVision insuranceSchedule:8 hour shiftDay shiftMonday to FridayCOVID-19 considerations:Following CDC recomendations. Mask should be worn by unvaccinated employees.Application Question(s):can you pass a pre employment drug screen?Work Location: One location", "url": "https://www.indeed.com/viewjob?jk=391f785739ed2628&q=Labor&l=USA&from=web&advn=7991657589093261&adid=379183785&ad=-6NYlbfkN0D6SN8bQlwiqKxrSxwGbgDwE_pBGvIbDa-amvg2BpFox4ogi_A2raLa5mRqOPgYbuC3e71SnJ6oMgFGSX4PfKCGTAqk3t6U5poaCApfUeZq1eMUJHwQx_zvX4UGJljgGZZEDgMiQ2WOTn-U5v_0h-xSQpkTtDcDm472CH7Jit8KbhMG84mrlb99wPzzx9sG_Z6T_DCJQW8VFrDsdTaodekmdFU5HRSZfwY2jmcfMO80StgKdkoK6rnU2W55i2MlMhEDFztVCFWSHaOilQR3NoekB4tWIAZPPZWumM6EowXsZa_W0ogYdbTjilPJoijkSiiZgN1AIx6Inf4hGfRCiKA2ekuULdKcFiL3p7W_ZNPs6Sty_3X7nB0K&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "newPorter, Central Park Tower", "summary": "The Porter maintains the overall appearance of the common areas of the property to include daily cleaning; trash and recycling removal; and the regular…", "company": "Extell Development Company", "location": "New York, NY 10019 (Midtown area)+3 locations", "job_description": "Company: Extell Management Services, Inc.Location: Central Park TowerAddress: 217 W 57th Street, New York, NY 10019Job Title: PorterReports To: Resident ManagerThe Property: Professionally managed by Extell Management Services Inc., Central Park Tower is a new architectural landmark rising 1,550 feet above New York City, establishing it as the tallest residential building in the world. Elegant and graceful, its strong presence positions Central Park Tower as a powerful and poised statement along the Manhattan skyline.Extell Management Services, Inc. is a sophisticated and intuitive management team that reinforces the commitment to maintain the quality of each Extell development that it oversees. The management portfolio includes New Yorks most recognized high-end condominium, rental, and commercial addresses for Extell Development Company. Founded and headed by Gary Barnett, Extell Development Company is a nationally acclaimed real estate developer of residential, office, retail, and hospitality properties, operating primarily in Manhattan and other premier cities across the nation. Experiencing outstanding growth since its founding in 1989, the companys growing portfolio exceeds twenty-five million square feet.To learn more, visit https://centralparktower.com or https://extell.com.Scope of Position: The Porter maintains the overall appearance of the common areas of the property to include daily cleaning; trash and recycling removal; and the regular inspection of furniture, décor and other fixtures for any needed repairs or deep cleaning. The Porter also documents and reports any safety, physical appearance or maintenance issues; ensures a sufficient inventory of cleaning and other related supplies; assists residents and guests with various package, dry-cleaning, newspaper, luggage and other various deliveries; staffs the service elevator as required; assists with emergency response service needs, such as sidewalk snow removal; and performs other duties as assigned.Qualifications/Education Requirements: Ideal candidates for the Porter position take pride in ensuring clean and safe surroundings and delivering a 5-star client experience to our residents and guests. Requirements for the position include:A minimum of 2 years in working in a luxury hotel or residential environment.Ability to maintain confidentiality of all resident and guest information at all times.Must possess a basic knowledge of building systems.A high school diploma or GEDA basic knowledge of computer programs such as Microsoft DOS, Office, Windows etc.High attentiveness to detail,Strong customer service skills.The ability to adapt to changing needs,The ability to lift objects up to fifty (50) pounds without assistance.Benefits and Compensation: Central Park Tower offers competitive pay ranging from $19.84 - $26.45 per hour and benefits to include medical, dental, and vision. Apply now!Equal Opportunity EmployerJob Type: Full-time", "url": "https://www.indeed.com/viewjob?cmp=EX-Utah-Development-LLC&t=Porter&jk=2e8da82f82ffde5c&vjs=3"},
{"job_title": "farm tractor drivers (vineyard harvest)", "summary": "Conducting daily safety and mechanical operational checks of each vineyard tractor operated.\nResponsible for safe and efficient operation of each tractor…", "company": "AgriAmerica", "location": "Silver Creek, NY 14136", "job_description": "Duties include but are not limited to:\nconducting daily safety and mechanical operational checks of each vineyard tractor operatedresponsible for safe and efficient operation of each tractor operated in a vineyard setting\nthe work schedule will vary, day and night over a 24 hour period as it relates to the delivery schedule of the grapes being harvested\nability to notice and report safety and mechanical concerns during vineyard tractor operationmust be able to occasionally lift 50 pounds\nassist in the clean-up, repair and maintenance of various types of vineyard harvesting machines\n\nDue to the nature of the harvest season vineyard tractor drivers must have the emotional and physical endurance necessary to work long hours in various weather conditions. Drivers are required to maintain pleasant communications at all times when dealing with customers and co-workers.\n\nAll vineyard tractor drivers are subject to a random drug and alcohol testing program.\n\nHiring Harvest Season drivers.\n\nJob Types: Full-time, Temporary", "url": "https://www.indeed.com/viewjob?jk=29a6085a1e63ca28&from=serp&vjs=3"},
{"job_title": "Labor", "summary": "We have over 100 years of industrial experience on projects as small as $500 and as large as $40M, performed in every time zone of the United States.", "company": "Bilfinger", "location": "Remote in Inwood, WV", "job_description": "Labor\nLocation: Inwood, West Virginia\nBilfinger is a leading international industrial services provider, active primarily in Continental Europe, Northwest Europe, North America, and the Middle East. With over 4,500 skilled employees in North America, Bilfinger delivers its services across multiple industries that include petrochemical, oil & gas, consumer goods, energy and utilities, and government services. Bilfinger has offices in 40 states, and our project portfolio covers the entire value chain from consulting, engineering, manufacturing, assembly, maintenance, plant expansion, and turnarounds to environmental technologies and digital applications. We have over 100 years of industrial experience on projects as small as $500 and as large as $40M, performed in every time zone of the United States.\nResponsibilities:\nSafety is a priority: employee must understand construction risks and bring them to the attention of their supervisor.\nConstruction clean up\nFirewatch/ Flagger\nSupport skilled tradesmen in completing their tasks\nPerforms other duties as assigned\nQualifications:\nKnowledge of relative safety standards and willingness to use protective clothing (face-shield, gloves, etc)\nQuality minded, positive team player, safety conscious and production focused\nExcellent communication skills\nPlease reach out to Velma Arismendez (velma.arismendez@bilfinger.com) in case of any questions related to this position.\nBilfinger Industrial Services Inc. is an Equal Opportunity Employer – M/F/Veterans/Disabled. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability, protected veteran status or other legally protected characteristics.\nThis employer participates in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S.\nIf E-Verify cannot confirm that you are authorized to work, this employer is required to give you written instructions and an opportunity to contact Department of Homeland Security (DHS) or Social Security Administration (SSA) so you can begin to resolve the issue before the employer can take any action against you, including terminating your employment.\nEmployers can only use E-Verify once you have accepted a job offer and completed the Form I-9.\nFraudulent employment offers\nWe are aware that fraudulent employment offers are being transmitted via email by people claiming to be employees or representatives of Bilfinger. Prospective candidates are provided job descriptions and employment letters and are asked to complete and return employment information forms as well as official tax forms. These job offers may look genuine and could include names of Bilfinger legal entities, Bilfinger executives, their signatures, seals of “authenticity”, the Bilfinger brand and logo.\nPlease be advised that these communications are FRAUDULENT and are NOT sent from anyone within or affiliated with Bilfinger. These email messages are a scam and should be treated as such. Bilfinger does not make job offers via social media, unsolicited email or without personally interviewing candidates first. We never send you cheques in order to pay contractors to set up a home office. Never send money or pass on personal details to anyone suggesting they can provide employment with Bilfinger, and never reply to an email address that does not end in @bilfinger.com.\nIf you receive such a message, you are advised to contact your local law enforcement agency and provide any details you may have. You also may forward the messages to compliance.helpdesk@bilfinger.com.\nIf you are interested in an employment with Bilfinger, please submit your application in the safe environment of our global job portal only.", "url": "https://www.indeed.com/viewjob?jk=2760f6a21b1365c8&from=serp&vjs=3"}