[
{"job_title": "newMover/Packer/Driver", "summary": "Must have a good attitude during arduous physical labor.\nPerform manual labor 6-10 hours a day in extreme weather (heat/cold).\nMust be over 18 years of age.", "company": "Swan Moving Services", "location": "Terrell, TX+2 locations", "job_description": "********************$1000 SIGNING BONUS*******************The SWAN Moving Services working environment requires endurance, perseverance and a MOST IMPORTANTLY a good attitude. We serve our customers with kindness, respect and integrity.The following are requirements for becoming a crew member:1. Must be able to lift and carry at least 50 pounds on your own2. Perform manual labor 6-10 hours a day in extreme weather (heat/cold)3. Must have a good attitude during arduous physical labor4. Must be over 18 years of age5. Pass a background and drug test (Initially and periodically)6. Must have worked less than 3 jobs in last 2 years.7. Experience pulling a trailer is a HUGE bonus (bumper pull or goose neck).8. No prior felony or misdemeanor convictions.Benefits of working with the SWAN crew:1. Work with an Outstanding Team2. Flexible schedule3. Growth potential4. Get paid to work out5. Customer tips for outstanding serviceSWAN Moving Services, LLC provides a top-notch moving experience from start to finish by providing outstanding customer service and taking meticulous care of customer furniture and belongings.Job Type: Full-timePay: From $750.00 per weekJob Type: Full-timePay: From $750.00 per weekBenefits:Flexible schedulePaid time offSchedule:8 hour shiftWeekend availabilitySupplemental Pay:Signing bonusTipsEducation:High school or equivalent (Preferred)Work Location: Multiple Locations", "url": "https://www.indeed.com/viewjob?cmp=Swan-Moving-Services&t=Mover+Packer+Driver&jk=1121a210b1b53efe&vjs=3"},
{"job_title": "TS/SCI Security Escort", "summary": "Remain alert and awake at all times to provide appropriate security monitoring of escorted individuals.\nProvide verbal and written reports regarding pertinent…", "company": "Falken Industries LLC", "location": "Manassas, VA 20109+1 location", "job_description": "Falken Industries is a security provider for the United States government and their clients, focusing on DHS,DOD, and IC objectives.\nFalken pays every week through direct deposit and promotes from within.\nMust have an active TS/SCI with ability to upgrade.\n$42-$48/hr (1.5x rate for OT)\n\nThis is a temporary position (Transfer to different site possible upon completion of contract). Contract begins Nov 29 and ends in late January 2022.\n7AM ? 5PM workday (with a 30-45 minute lunch)\nFederal holidays off\n\nDuties:\nMonitor and escort uncleared persons at the facility\nProvide verbal and written reports regarding pertinent safety, security, facility, or personnel issues/incidents\nMaintain visual contact and proper line of sight with uncleared personnel at all times.\nRespond professionally and courteously to all personnel\nRemain alert and awake at all times to provide appropriate security monitoring of escorted individuals.\nWalk/Stand for up to 8 Hours\nWear appropriate work attire (Company provided)\nPerform all other position related duties as assigned or requested.", "url": "https://www.indeed.com/viewjob?jk=08ae1e937aef5d63&from=serp&vjs=3"},
{"job_title": "newAircraft Cleaner", "summary": "Exceed PrimeFlight customer service and safety standards.\nReasonable accommodations may be made to enable individuals with disabilities to perform the essential…", "company": "PrimeFlight Aviation Services Inc", "location": "Tampa, FL 33607+43 locations", "job_description": "$200 Referral Bonus after 60 days!$500 Sign On Bonus after 60 days!Essential Functions: As a valued member of the PrimeFlight team an Aircraft Cleaner will join the airport team to do the following:Direct lift truck movement and positioning in the AirportRemove all trash from aircraftClean and restock all lavatoriesClean galleyClean all seats, seat back pockets, tray tables and replace soiled magazinesFold blankets and store blankets and pillows in overhead compartmentsClean aircraft floorDemonstrate regular, predictable attendance at job locationExceed PrimeFlight customer service and safety standardsCarry out other duties as assigned*Competency: *To perform the job successfully, an individual should demonstrate the following competencies: Problem Solving, Customer Service, Interpersonal, Oral Communication.*Qualifications: *To perform this job successfully, an individual must be able to perform each essential function satisfactorily. The requirements listed in this Job Description are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.*General Qualifications: *18 years of ageReliable transportationEligible to work in the United States*Education/Experience: *N/A*Language Ability: *Ability to read and interpret documents such as safety rules, operating and maintenance instructions, and procedure manuals. Ability to communicate effectively in English.*Reasoning Ability: *Ability to apply common sense understanding to carry out instructions furnished in written, oral, or diagram form. Efficient, immediate problem-solving capabilities.*Computer Skills: *No skills needed.*Certificates and Licenses: *No Certificates or Licenses required.*Supervisory Responsibilities: *No supervisory responsibilities associated with this position.*Work Environment: *The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.The noise level in the work environment is usually moderate but may become high at various times. Employee must be willing to wear/utilize company-supplied personal protective equipment (hearing protection) to mitigate their noise exposure.Some work is in an outside environment, with exposure to hot and cold temperatures and inclement weather.Physical Demands: The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.Walk and climb up and down a minimum of 500 stairs dailyWalk, stretch, and bendLift and carry up to 50 poundsBe able to work in tight spacesReach above head, full extension (72 inches) with armsUse hands to finger, handle, or feelBe able to hear and respond to the spoken voice and to audible alarms generated by terminal environmentSpecific vision abilities required for this job include: Close vision (clear vision at 20 inches or less); distance vision (clear vision at 20 feet or more); color vision (ability to identify and distinguish colors); peripheral vision (ability to observe an area that can be seen up and down or to the left and right while eyes are fixed on a given point); depth perception (three-dimensional vision, ability to judge distances and spatial relationships); ability to adjust focus (ability to adjust the eye to bring an object into sharp focus)Shift: Day (Early mornings) and (Midday) ShiftPay: $11/hr.#PF_NOWJob Type: Full-timePay: $11.00 per hour", "url": "https://www.indeed.com/viewjob?jk=86f5331e2d38522f&q=Cleaner&l=USA&from=web&advn=1126635682454199&adid=382524549&ad=-6NYlbfkN0CMPFH6W8i_9piDVKePwwLsfmbG0kzaRnSxhYNUDdwBka6rrz0jJD3vFfLgkviWSGm-gKkCiFftgYnCe9aez7ZrsyXGbZalluWH3sNnORWp-aEN4YOCMUWuEZh02c6S1qvoD1ak2EG1U1G3srUybzF-RV2_GX_5A9vY1QkVqUku7dyXfr3Js24-QNO8aeXUQGHsG9H0UutW6nTHKV5HA6se5H4SAqb2T3z7WbJV3mfJv1nv03ofeBFdgBKaIt0wWzBtY2BJF-rMLdPMSOB8TcUtkJJc36ej40rD5-mraaZxAhj4M9DZuliXvG6IbLqiDIYO1ZjbsdnoJm9QPtRWC1rpSN1-x1-O7YLj5G2gWVgsTfl2nmCvWlJ4&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "new✨ Full Time Maid/House Cleaner: Weekly Pay (Lexington)", "summary": "Work for a company where others have chosen to stay for a long time.\nAnd with people like that, we provide excellent, dependable, recurring house cleaning…", "company": "Top Mops Cleaning Service", "location": "Lexington, KY", "job_description": "If you are from the Home Health Aide, Hotel Housekeeping, or Childcare/Daycare industries, you will find us A Very Warm and Welcome Change!We are so glad you are considering Top Mops Cleaning Service for employment. We are growing and adapting along the way, in order to be a place where our team members can rise, day after day, year after year. This could be a great opportunity for you. Read on to see if you are a good fit.My family started the business in 2012 to simply start a business. Why not house cleaning? I realized within a month that our promise of great customer service could only happen by finding people who loved the mission and had similar values as our company. As we found those people--caring, kind, consistent, truthful, and flexible--the company grew. And with people like that, we provide excellent, dependable, recurring house cleaning services every day. Our team is why Top Mops effectively serves Lexington-area customers.OUR COMMITMENT: Choosing only the best people—caring, honest, consistent, teachable, flexibleTraining and developing our team to be people of excellence in life. Helping them rise is our mission!Professionalism—providing competent, reliable and respectful cleaning servicesOUR MISSION: To help our staff rise and to help our customers rest!OUR VALUES: Act Consistently. It leads to reliability, predictability, and ultimately customer loyalty.Go after Truth. It has two sides—telling the truth and listening to the truth.Respond Kindly. We treat our customers, our employees and our community with kindness and respect.Flex with Change. Receive the unexpected with grace. Flex your response. Adapt to change.Here are a few reasons you'll love working with us: Work for a company whose primary mission is to help you riseWork for a company who cares about youWork for a company with excellent moralsReceive a living wage (can earn up to $750 - $850 weekly) by direct depositGet paid for trainingNo nights, no weekendsExperience rewarding relationships with customers and fellow employeesLots of physical activity as you work (no one makes you sit at a desk).Daily experience time between jobs to step outside and get fresh air, regroup, and drive to a new locationWork for a company where others have chosen to stay for a long timeLearn strategies to increase opportunities for tipsWe are partners of Cleaning for a Reason. Top Mops is a proud member Cleaning for a Reason, America’s only foundation dedicated to cleaning homes for people fighting cancer. In 2012, Top Mops was the first central KY maid service to become a Cleaning For A Reason partner. Top Mops has provided over $30K of house cleaning free of charge to people battling cancer in the Lexington area.Top Mops has been recognized as a local Reader's Choice finalist as a one of the best cleaning companies in Lexington.We're looking for great people who are Kind, Consistent, Truthful and able to Flex with change! Come join our friendly team of house cleaning pro's! We look forward to meeting you!Details about the job: Monday - Friday 8 - 5Service Area: Lexington, north Nicholasville, east VersaillesMust be comfortable working independentlyFull Time positions ONLYHard work and motivation are a mustHouse cleaning can be tiring so serious applicants must be able to consistently lift 20 lbs, bend, kneel, and twist while performing the necessary cleaning duties throughout the day.Pay: $750-$850 once full-time (typically within 6 weeks but it is dependent on you and how quickly you implement our training, and your consistent availability)Must Have: Driver's licenseJob Type: Full-timePay: Up to $850.00 per weekSchedule:Day shiftWork Location: Multiple Locations", "url": "https://www.indeed.com/viewjob?cmp=Top-Mops-Cleaning-Service&t=Maid+House+Cleaner&jk=e4b3eb4b534174af&vjs=3"},
{"job_title": "Caregiver Hiring Immediately- No Experience Needed", "summary": "Establish and maintain effective and professional communication and a strong relationship with clients, family members, and co-workers.", "company": "Honor", "location": "Monterey, CA+2 locations", "job_description": "Earn up to $830 / week plus a $300 Signing Bonus!Looking to work for a home care company that values passion and rewards its caregivers with flexible scheduling, amazing benefits, consistent hours, and 24/7 support? Join Honor as a Caregiver, we are hiring immediately!Join a growing home care agency where you're valued and your work makes an impact on people’s lives—including your own. We are currently looking for compassionate and dependable caregivers who are ready to begin working in Salinas, Monterey, and surrounding areas.As a Caregiver, we highly encourage you to foster genuine relationships with the seniors in your community. We’re relying on you to do your best to keep every senior client healthy, safe, happy and independent at home. If you’re ready to join us in making a difference in older adults’ lives, we’d love for you to apply!Caregiver Benefits: $200 Signing Bonus after working 20 hours in your first 14 days, plus an additional $100 Signing Bonus if HCA-RegisteredPaid Training to begin or grow a career in caregivingMedical/Dental/Vision Benefits & 401k Matching, based on eligibility9 Holidays Paid at the rate of 1.5xWeekly PayDirect DepositPaid OvertimeCaregiver Referral ProgramCell Phone Reimbursement24/7 SupportCaregiver Responsibilities: Establish and maintain effective and professional communication and a strong relationship with clients, family members, and co-workersProvide personalized in-home support to senior clientsHelp client with all personal care needsHelp keep the client's environment clean and organizedRemind client to take self-administered medicationsSuccessful applicants will meet the following requirements: Effective November 30, 2021, due to a state mandate all Care Pros will be required to be fully-vaccinated against COVID-19 in order to provide care to clients in CaliforniaMust be 21 years or olderWe respect our caregivers and treat them like true professionals. You care for others, let Honor care for you! Join our team as a Caregiver. Apply today!*Top caregivers have full schedules with overtime opportunities. The more hours you work the greater your weekly earnings.Job Types: Full-time, Part-timePay: $16.00 - $16.75 per hourBenefits:401(k) matchingDental insuranceEmployee assistance programFlexible scheduleHealth insuranceReferral programVision insuranceSchedule:10 hour shift12 hour shift8 hour shiftDay shiftHolidaysMonday to FridayNight shiftOvertimeWeekend availabilitySupplemental Pay:Bonus paySigning bonusCOVID-19 considerations:We’re ensuring that all Care Pros have supplies such as thermometers, and we are paying for flu shots if they need one. We’ve also rolled out a program to provide masks for Care Pros to wear at every shift.Work Location: Multiple Locations", "url": "https://www.indeed.com/viewjob?jk=e27d2f7f9e712793&q=Worker&l=USA&from=web&advn=9410817544348995&adid=382723354&ad=-6NYlbfkN0CnvVM1S6R2UOPuGGr58ZWmcFZDnsq3aLjqSdiGhdgGJqJPet_FFZhX7rOykG1-isyWvBd4RxAPuvzLOfSSp2njbHeZigo6yj83mncb_ldS_y7jRUcyDykGlQwzyjrR46eRWnEQQfPPqAGOcNu_WNQK0e9SrcdTFUdJiO-qA0fM-kFCXHHNck_Nn9mPDJdLH4toLNL5W4fXI6TCjEc5_oCmuDL1l0CZXvrUHbGp8zbIYFIu08Ly7k110swWHekh6Twshccil7UmMlhye_1ZpkYcYQFyHXErw6hDuB6ZTsXO4bUfK0u48OTrYRGUUfJsxmPDOfVZP9lu57b4m3gm5oZQHi4GEkXD1gSuLqNs2AmYautpxmOEkmI5&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "Greeter/Host/Hostess", "summary": "Houston's Restaurant in Irvine*, is currently seeking Maître d’ / Greeter candidates to join our successful team.\nWe look forward to meeting you soon!", "company": "Houston's Restaurant", "location": "Irvine, CA 92612 (San Joaquin Marsh area)+3 locations", "job_description": "Houston's Restaurant in Irvine, is currently seeking Maître d’ / Greeter candidates to join our successful team.Energy, poise, and an elevated sense of personal style are important.Upscale restaurant experience can be a plus, but these roles are open to candidates from all backgrounds.Compensation commensurate with experience ($38-$40/hour)Medical/dental benefits are available after an introductory period.Part-time and full-time positions available. Some weekend availability is required.To learn more, visit us at www.hillstone.com, or read this profile in Bon Appetit magazine: http://www.hillstone.com/press/bonappetitWe look forward to meeting you soon!Job Types: Full-time, Part-timePay: $38.00 - $40.00 per hourBenefits:Dental insuranceEmployee discountHealth insuranceSchedule:Day shiftMonday to FridayNight shiftWeekend availabilitySupplemental Pay:TipsExperience:Restaurant Experience: 1 year (Preferred)Work Location:One locationWork Remotely:NoWork Location: One location", "url": "https://www.indeed.com/viewjob?jk=ef8d194b8056c915&q=Food&l=USA&from=web&advn=8937939063231664&adid=374559416&ad=-6NYlbfkN0Dag-ruDzQiO6xfc8MhbXPWdPRu4c57jH9p22WyH1KcnRihu4vsv5Z3cz8goJVTK75WiuLo-Tf97RSpfSmCh5mCs1q4ArK6MwS8pEqHUnNHNxCnibTkUmn2NLgAB6_g2A8_RJSdHtVIH7cnmwafKH0QZKFMCTgGQR73Wmgck7rfItXlBzhHGM9AO6PFmoCo6UROTKDdqCD6yvOP91086efCEa8-QnBfI06c4tiD_tqpNrEPrwdh_CWWYZCnPsBt2kHVUYN34naCUaV4ejymhOtBzG0gKvfzfc_ue7TCEGDjlAD5tkthO6KtSjrvh-92vkIErNjzH1b9xhheOaFHZW5Nwnm5PqekuZPxiYpd8FCDd3SJ6e52bczIh0Eu0Ahv4ys%3D&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
