[
{"job_title": "newHigh School Visual Arts Teacher (2022-2023)", "summary": "We operate high-performing urban public charter schools and a unique graduate school of education that trains teachers for high-poverty schools.", "company": "Match Education", "location": "Boston, MA 02215 (Allston area)+1 location", "job_description": "Position: High School Visual Arts Teacher (2022-2023 Opportunity)Location: Boston, MA (Brighton Campus)Start date: August, 2022 ABOUT THE MATCH CHARTER PUBLIC SCHOOLMatch Charter Public School is a free, high-performing charter public school in Boston. We are a PreK-12 school serving 1,250 students. Our mission is to prepare students for success in college and careers in order to achieve economic security and mobility. Students gain acceptance to our schools via an annual blind public lottery open to all Boston residents.Our families bring amazing racial and cultural diversity to the school community - they represent over 20 different countries of origin with over 20 different languages spoken at home.\n\n94% of our students are people of color. Our students bring a diversity of needs to our school, and we are prepared to serve them. 21% of our students qualify for special education services; 18% of our student body are English Language Learners.We know that the largest driver of our success is the people who work in our schools every day. Match teachers and staff have an immediate impact on our ability of reaching our mission and changing the lives of our students.\n\nWe strive to attract, develop, and retain a team that is diverse by race, ethnicity, culture, income background, gender, sexual identity, and a variety of other factors. See our statement on diversity here. OVERVIEW OF ROLE AND RESPONSIBILITIESWe are looking for a full-time Visual Arts Teacher who can help continue to build the arts program at our high school. The position is based at our high school campus on 1001 Commonwealth Ave.\n\nin Brighton and entails designing and delivering a curriculum for high school students who will have Visual Arts classes during the regular school day.We would like the Visual Arts teacher to offer a mix of classes in visual media. There is a budget available for equipment and supplies. The Visual Arts teacher will: -Design curriculum and teach Visual Arts classes-Teach classes at multiple grade levels-Assist with duties to uphold a positive and safe school culture-Participate in regular professional development, coaching sessions, and faculty meetings-Performs other duties assigned as a member of the school faculty QUALIFICATIONSResearch has shown that people of color and women are less likely to apply for jobs if they dont believe they meet every one of the qualifications described in a job description. Our highest priority is finding the best candidate for the job.\n\nWe encourage you to apply, even if you don't believe you meet every one of our qualifications described or you have a less traditional background. We are looking for applicants who the following qualifications: -Have at least 1-3 years prior experience as an Visual Arts teacher, ideally with high school students-Hold a valid and appropriate license issued by the Massachusetts Department of Elementary and Secondary Education, or obtain the licensure within a year of date of hire-Articulate a clear vision for an high school Visual Arts curriculum-Demonstrate skill in designing and delivering lessons-Demonstrate skill in building effective relationships with students and colleagues-Hold a deep belief that all students can and will succeed-Possess a desire to continually improve their practice as an educator by taking and implementing feedback ABOUT MATCH EDUCATIONMatch Education (www.matcheducation.org) is the shared brand name of The Match Charter Public School, The Match School Foundation, Inc., and The Sposato Graduate School of Education. Match Education is an engine of discovery and applied innovation in education. We operate high-performing urban public charter schools and a unique graduate school of education that trains teachers for high-poverty schools.\n\nOut of this applied work, we refine, validate empirically, and eventually disseminate new ideas and practices on core questions in education reform. The Match Foundation, Inc., The Charles Sposato Graduate School of Education, Inc., and Match Charter Public School prohibit discrimination on the basis of race, color, sex, gender identity, sexual orientation, age, national origin, physical or mental disability, religion, veteran status, and any other class of individuals protected from discrimination under state or federal law in any aspect of the access to, admission, or treatment of students in its programs and activities, or in employment and application for employment.", "url": "https://www.indeed.com/viewjob?jk=13134c4eedca7e87&from=serp&vjs=3"},
{"job_title": "newElection Logistics Worker", "summary": "The position is located in Pearl City on the Island of Oahu.\nAs a condition of employment with the State of Hawaii, all qualified external candidates who have…", "company": "State of Hawaii", "location": "Oahu Island, HI", "job_description": "Recruitment Information\n\nThis posting is for the State of Hawaii, Department of Accounting and General Services, Office of Elections.\n\nThe position is located in Pearl City on the Island of Oahu.\n\nSalary: $2,600 per month\n\nAs a condition of employment with the State of Hawaii, all qualified external candidates who have been given a conditional offer of employment must show proof of full COVID-19 vaccination and shall be fully vaccinated by his/her/their employment start date. A reasonable accommodation will be provided if requested by a candidate and it is determined through an interactive process that pregnancy, a qualifying disability, or a sincerely held religious belief prevents the candidate from receiving a COVID-19 vaccination.\n\nThe State Recruiting Office will refer all inquiries regarding this exempt position to the Department of Accounting and General Services, Office of Elections.\nDuties Summary\nThis position is responsible for providing manpower and logistical assistance in preparing and conducting the 2022 Elections. This position is also responsible for ensuring the operational readiness of facilities to be used for the election and will need to operate a motor vehicle to transport equipment, materials, and supplies. This is a temporary position that does not exceed December 2022.\nMinimum Qualification Requirements\nCitizenship Requirement: The State of Hawaii requires that all persons seeking employment with the government of the State shall be citizens, nationals, or permanent resident aliens of the United States, or eligible under federal law for unrestricted employment in the United States.\n\nKnowledge: Warehouse operations in handling equipment, materials, and supplies.\n\nSkills/Abilities: Understand oral and written instructions; knowledge of basic mathematics; operate a forklift; take physical inventories; foresee occupational hazards and take effective measures to eliminate them; deal courteously and effectively with others; lift and carry heavy equipment, materials, and supplies.\n\nEducation: Graduation from high school or its equivalent.\n\nExperience: One year experience working in a warehouse environment handling equipment, materials, and supplies; and operating a forklift. Hawaii Driver License is required.\nOther Information\nThis position is exempt from the civil service and considered temporary in nature. Therefore, if you are appointed to the position, your employment will be considered to be \"at will,\" which means that you may be discharged from your employment at the prerogative of your department head or designee at any time.\n\nSubmit resumes to:\nOffice of Elections\nAttn: Kristen Uyeda\n802 Lehua Avenue\nPearl City, Hawaii 96782\n\nResumes can also be faxed to (808) 453-6006 or emailed to elections@hawaii.gov\n\nDirect all inquiries regarding this position to:\nKristen Uyeda\nPhone: (808) 453-8683\nMonday - Friday, 7:45 a.m. - 4:30 p.m. (HST)\nEmail: elections@hawaii.gov\n\nNOTE: The State Recruiting Office will refer you to the Department of Accounting and General Services, Office of Elections regarding this exempt position.", "url": "https://www.indeed.com/viewjob?jk=cfc5331778526f14&from=serp&vjs=3"},
{"job_title": "newTrain Electrical Engineer", "summary": "Providing direct inputs to Electrical and Schematic Design engineers for the development of vehicle schematics, including schedule deadlines.", "company": "Segula Technologies", "location": "Naperville, IL+1 location", "job_description": "Job Description\nIn this role you are responsible for the Train Electrical engineering deliverables on projects such as overhauls. You functionally manage a team of electrical engineers and ensure that clear expectations in terms of technical deliverables, schedule and responsibility are defined. You report progress to the project team and the external customer.\n\nQualifications\n\nAccountable for the definition of all train electrical deliverables including schematics, primarily for overhaul projects\nProviding direct inputs to Electrical and Schematic Design engineers for the development of vehicle schematics, including schedule deadlines\nDefining electrical interfaces with Train Control and/or System engineers to ensure electrical functions and systems are adequately integrated\nSupporting the Mechanical Design team for cable routing and cable harness drawings development, as well as the Industrial Engineering team for manufacturing aspects\nEnsuring the train electrical design is compliant with applicable standards for reliability, safety, maintainability and customer requirements\nProviding support to the Production Line, Testing, Procurement and Quality teams\nTravel of up to 10% may be required to support business meetings, Production Line support, or validation and test activities.\nAdditional Information\nAll your information will be kept confidential according to EEO guidelines.", "url": "https://www.indeed.com/viewjob?jk=6b22b5e773efdddb&from=serp&vjs=3"},
{"job_title": "Tree Worker", "summary": "Tree Foreperson Tree Trimmer with a Commercial Driver’s License – Starting pay $40.37.\nTree Foreperson Tree Trimmer with a Class C License – Starting Pay $38.57…", "company": "Mountain F Enterprises", "location": "California", "job_description": "In 1984, Mountain F. Enterprises, Inc. (MFE) was established in Lotus, California, and has blossomed into a full spectrum vegetation management company that specializes in providing services to a variety ofcustomers including federal, state, local agencies, and utility companies. MFE prides itself with employees who are highly skilled, professional and have a work ethic unprecedented in the industry while utilizing top of the line equipment.The MFE team is currently recruiting for a wide range of full-time positions. We are looking for those individuals with experience as well as those that have no prior tree experience but have a passion to learn and want to begin a career in the utility tree industry.Tree Foreperson Tree Trimmer with a Commercial Driver’s License – Starting pay $40.37Tree Foreperson Tree Trimmer with a Class C License – Starting Pay $38.57Specialized Tree Equipment Operator $32.44 - $38.57Tree Climber (2 years minimum experience) – Starting Pay $36.05Apprentice Tree Climber 1-6 months exp– Starting Pay – $25.23Apprentice Tree Climber 6 -12 Months exp – $28.84Apprentice Tree Climber after 12 months - $32.44Ground Person 0-6 months experience - $22.01Ground Person 6+ months experience - $23.43Traffic Control (Flagger) - $22.01$50.00 per day for Per Diem for Apprentices Climbers & Foreperson$25.00 per day for Ground Person and FlaggersTo apply and submit an application, please visit our website at www.mtfent.com/careersMFE offers a competitive benefits package which includes:Medical/Dental/VisionVacationFull Union Pension/Retirement PackageMountain F. Enterprises, Inc. is a drug-free workplace. You must pass a pre-employment drug screen, physical, background check, and have a valid US Driver’s License.for employmentJob Type: Full-timePay: From $22.01 per hourBenefits:401(k)401(k) matchingDental insuranceHealth insuranceVision insuranceSchedule:10 hour shift12 hour shift8 hour shiftDay shiftMonday to FridayOvertimeWeekend availabilityWork Location: Multiple Locations", "url": "https://www.indeed.com/viewjob?jk=2a9c66f4c53e7afb&q=Worker&l=USA&from=web&advn=5558136261453681&adid=379206656&ad=-6NYlbfkN0Bj6kKvXj-goe1pDAgv29bc0negiy65Ek_imM3bA2IhbLzOUQUZJz7fQnYVTdTcgy1sudfYcA5vATKtjBbBt6z1X7ErK8mqPRMWOMZo8Aj1rHpnv3qg-et6B2ACR-pBaP3QgUk0c0_ymj-g7SJpT-H2J_fV0Ta_BCwMtl2YHfLqwPuem2qUgpmF2pRwNrPihwS2sibVZiVPu7z9lhWEe5LFfjWNFveM3avq22VAI-OwpOdVP75L9UgxBC0kD1HKuT9zeUKNyDNm10zoGbJMDDuAqL2giD90jJIn-j-bKsG1FDF8oJJbvxC-OR9cBZqFyngm0adNV4MppcAj0QOxqjAjW2wysZHHG3AjraRm_j8Dyz-Ih0WtLFa6&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "newDesign Engineer", "summary": "Responsibilities include assisting in component design for Honda's high performance race vehicle/powertrain.\nThis includes design concept preparation, component…", "company": "Honda Performance Development", "location": "Santa Clarita, CA 91355 (Valencia area)", "job_description": "Design Engineer(Job Number: HPD00007K)\n\nHonda Performance Development\n\nDescription\nResponsibilities include assisting in component design for Honda's high performance race vehicle/powertrain. This includes design concept preparation, component and assembly modeling, design evaluation and analysis, drawing preparation and release, part manufacturing coordination and other related administrative duties.\n\nQualifications\nBS Degree in Electrical/Mechanical Engineering preferred or equivalent experience. 1-3 years of experience in 2 and 3-dimensional software modelling in automotive industry, preferably in design of electrical, powertrain or vehicle components. Extensive hands on experience with internal combustion race engines, race vehicles and related electronic and mechanical systems. Proficient with PC workstation hardware and CATIA Software.", "url": "https://www.indeed.com/viewjob?jk=8d45659b8b4fa093&from=serp&vjs=3"},
{"job_title": "newParking Enforcement Officer", "summary": "Full Time / Part Time Available*.\nWe have morning, evening, and overnight positions available.\nSince we operate 24/7, our scheduling is very flexible.", "company": "Empire Parking Services", "location": "Atlanta, GA", "job_description": "Overnight Parking Enforcement Officer Overnight Parking Enforcement Officer Full Time / Part Time AvailableWe have morning, evening, and overnight positions available. Since we operate 24/7, our scheduling is very flexible. You inform us of your availability, and we plug you into our schedule, simple as that. Come join the elite squad of parking enforcement professionals and make great money booting vehicles in the Atlanta area. Empire Parking Services is a professional parking enforcement company that enforces parking regulations on private property. We immobilize (boot) vehicles that park illegally on private property and charge the vehicle owner a fee to remove the immobilization device.Military Veterans or Active Military, Law Enforcement, Correctional Officer, Vehicle Towing , Security Guards, Parking Enforcement Officer experience is a plus.Receive complete training, uniform, and all equipmentFlexible Hours - allows you to be in control of the amount of money you make.MUST HAVE:Valid Driver’s LicenseReliable TransportationMust be able to handle stressful situations in a professional mannerCannot be a convicted felon or charged with a felony.What is the Booting Process? A vehicle immobilization device, also known as a “boot”, is a wheel clamp that can be easily applied and removed only by a parking enforcement technician.When a vehicle is booted, the technician will also apply an orange sticker on the driver side window to alert the vehicle’s owner that it has been immobilized. The Empire Parking 24-hour call center phone number is located on the orange sticker. When the parking violator calls the number, our call service operator will dispatch a technician to the location to remove the boot for the designated fee. Once the boot is removed, the parking violator leaves the premises and has learned a valuable lesson without emptying their wallet. Other potential parking violators also notice the boot and orange sticker and this acts as a visual deterrent to notify them not to park and leave the property.Job Types: Full-time, Part-timePay: Up to $60.00 per hourBenefits:Flexible scheduleSchedule:8 hour shiftMonday to FridayNight shiftOvertimeWeekend availabilitySupplemental Pay:Commission payExperience:Military: 1 year (Preferred)Security: 1 year (Preferred)License/Certification:Driver's License (Required)Work Location: Multiple Locations", "url": "https://www.indeed.com/viewjob?cmp=Empire-Parking-Services&t=Parking+Enforcement+Officer&jk=f07f37bfb49e2b05&vjs=3"},
{"job_title": "newR&D Engineer", "summary": "Responsible for performing engineering tasks to research and develop EndoVenous medical devices from conception to market release, including designing,…", "company": "Medtronic", "location": "Plymouth, MN 55430+13 locations", "job_description": "R&D Engineer for Covidien, LP (a Medtronic company) located in Plymouth MN. Responsible for performing engineering tasks to research and develop EndoVenous medical devices from conception to market release, including designing, developing, analyzing, troubleshooting, providing technical skills, and translating research discoveries into usable and marketable products; develop medical devices, including developing device specifications and making recommendations for design improvements, proposing of device materials and parts, and translating into manufacturing / supplier requirements and processes; develop and validate equipment, test fixtures, and test methods utilized for in-vitro clinical simulation testing of device performance and plan, execute and analyze results for device performance testing; develop and validate test fixtures and test methods utilized for quantitative and qualitative materials properties analysis (e.g. Dynamic Mechanical Analysis, tensile, fatigue, compression) for polymers and metals; plan, lead and analyze results for material characterization (e.g. imaging thru microscopy and SEM, physical testing, and chemical testing thru DSC and spectroscopy); apply Design, Reliability, Manufacturability (DRM) methodology to drive product performance and manufacturing process improvements and DOE (Design of Experiment) and statistical techniques in testing and analysis; review risk assessment for patient hazard designations and Design Failure Mode and Effect Analysis (DFMEA); consult on the development and validation of manufacturing processes to include development of Process Controls and Installation, Operational and Performance Qualification (IQ, OQ, PQ); and navigate the complexity of various government and industry regulations/standards to include FDA QSR, CFR 820, ISO10993, ISO13485, EHS global conformity assessment, and EU MDR Hazardous Material Concerns.\n\nBasic Qualifications:\nMasters’ degree in Bioengineering, Biomedical Engineering, Materials Science and Engineering, or Mechanical Engineering and 6 months of engineering experience in the medical device industry.\nMust possess a minimum of 6 months experience with each of the following: developing medical device specifications and making recommendations for design improvements, proposing of device materials and parts, and translating into manufacturing / supplier requirements and processes; developing and validating equipment, test fixtures, and test methods utilized for in-vitro clinical simulation testing of device performance; planning, executing and analyzing results for device performance testing; developing and validating test fixtures and test methods utilized for materials properties analysis to include Dynamic Mechanical Analysis, tensile, fatigue, and compression for polymers and metals; planning and analyzing results for material characterization to include imaging thru microscopy and SEM, physical testing, and chemical testing thru DSC and spectroscopy; applying Design, Reliability, Manufacturability (DRM) methodology and Design of Experiments (DOE) and statistical techniques in testing and analysis; reviewing risk assessment Design Failure Mode and Effect Analysis (DFMEA); consulting on the development and validation of manufacturing processes to include development of Process Controls and Installation, Operational and Performance Qualification (IQ, OQ, PQ); and FDA QSR, CFR 820, ISO10993, ISO13485, EHS global conformity assessment, and EU MDR Hazardous Material Concerns.", "url": "https://www.indeed.com/viewjob?jk=59490ce4dd548806&from=serp&vjs=3"},
{"job_title": "Human Resources Assistant", "summary": "The Human Resouces Assistant will provide administrative support to the HR Corporate Groups and DEI teams out of our New York City offices to ensure on-site…", "company": "Tiffany & Co", "location": "New York, NY", "job_description": "The Human Resouces Assistant will provide administrative support to the HR Corporate Groups and DEI teams out of our New York City offices to ensure on-site collaboration.", "url": "https://www.indeed.com/viewjob?jk=4778de1ea3808558&from=serp&vjs=3"},
{"job_title": "Engineer in Training", "summary": "The preferred candidate will gain knowledge of design criteria, policies, and procedures and standards on an as-needed basis.\nA valid Driver's License.", "company": "Sustainable Design Solutions, LLC", "location": "Baton Rouge, LA", "job_description": "Engineer In Training Job DescriptionThe selected candidate will work on projects that may include water, sewer, general civil, or drainage components.The preferred candidate will gain knowledge of design criteria, policies, and procedures and standards on an as-needed basis. The preferred candidate will prepare plans, cost estimates, exhibits, and reports for projects under the direction of a Project Engineer.The following education and/or experience are the minimum standards which provide the required knowledge, skills and abilities for this position: A Bachelor's Degree from an accredited college or university in civil engineering or related field.Registration as an Engineer Intern or Engineer In Training.A valid Driver's License.Preference may be given for additional education, knowledge, experience and/or certification as it relates to the position including: Microsoft OfficeEfficient in AutoCAD and MicroStationThe ideal candidate will also: Possess enthusiasm to learnBe a team playerBe self-motivatedDemonstrate strong interpersonal skillsBe able to interact with consultants, contractors, stakeholders, and citizensBe results focusedBe able to prioritize, pay attention to detailHave excellent communications skillsBe a good problem solverJob Type: Full-timePay: $57,000.00 - $82,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceFlexible scheduleFlexible spending accountHealth insuranceLife insurancePaid time offVision insuranceSchedule:8 hour shiftSupplemental Pay:Bonus payEducation:Bachelor's (Required)License/Certification:Engineer Intern Certificate (Required)Work Location: Multiple Locations", "url": "https://www.indeed.com/viewjob?jk=035796bf4c32c0cd&q=Engineer&l=USA&from=web&advn=4893836486483264&adid=382829584&ad=-6NYlbfkN0C29hvXBsqPXhhx7JNMmYbw4YwtYqnydFXWi5Ki7qnQ4q0dW_8z6jSynlXIO1kmY6Iqyb-cfoH1xbGq4yZcPOTvZDRvjF737CzaUaVv99c9RiHR18w5mGlcdHQF2ziAJH13dc14ybt2k7z2nXIfwHKdxILClbnbYVcGZLEsBK1JcyoLkcPyI2BmgSlFjx2Vbip2hU9BNjEJywghPuJKTLrM3ccZAQZcjiQI2z3lP7x8trt7l-LwnxiWniVIF1KCvFAWZTXlzh9_oyHG1ZbP-o3--LYu1MHRZrPslQfN41evMZmsblEvfOso3y9XinySfggl6Kg3_T_B5CxbM5ZmrLPBTCkxI1Ha3ke3ZKBEq8knpRamwGkGRq3g&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "Desktop Support Supervisor", "summary": "Ability to listen, build rapport, and credibility as a partner vertically within the business unit, as well as with leadership and functional team.", "company": "Set Solutions", "location": "Remote in Los Angeles, CA", "job_description": "Set Solutions is working exclusively for a client in need of a full time (direct hire) Desktop Support Supervisor with a background in managing field service operations. The client is working on a three-year technology modernization effort and company-wide End User Support transformation.This is a very innovative environment with a huge amount of growth potential and opportunity to make an impact.The role can be done almost entirely REMOTELY but since it’s in management the position needs to be based out of the LA area so that you can get to the local office(s) occasionally.Job Description:Manage local and remote desktop technicians and infrastructure administration teamsManages daily IT activities of field service technicians, ensuring the level of technology support meets the needs of the organizationLead end user computing acquisition integrations into enterprise (Microsoft Configuration Manager, Microsoft security patching, antivirus solution and enterprise standards)Manage the production of employees through clear cut expectations and metrics.Foster a culture of accountabilityEnsures adherence to policies, procedures and technical standardsEnsure project and initiative progress, including consistent and effective communicationManage escalations as it relates to providing technology service supportLead, mentor change and motivate teammates to deliver exceptional customer service.Actively pursues operational improvements to enhance quality, improve productivity and reduce expenseRequirements:Must have freedom to and willingness to work extended hours and on-call to support production when neededAbility to listen, build rapport, and credibility as a partner vertically within the business unit, as well as with leadership and functional teamWorking knowledge with Microsoft operating systems and software to include, but not limited to Microsoft OfficeStrong problem-solving skills to identify and resolve problems in a timely mannerAbility to manage personnelExcellent organizational and planning skills in order to prioritize and plan work efficientlyExcellent interpersonal and communication skillsBasic understanding of virtual desktops and CitrixJob Type: Full-timePay: $85,000.00 - $110,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceHealth insurancePaid time offTuition reimbursementVision insuranceSchedule:Monday to FridayWork Location: Multiple Locations", "url": "https://www.indeed.com/viewjob?cmp=Set-Solutions&t=Desktop+Support+Supervisor&jk=97b3db5d5f6c4d33&vjs=3"},
{"job_title": "newPackaging Engineer", "summary": "GRAMMER is a leading North American full service automotive supplier of highly engineered thermoplastic components and assemblies for interiors and air and…", "company": "Grammer Americas", "location": "Toledo, OH 43612 (Whitmer - Trilby area)+1 location", "job_description": "Supply Chain/Packaging EngineerGRAMMER Americas Toledo, Ohio Metropolitan AreaCompany DescriptionGRAMMER is specialized in developing and manufacturing components and systems for car interiors as well as driver and passenger seats for off-road vehicles, trucks, buses, and trains.As a global partner to the vehicle manufacturing industry we are represented around the world by our two divisions, Automotive and Commercial Vehicles. Our employees are constantly engaged in developing and producing innovative, flexible solutions to meet challenges in today’s competitive global market. GRAMMER can be found on four continents with more than 50 production, distribution and logistics sites in 20 countries.GRAMMER is a leading North American full service automotive supplier of highly engineered thermoplastic components and assemblies for interiors and air and fluid management systems.Culture: Here at GRAMMER, we foster a culture that embraces our Grammer CODE: Collaborate in an inclusive environment, Openness in communication and ideas, Drive for results with energy and Empower yourself and others by taking ownership of decisions and actions.What we are looking for: Grammer is looking for a Supply Chain/Packaging Engineer to join our MP&L team at our Americas headquarters in Toledo, OH. The ideal candidate will enjoy working in a team environment. This individual will have an opportunity to make lasting and positive changes in our regional operations and within the MP&L Organization!What you will be doing: · Support Americas Region on product packaging (internally and externally)· Work with external vendors to develop packaging concepts for both new and existing programs· Support business development in quotation process as it relates to packaging and transportation· Work with Americas’ plants to identify packaging concerns (RCA) and provide improvements to ensure quality specs are met· Identify packaging improvements that support plant operations while reducing cost· Assist Americas’ plants with lean material flow concept implementation· Support development of PFEP within the Region· Other tasks as directed by managementWhat you will bring along: · Degree in packaging or supply chain (or related experience)· Previous experience in packaging concepts and standards· Knowledge of transportation (both domestically and internationally) as it relates to packaging· Experience with quoting new business and system day calculationsDesired Skills· Organized and detail oriented with ability to meet deadlines and ensure accuracy of deliverables· Strong analytical, problem solving and leadership skills· Attentive, ability to work independently and prioritize tasks· Excellent written and verbal communication skills· Proficient in Microsoft Excel, Powerpoint, and Word· Experience with reading blue prints· CAD or other design software experience a plus· Must have strong work ethic and be a team player· Knowledge of AS400 and SAP software applications is preferredWhat we can provide you: · Medical, Dental, and Vision coverage· Tuition reimbursement programs· 401(k) match· Robust EAP services· Developmental opportunities· Much more!Job Type: Full-timePay: $80,000.00 - $105,674.00 per yearBenefits:401(k)401(k) matchingDental insuranceFlexible scheduleHealth insurancePaid time offVision insuranceSchedule:8 hour shiftEducation:Bachelor's (Required)Work Location: One location", "url": "https://www.indeed.com/viewjob?jk=cd8d2d63f720a589&q=Engineer&l=USA&from=web&advn=6796221994580834&adid=13884087&ad=-6NYlbfkN0AHUV_VHuf5EnLCrT0NA0MYler8H02BRyL792hg8vlVH7OytMkCLxASzBJpTkxhLjfYdUsUxIUlHY7zH7e2d4fi1LokEQ3sVuDD_uKFCWxSIi90W4I0cWQsPwiwX-NXUKDK67yrS2pAQbjp7wh9U_ZS7aLBIJ16auzlpv38Q7Q265SV2yGi6wpIh8ndf0XbC15459quTQrYV1n2GXTEtYiAuzrg1Idj-0-JYrL8dtVBrYes9JHvP4I3FnbuRBoz6cmyftR4L5gQ-tzC2YTBr_Bjc4T7_c-nqIMtmAO4YqG8AV9UKuvV7UvGbVuHjVl-mdYNuTOX66tbyq-YioJxxtn30D99VgX4qClVeF0ZgnImJ8-1-4DKHLGR&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "Lateral Partners & Counsel", "summary": "We work with law firm partners, counsel, and senior associates with a book of business to evaluate their platform and identify opportunities to leverage their…", "company": "Pollack Badawi Group", "location": "Washington, DC 20037 (Foggy Bottom area)", "job_description": "We work with law firm partners, counsel, and senior associates with a book of business to evaluate their platform and identify opportunities to leverage their practice at the platform that is best for them. Whether it’s a smaller, regional firm or an international, AmLaw 200 firm, our team is has the network and insights into the DC market that allow us to identify the opportunities that work best for each candidate. Contact us for more information.", "url": "https://www.indeed.com/viewjob?jk=c2e5168c513ffc56&from=serp&vjs=3"},
{"job_title": "newQuality and Engineer", "summary": "Position Overview: *The Quality and Engineer's responsibilities include designing quality standards, inspecting materials, equipment, processes, and products,…", "company": "NRP Jones LLC", "location": "Nephi, UT 84648", "job_description": "Position Overview: The Quality and Engineer's responsibilities include designing quality standards, inspecting materials, equipment, processes, and products, developing quality control systems, and determining corrective actions. You will also work with managers and supervisors to implement quality measures.Essential Job FunctionsSet detailed guidelines on what needs to be checked and what the quality standards are.Update our Quality Management System (QMS) with incidents, fixes and improvements.Audit our systems based on ISO 9001:2015 and API Q1 requirementsDetermine quality metrics for all manufacturing proceduresMonitor the production cycle and perform regular tests to identify potential malfunctions as early as possibleInspect product materials for defects and durabilityIdentify the root cause of technical issues and recommend fixesPrepare reports on malfunctions and corrective actionsReview current blueprints and quality documentationSet and track quality assurance goalsCoordinate with external quality assurance auditors and technicians to ensure legal complianceWork with internal teams to increase customer satisfaction by improving the quality of the productsProvide Engineering 3D Design Support and Engineering DrawingsOther duties as assignedQualificationsPrevious work experience as a Quality Engineer or similar roleHands-on experience with Quality Management Systems (QMS) and testing methodologiesIn-depth understanding of technical documentationFamiliarity with statistical analysisGreat attention to detail and problem-solving abilitiesProficient in 3D CAD Modeling and the creation of Engineering DrawingsMinimum Bachelor’s Degree in Engineering or Related FieldProficient in technical writingThe above job description is not intended to describe, in detail, the multitude of tasks that may be assigned but rather to give the associate a general sense of the responsibilities and expectations of his/her position. As the nature of business demands change so, too, may the essential functions of this position..­­Job Type: Full-timePay: $80,000.00 - $100,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceFlexible scheduleHealth insuranceLife insurancePaid time offVision insuranceSchedule:10 hour shiftMonday to FridayWeekend availabilitySupplemental Pay:Bonus payAbility to commute/relocate:Nephi, UT 84648: Reliably commute or planning to relocate before starting work (Preferred)Experience:ISO 9001: 1 year (Preferred)Work Location: One location", "url": "https://www.indeed.com/viewjob?cmp=NRP-Jones-LLC&t=Quality+Engineer&jk=d6d14037efde6255&vjs=3"},
{"job_title": "Guidance Clerk", "summary": "Prepares records for new students, secures I.D. number, sends student to appropriate counselor for schedule, requests records and/or transcripts from previous…", "company": "Florence School District 1", "location": "Florence, SC 29506", "job_description": "TITLE: High School Guidance Secretary\nQUALIFICATIONS:\n 1. High school diploma.\n 2. Some specialized training in secretarial skills.\n 3. Prodicient in use of computer for word processing, spreadsheet, etc.\n 4. At least two years of generqal office experience.\n 5. Excellent communication and interpersonal skills.\n 6. Demonstrated aptitude for successful completion of the performance responsibilities listed below.\nREPORTS TO: Principal\nJOB GOAL: To assist and manage clerical tasks for guidance counselors so that maximum time may be devoted to guidance and counseling.\nPERFORMANCE RESPONSIBILITIES:\n 1. Acts as receptionist for guidance office, answering telephones, greeting guests, etc.\n 2. Prepares records for new students, secures I.D. number, sends student to appropriate counselor for schedule, requests records and/or transcripts from previous school.\n 3. Assists with college testing information and collection of fees for these tests.\n 4. Sends transcripts for students transferring or to college as requested.\n 5.Updates permanent records on students who have dropped out or transferred and sends to the District Office.\n 6. Assists seniors with college applications, scholarship applications, transcripts, etc.\n 7. Prepares reports for the counselors such as College-Freshman, progress reports, etc.\n 8. Assists counselors in calculating GPRs and ranks.\n 9. Sets up parent/counselor conferences.\n 10.Closes out graduate files and send to the District Office according to policy.\n 11.Other duties as requested.\nTERMS OF EMPLOYMENT: 200 day work agreement. SC30 Salary scale. Salary and work year to be established by the district.\nEVALUATION: Performance of this job will be evaluated in accordance with provisions of the Board's policy on evaluation of classified personnel.", "url": "https://www.indeed.com/viewjob?jk=3aa975db306c0edb&from=serp&vjs=3"},
{"job_title": "Energy Associate (Junior to Midlevel)", "summary": "Our lawyers and legislative advisors serve domestic and international clients in all areas of corporate and business law, complex litigation, intellectual…", "company": "Venable LLP", "location": "Washington, DC", "job_description": "Venable LLP’s Energy Group seeks a junior to midlevel associate with a minimum of three years of experience to join the practice in the Washington, D.C. office.\n\nThe qualified candidate has experience litigating before the Federal Energy Regulatory Commission (FERC) including enforcement defense. Experience counseling clients in the oil and natural gas industry preferred. The successful candidate has excellent oral and written communication skills, and outstanding academic credentials. Candidates must hold a juris doctorate degree from an accredited law school and be admitted to and in good standing with the D.C. Bar. Please include law school transcripts with submissions.\nVenable LLP is an American Lawyer Global 100 law firm headquartered in Washington, D.C., with offices in California, Delaware, Illinois, Maryland, New York, and Virginia. Our lawyers and legislative advisors serve domestic and international clients in all areas of corporate and business law, complex litigation, intellectual property, regulatory matters, and government affairs. Additional information can be found at Venable.com.\n\nVenable LLP is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, age, protected Veteran status and any other protected basis under applicable law.\n\nContact:\nVictoria Sievers\nSenior Manager of Associate Recruiting\nVKSievers@venable.com", "url": "https://www.indeed.com/viewjob?jk=75860c2448f6e4c9&from=serp&vjs=3"},
{"job_title": "newManufacturing Engineer", "summary": "The Manufacturing Engineer (contract/outsourced manufacturing) identifies and implements manufacturing processes, procedures, and projects focused on minimizing…", "company": "Hunter Industries", "location": "San Marcos, CA 92078", "job_description": "We are a global leader in the irrigation, outdoor lighting, dispensing technology, and custom manufacturing industries. Driving our continued success is the combined energy and talents of the nearly 3,000 people on our team. Together, we create a diverse array of products that can be seen all over the world, from residential landscapes to national landmarks, stadiums, parks, hotels, and municipal buildings. Although we’re global, we’re family owned, and our casual, fun, and caring company culture is what makes this a special place to work. As we grow, we are dedicated to preserving our unique culture that makes our employees proud to work here. Whether you’re pursuing a career at our headquarters in Southern California, or an opportunity at one of our state-of-the-art manufacturing facilities, or something somewhere in between, we look forward to welcoming you to Hunter Industries and our Family of Companies.About This Role: The Manufacturing Engineer (contract/outsourced manufacturing) identifies and implements manufacturing processes, procedures, and projects focused on minimizing product cost, improving product quality, and maintaining product availability for assigned product lines with our contract manufacturers. S/he works on projects across multiple departments that are aligned with the organization’s strategic objectives.Demonstrates behavior that is consistent with the company’s values of Customer Satisfaction, Innovation, Family, and Social Responsibility.Essential Job Functions/Tasks: Responsible for the resolution of manufacturing issues of assigned product lines that affect product quality and/or availability. Develops and coordinates the necessary processes and sustaining engineering protocols to ensure manufacturing operational efficiencies. Maintains manufacturing-related documentation and production reports that define key metrics and outline current activities.Uses lean manufacturing practices and Six Sigma methodology to evaluate and improve assembly line performance per established key performance indicators. Implements improvement processes to ensure that projects are justifiable, on schedule and within budget.Manages progress of new and modified molds and assembly equipment for assigned product lines throughout qualification process. Ensures that the mold/assembly equipment meets established manufacturing capacity and utilization requirements.Provides manufacturing engineering support for complete integration of new products into full production per the organization’s New Product Development and Introduction (NPDI) process. Provides focus on delivering a repeatable process with high quality yield. Supports the concurrent engineering effort on behalf of manufacturing as a member of the product development team.Maintains updated capacity models for both injection molds and assembly equipment for assigned product lines. Submits capital requests as required to ensure timely completion of equipment to meet forecasted production. Provides capital requirements for annual budgeting process.Leads or supports cost reduction projects including qualification of new vendors for materials or parts. Participates in test plan development and execution.Education/Training Required and Preferred: Bachelor’s degree in related engineering discipline.Experience Required and Preferred: Minimum 3 years of engineering experience within a manufacturing organization.Knowledge of the practical application of engineering science and technology. Knowledge of LEAN Manufacturing & Six-Sigma methodology techniques and how to apply them in the manufacturing environment.Ability to speak and write effectively as appropriate for the needs of the audience. Excellent written and verbal communication skills in the English language, with strong report-writing and presentation skills.Excellent computer knowledge, including strong proficiency in Microsoft Office programs.Strong logic and reasoning skills to identify the strengths and weaknesses within processes.Excellent organizational and time management skills, and the ability to work within time lines.Excellent judgment and decision-making skills, with the ability to consider the relative costs and benefits of potential actions to choose the most appropriate one.Must be able to travel domestically and internationally, and work flexible hours to visit supplier facilities worldwide. Ability to obtain a valid passport if necessary.Knowledge of assembly of electronics and injection molded plastic components preferred.Knowledge of SPC, FMEA, DOE and process capability studies preferred.Experience with irrigation products or industry preferred.Follow us on LinkedIn, check out our rave reviews on Glassdoor, and learn more about our company culture on our career site: http://corporate.hunterindustries.com/careersHunter Industries and its Family of Companies is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, disability, gender, gender identity or expression, military and veteran status, national origin, race, religion, sexual orientation, or any other applicable legally protected status or characteristic.Job Type: Full-timePay: $85,000.00 - $100,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceFlexible spending accountHealth insuranceLife insurancePaid time offTuition reimbursementVision insuranceSchedule:Monday to FridaySupplemental Pay:Bonus payAbility to commute/relocate:San Marcos, CA 92078: Reliably commute or planning to relocate before starting work (Preferred)Education:Bachelor's (Required)Work Location: One location", "url": "https://www.indeed.com/viewjob?jk=35f694d3a706cc3b&q=Engineer&l=USA&from=web&advn=7837815445639312&adid=383558694&ad=-6NYlbfkN0BzxEHwB1wmEMmaBJocLQ_6hiEl7jq38z19_yNzAtn1xMoj6ylLS53L4SYBNILqvtMh-CiB2bVpAmPrJRUXe-yGER-OwWrnsZQtjZYKB_BpWMoGHqknlIPEa4Gn9ULokZdIOl07AujIpLMiFYWsijGbjlhKSxK7MmW181SQsfGUKBJusl7hp4p8CsPftXHgi-qTOiZkrgnJslB1YzeeQSRTuYqv68UvdanswJ5F-kFfFCxX3Fl9aNBQqOtQXi_mfnJj9QEIXkkBKcik0aN8kczqZbxCLKda750WW43FsqL1QxcU9CJ9G2ztRCLwH8q1XAwVhrhdEwHVxD35It1c6LiOxe3zLhxCjAWaPpJnFQgYveXnh-_Uofhx&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "newCashier", "summary": "These programs include: - Competitive pay - Sick time plan that you can use to support you or your immediate families health - Opportunities for career growth -…", "company": "Sprouts Farmers Market", "location": "Clovis, CA 93612+126 locations", "job_description": "Job Introduction:\nDo you enjoy meeting and talking to new people? Does being the face of a company excite you? Do you have a passion for delivering an extraordinary customer service experience while working in a fast paced and friendly environment? If the thought of helping people make healthy choices in one of the fastest growing retailers is up your alley – then we need YOU to join our winning team at Sprouts Farmers Market as a Cashier!\nOverview of Responsibilities:\n\nAs a Cashier at Sprouts Farmers Market, you are the face of the company while you process each customer’s order quickly, accurately, and efficiently while ensuring complete customer satisfaction through prompt and friendly service. As a Cashier, Sprouts Farmers Market looks to you to accurately handle customer cash, credit/debit payments, and change, and assist customers by providing information and resolving their complaints. Following all front end procedures, assisting with stocking shelves, facing and dusting as needed are all a part of the day for a Sprouts Farmers Market Cashier. A Cashier maintains knowledge of weekly ad items, gives customers direction of product location throughout the store, is familiar with events and seminars going on or coming up, and maintains excellent communication with front end manager and Head Cashier at all times. A Cashier is expected to ensure that checkout areas are properly maintained in a clean and orderly condition at all times, and execute all other related duties as assigned.\n#li-dni\nQualifications:\n\nTo be a Cashier at Sprouts Farmers Market you must:\nBe at least 18 years of age and have a high school diploma or equivalent, and 1-2 years of recent cashiering experience.\nHave and show an outgoing and friendly behavior, a positive attitude and the ability to interact with our customers.\nAbility to operate front end equipment; register, calculator, scanner.\nBe dependable and reliable having the ability to work a flexible schedule that changes as the business changes; including nights, weekends and holidays.\nHave good communication skills; the ability to take direction/constructive criticism and participate in a team environment\nBe able to perform repetitious activities, and have the ability to multi-task, prioritize and stay organized.\nMust lift/carry product horizontally/vertically weighing up to 30 lbs., from 36” to 24”, for a distance up to 3 feet for up to 50 hours without mechanical assistance.\nMust use both hands to move grocery carts horizontally requiring a force up to 35 lbs., for a distance up to 4 feet for up to 50 hours.\nRequires strong attention to detail and proficiency with numbers; proficient in cash handling and mathematical skills; ability to read, write and count.\nBenefits: In addition to a rewarding career, Sprouts offers a comprehensive program to help support you and your family. These programs include: - Competitive pay - Sick time plan that you can use to support you or your immediate families health - Opportunities for career growth - 15% discount for you and one other family member in your household on all purchases made at Sprouts - Flexible schedules - Employee Assistance Program (EAP) Eligibility requirements may apply for the following benefits: - 401(K) Retirement savings plan with a generous company match - Affordable benefit coverage, including medical, dental vision - Paid parental leave for both mothers and fathers - Pre-tax Flexible Spending Accounts for healthcare and dependent care - Company paid life insurance and short-term disability coverage Why Sprouts:\n\nGrow with us!\nIf you have a passion for inspiring people and a flair for fresh food, consider applying for a job at Sprouts! With a focus on customer service, our neighborhood grocery stores offer high-quality, farm fresh produce, natural meats, plenty of scoop-your-own bulk goods and much more in a fun, friendly, old-fashioned farmer’s market setting. Come grow your career in healthy living with a fast-paced, rapidly growing company and teams that pride themselves on empowering others along their journey.\nThe above statements are intended to describe the general nature and level of the work being performed by people assigned to this work. This is not an exhaustive list of all duties, responsibilities, and requirements. Sprouts’ management reserves the right to amend and change duties, responsibilities, and requirements to meet business and organizational needs as necessary.\nCalifornia Residents: We collect information in accordance with California law, please see here for more information.", "url": "https://www.indeed.com/viewjob?jk=20b787b0dfee0254&from=serp&vjs=3"},
{"job_title": "newMaterial Science Engineer Staff", "summary": "Support manufacturing in evaluating material compatibility issues in manufacturing processes and work with engineers and scientists to troubleshoot and…", "company": "Roche", "location": "Tucson, AZ", "job_description": "Summary\nEmploy diversified knowledge of material science and engineering principles to study material and chemical interaction problems in complex systems involving hardware, chemicals and reagents. Assess material compatibility risks using analytical, instrumentation and simulation tools and work with engineers and scientists to mitigate material compatibility risks by deploying engineering and scientific solutions. Work with internal and external experts to perform and set up material compatibility testing with materials/chemicals of various hazards and toxicity levels. General responsibilities include material compatibility risk assessment, prediction of material compatibility issues, material testing to assess performance against specification, assessment of system interactions and participation in design reviews. Make independent decisions. Support manufacturing in evaluating material compatibility issues in manufacturing processes and work with engineers and scientists to troubleshoot and determine root causes.\nResponsibilities\nPractices, mentors and develops company concepts, policies and procedures, familiar with and follows standard practices\nApplies functional expertise at a level to make significant company contributions\nProject goals are broadly defined; defines project milestones; responsible for timely project completion\nMakes major contributions to strategic directions and projects through knowledge of technology and its creative applications\nDrives activities for publication and/or patent potential\nConceives, plans, and executes projects related to the strategic needs of the company\nDesigns and executes experiments to test hypothesis related project outcomes; extracts the full relevance of technical observations\nApplies advanced technical knowledge to multi-disciplinary projects\nAssures experimental quality through sound experimental design; utilizes DOE; assists in the design of experiments for others\nParticipates or leads cross functional technical teams\nDevelops and maintains internal and external contacts to maintain technical knowledge\nTrains others using a variety of methods on the theoretical and practical basis of techniques, processes and products\nParticipates or leads in project planning, process updates and contributes to experimental design\nPresents results of projects both internally and externally\nReviews and critiques presentation for others; presents complex technical data to large and diverse groups\nMonitors work to ensure quality, and continuously promote Quality First Time.\nQualifications\nEducation:\nBachelor's degree in Material Science / Engineering, Chemical Engineering or equivalent plus at least 12 years of relevant experience. Or Master of Science degree + 8 years, or PhD degree + 6 years.\nKnowledge, skills and abilities\nCommon and specialized materials, thermoplastics, metals, coatings, composites, elastomers, fluoropolymers, adhesives, etc., used within the industry for fluidics systems\nChemistry and Engineering knowledge of materials, as well as knowledge of classical mechanics (fluids, heat, mass, etc.)\nTissue engineering to support extractable & leachable evaluations\nISO/ASTM standard methods for evaluating materials and chemical compatibility, IEC & USP\nOperation of analytical instruments in lab environments and analyze data\nTechnical writing skills to produce test protocols, test reports and documents\nMicrosoft Office tools, statistical analysis (e.g., Minitab), Statistical Process Control (SPC), LabView\nCollaboration across complex projects with ambitious milestones in high pressure circumstances\nExcellent verbal and written communication.\nWho we are\nAt Roche, more than 100,000 people across 100 countries are pushing back the frontiers of healthcare. Working together, we’ve become one of the world’s leading research-focused healthcare groups. Our success is built on innovation, curiosity and diversity.\nVentana Medical Systems, Inc. (Ventana), a member of the Roche Group, innovates and manufactures instruments and reagents that automate tissue processing and slide staining for cancer diagnostics. Our integrated staining, workflow management and digital pathology solutions optimize laboratory efficiency to reduce errors and support diagnosis for pathology professionals. Together with Roche, Ventana is driving personalized healthcare through accelerated drug discovery and companion diagnostics.\nUnless entitled to a reasonable accommodation under applicable law, employees are required to be fully vaccinated against COVID -19 in accordance with customer requirements, the company’s health and safety obligations and/or applicable law or guidelines.\nRoche is an equal opportunity employer and strictly prohibits unlawful discrimination based upon an individual’s race, color, religion, gender, sexual orientation, gender identity/expression, national origin/ancestry, age, mental/physical disability, medical condition, marital status, veteran status, or any other characteristic protected by law.\nIf you have a disability and need an accommodation in connection with the on-line application process, please email us at US.Accommodation@roche.com .\nJob Level:\nIndividual contributor", "url": "https://www.indeed.com/viewjob?jk=485a2ded5a80d0ac&from=serp&vjs=3"},
{"job_title": "newTransportation Security Specialist", "summary": "In cities across the country, you would secure airports, seaports, railroads, highways, and/or public transit systems, thus protecting America's transportation…", "company": "TSA (Transportation Security Administration)", "location": "San Francisco, CA+4 locations", "job_description": "Securing Travel, Protecting People - At the Transportation Security Administration, you will serve in a high-stakes environment to safeguard the American way of life. In cities across the country, you would secure airports, seaports, railroads, highways, and/or public transit systems, thus protecting America's transportation infrastructure and ensuring freedom of movement for people and commerce. For additional information about our agency please: Click Here\nRequirements\nConditions of Employment\nYou must possess U.S. Citizenship or be a U.S. National.\nYou must be able to obtain and maintain a Secret Clearance.\nMust pass pre-employment drug screening AND random drug/alcohol testing.\nYou must submit a Bomb Disposal Graduation/Certification certificate.\nSelective Service registration is required.\nSee \"Conditions of Employment\" and \"Other Information\" sections.", "url": "https://www.indeed.com/viewjob?jk=ba2e8e92d51a3666&from=serp&vjs=3"},
{"job_title": "Manufacturing Engineer", "summary": "This is a Hands-On position focused on lean / continuous improvement initiatives covering Plastic Injection Molding, Clean Room Assembly, Pad Printing and…", "company": "Forum Plastics LLC", "location": "Waterbury, CT 06705", "job_description": "Forum Plastics LLC is seeking an energetic driven Manufacturing Engineer to lead our manufacturing floor Continuous Improvements. This is a Hands-On position focused on lean / continuous improvement initiatives covering Plastic Injection Molding, Clean Room Assembly, Pad Printing and Automation. The successful candidate will have the responsibility of analyzing the current manufacturing state and formulating action plans through known Lean techniques that drive faster changeovers, reduce errors, standardize processes, reduce down time and increase OEE. The ideal candidate will have a strong desire to learn, have a problem-solving mentality, continually look for the next challenge and be respectful to others. In this position, you will:Manage Continuous Improvement Projects, lead projects, provide status updates, completes action items, sets goals, establishes priorities, manages project resources, develops concepts and action plans.Project management programs as assignedLeverage Lean principles to assist in the design and execution of new manufacturing processes, methodologies and equipment layouts to improve overall equipment effectiveness.Evaluate where the plant is in relations to goals and adjust action plans accordingly.Possess a good understanding of Lean principles and tools and a working knowledge of the Manufacturing / Injection Molding floor.Analyze Process flow and value stream layouts and provide recommendations for improvement.Perform analyses of systems and business processes to identify, recommend and implement modifications that will improve efficiencies and overall plant performance.Improve & Optimize manufacturing processes and equipment.Problem solves product non-conformance including investigating and eliminating root cause and effect.Understand process and equipment limitations and improve manufacturing efficiencies.Participate in developing and improving Technical Operating Instructions.Design and implement new manufacturing processes and equipment including documentation and training.Support new automation and provide lead support once launched into productionBeneficial Skills and ExperienceBachelor’s Degree in Engineering or Manufacturing field.3 to 5 years of actual manufacturing engineering experience in a manufacturing facility is required.Six sigma training and experienceOwnership and accountability for areas of responsibility is essential.Ability to communicate with all levels of the organization is essential.Ability to develop and manage project timelines and cost budgets is essentialExperience working with plastic injection moldingStrength and/or proven aptitude to acquire skills in use of software such as Excel, Word, PowerPoint, Project, Solidworks.Experience supporting automation projects, PLC programming is a plusJob Type: Full-timePay: From $75,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceDisability insuranceEmployee assistance programHealth insuranceLife insurancePaid time offProfessional development assistanceRetirement planVision insuranceSchedule:Monday to FridaySupplemental Pay:Bonus payCOVID-19 considerations:Employees and visitors wearing masks to help reduce the exposure.Installed plexiglass partitions around all cubicles and common areas.Hired additional cleaning staff.Entire facility sprayed weekly w/ hospital grade disinfectant.Education:Bachelor's (Required)Work Location:One locationWork Remotely:NoWork Location: One location", "url": "https://www.indeed.com/viewjob?jk=09453d78276c28d6&q=Engineer&l=USA&from=web&advn=7958816905710960&adid=374346631&ad=-6NYlbfkN0AsAJHops4nfw0SUMQFtbMufpQ2mN1HWl6iv2qPXHtBtLx_RnEyv39BlK9v4qDwvFlHmFQlZulgTays4fLKiucl2GDPzN9Xn72uIrsns_lTNpYYD3UiSdRzuQ5Bnmg8qyZZA2teOvd9RAqusCj26y96jRqIxyztL9hVjLTN33A4gsSj8lmzawaOe4-PmsUR6ogxkzze2yj7XZ4b3Bg6AnaAOkUJICgGlOuuaj8L4YeOGtNBT8g_x9_WgqYNjinyrS7NyeO0kev9g0Uv44jCBw-KvUxA04XvVlBTToePLiidgPyVWyw4S_JziNouFp-3lqe865qd9VerhGv5Il8x_MJvbCjU656cCWRPOulIdHBjAXHkQOCQ1BcKoRHB4f37iUY%3D&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "newShipping/Receiving Supervisor - Up to $68,000", "summary": "Basic salary of $62,000/year.\nPlus 10% profit share every year-end – estimated extra $6,000-$7,000/year.\nWe reward top performance with additional compensation…", "company": "Echelon Industrial", "location": "Columbus, OH 43217 (South Central Accord area)", "job_description": "SHIPPING/RECEIVING SUPERVISOR — Up to $68,000We are a Fortune 200 company distributing IT products, services, and solutions to customers worldwide.We have an exciting opportunity for a full-time Shipping and Receiving Supervisor to join our growing team of elite professionals.Come develop your skills with a company that truly cares about your development.If you’re interested in learning more, we want to meet you!Please apply today.COMPENSATION & BENEFITSBasic salary of $62,000/year.Plus 10% profit share every year-end – estimated extra $6,000-$7,000/year.Full medical benefits.We reward top performance with additional compensation and responsibility.OUR IDEAL CANDIDATEExperienced in warehousing or logistics.Possess strong leadership skills.Monday to Friday, 7AM-3PM.APPLY TODAY!This position will be filled quickly, so please apply today.A real human—not a computer program!— will read your application.Our hiring manager, Kiko San Pedro, will respond within 48 hours to tell you all about the hiring company and answer your questions so you can determine if this is a career you’d like to pursue.Even though we focus on military Veterans, this position is open to everyone.Job Type: Full-timePay: From $62,000.00 per yearSchedule:Monday to FridayWork Location: One location", "url": "https://www.indeed.com/viewjob?cmp=Echelon-Industrial&t=Shipping+Receiving+Supervisor&jk=bfc52431db68aee0&vjs=3"},
{"job_title": "newSocial Services Team Lead", "summary": "See MSPB Careers for information regarding this classifications.", "company": "Mississippi State Personnel Board", "location": "Jackson County, MS", "job_description": "Characteristics of Work\nSee MSPB Careers for information regarding this classifications", "url": "https://www.indeed.com/viewjob?jk=9fbd5edb967d0760&from=serp&vjs=3"},
{"job_title": "Studio Engineer", "summary": "Assist clients with podcast and vocal recording/editing and musical productions.\nAbility to record and edit vocals and visuals.", "company": "Executive Bre Productions", "location": "Atlanta, GA 30303 (Downtown area)", "job_description": "Assist clients with podcast and vocal recording/editing and musical productions.RequirementsPrevious Audio Engineering experiencePrevious Customer service experienceAbility to record and edit vocals and visualsAbility to learn and master recording softwareAbility to Mix and Master projectsMusical KnowledgeFlexible ScheduleJob Type: Full-timePay: $30.00 - $50.00 per hourSchedule:8 hour shiftOn callWeekend availabilityExperience:Audio Engineering: 1 year (Preferred)License/Certification:Professional Engineer (Preferred)Shift availability:Day Shift (Preferred)Night Shift (Preferred)Overnight Shift (Preferred)Work Location: One location", "url": "https://www.indeed.com/viewjob?cmp=Executive-Bre-Productions&t=Studio+Engineer&jk=4233ea4a6677f154&vjs=3"},
{"job_title": "COVID-19 Test Site Data Entry", "summary": "Ability to establish and maintain positive and effective work relations.\nBoynton conducts significant outreach efforts including student-led health promotion in…", "company": "University of Minnesota", "location": "Minneapolis, MN", "job_description": "Required Qualifications:\nDemonstrated commitment to promoting a culture that respects and advances diversity and inclusion.\nExcellent communication skills\nAbility to adapt in a fast paced environment\nPreferred Qualifications:\nOpen to communicating with individuals from a variety of cultures\nAbility to establish and maintain positive and effective work relations\nAbility to take initiative and work autonomously, as appropriate\nExperience working with individuals from diverse racial, ethnic, and socioeconomic backgrounds.\nPhysical and Environmental Conditions:\nMust be mobile, ability to sit, stand.\nAbility to read printed and electronic information.\nCommunicate effectively in English using oral, written, electronic and visual forms of interaction.\nGeneral Statement of Responsibilities:\nThe COVID-19 Testing Site Data Entry Specialist at Boynton Health works at the University of Minnesota campus wide testing site. As a COVID-19 Testing Site Data Entry Specialist, you will chart in an Electronic Health Record. You will handle lab specimens while wearing PPE. You are a key player on a team that is delivering high quality, multicultural health care to the University’s diverse population.\nDetailed Job Responsibilities:\nMaintain a respectful work environment.\nProvide quality, competent care in a customer friendly manner.\nEfficiently and accurately record Electronic Health Record information.\nHandle and label lab specimens\nParticipate in the daily set-up and tear down of the testing site.\nProvide necessary information to patients.\nAttend trainings as needed.\nPerform other duties as assigned\n**This description lists the major duties and requirements and is not all-inclusive. The employee may be expected to perform related duties and may be required to have specific job related knowledge and skills\nAbout Boynton Health, Nursing\nBoynton.umn.edu\nBoynton Health, a nationally recognized leader in college health, is transforming health and academic success for students. Our mission is to create a healthy community by working with students, faculty and staff to achieve physical, emotional and social well-being. Boynton provides comprehensive health care to students, faculty and staff. Boynton conducts significant outreach efforts including student-led health promotion in the areas of sexual health, nutrition and stress management. It conducts a comprehensive survey of college students to give postsecondary institutions a look at the health of their students. And it conducts community-based public health initiatives to support the health of everyone on campus.\nApplications must be submitted online. To be considered for this position, please click the Apply button and follow the instructions. You will be given the opportunity to complete an online application for the position and attach a cover letter and resume.\nAdditional documents may be attached after application by accessing your \"My Job Applications\" page and uploading documents in the \"My Cover Letters and Attachments\" section.\nTo request an accommodation during the application process, please e-mail employ@umn.edu or call (612) 624-UOHR (8647).\nThe University recognizes and values the importance of diversity and inclusion in enriching the employment experience of its employees and in supporting the academic mission. The University is committed to attracting and retaining employees with varying identities and backgrounds.\nThe University of Minnesota provides equal access to and opportunity in its programs, facilities, and employment without regard to race, color, creed, religion, national origin, gender, age, marital status, disability, public assistance status, veteran status, sexual orientation, gender identity, or gender expression. To learn more about diversity at the U: http://diversity.umn.edu.\nAny offer of employment is contingent upon the successful completion of a background check. Our presumption is that prospective employees are eligible to work here. Criminal convictions do not automatically disqualify finalists from employment.\nThe University of Minnesota, Twin Cities (UMTC)\nThe University of Minnesota, Twin Cities (UMTC), is among the largest public research universities in the country, offering undergraduate, graduate, and professional students a multitude of opportunities for study and research. Located at the heart of one of the nation's most vibrant, diverse metropolitan communities, students on the campuses in Minneapolis and St. Paul benefit from extensive partnerships with world-renowned health centers, international corporations, government agencies, and arts, nonprofit, and public service organizations.", "url": "https://www.indeed.com/viewjob?jk=68846d798e316ef0&from=serp&vjs=3"},
{"job_title": "Production Supervisor", "summary": "Provide supervision to the hourly workforce to ensure the safety, quality, cost and productivity goals are met.\nExecute the daily work schedule.", "company": "US Brick Holdings, LLC.", "location": "Columbia, SC+1 location", "job_description": "Position Overview: Provide supervision to the hourly workforce to ensure the safety, quality, cost and productivity goals are met. Coach, mentor and develop team members to meet current and future business requirements.Responsibilities: · Plan and manage the day to day allocation of resources (equipment, people, materials and systems) in order to efficiently, safely and cost effectively achieve performance targets. Execute the daily work schedule.· Champion and lead change initiatives and continuous improvement efforts, including the pursuit of continuous improvement· Review overall line effectiveness and recommend and drive measures to improve production methods, equipment performance, and quality of product.· Understand and adhere to internal and external regulations, procedures & policies. Ensure that a high quality of products, housekeeping and safety standards are maintained.· Operate within effective standard operating procedures (SOPs) to support employee safety, quality, asset effectiveness, and workplace organization.· Oversee department specific operations as necessary to promote and maintain a clean and safe environment.· Provide employee coaching, mentoring and training to ensure that employees are performing job responsibilities effectively. Provide leadership for assigned production personnel to achieve their specific goals and objectives via continuous process improvement.· Ensure employee engagement, training, and development to maximize safety, quality, and productivity and ensure all quality standards, specifications and policies are met or exceeded.· Evaluate subordinate performance, communicate with employees, and provide information for work performance improvement.· Create and maintain a safe and positive work environment for all employees. Maintain safe environment and safety practices in all business initiatives. Proactively participate in and promote safety initiatives in the plant.· Respond to employee concerns and / or issues in a timely manner.· Attend production and shift review meetings and complete daily paperwork· Ensure all daily manufacturing documents are completed and accurate.· Complete monthly training and Safety Activities.· Engagement in plant Continuous Improvement efforts. Identify improvement opportunities· Contributes to team effort by performing other assigned duties as needed.· Maintains cooperative relationship with coworkers and other leaders by communicating necessary information, responding to requests, building report; and participating in problem solving methods.Job Type: Full-timePay: From $70,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceHealth insuranceHealth savings accountLife insurancePaid time offReferral programVision insuranceSchedule:8 hour shiftEducation:High school or equivalent (Preferred)Work Location: One location", "url": "https://www.indeed.com/viewjob?cmp=US-Brick-Holdings,-LLC.&t=Production+Supervisor&jk=659b9d0fb5729c0e&vjs=3"},
{"job_title": "Operations Manager", "summary": "Must be able to lift up to 50lbs.\nYour shoes were likely made in China.\nHave you ever wondered how they got to your local retailer?", "company": "Maersk", "location": "South Gate, CA 90280+12 locations", "job_description": "Your shoes were likely made in China. Have you ever wondered how they got to your local retailer? Or what’s in that shipping container going down your local highway?\n\n\nAt Maersk Distribution and Warehouse Services, we know. In fact, we facilitate the distribution and movement of freight every single day.\n\n\nEach of our client’s supply chain is evaluated to optimize efficiency from factory production, all the way to end user delivery. The goal is not only to minimize lead times but also to minimize inventory levels and costs, thus making the client's business more flexible.\n\n\nOur warehouse network spans from East to West Coasts of the United States and in Canada. Our services include transloading and automated sortation, cross-docking, replenishment, drayage management, and inland transportation.\n\n\nWe are looking for an Operations Manager to join our North America Warehouse and Distribution team.\n\n\nThis position will be based in Santa Fe Springs, CA.\n\nWe offer\nWe offer you an exciting global career at the forefront of world trade.\n\nWorking with the best people in a global team culture with future growth opportunities in an industry that has a significant impact on the world economy…\n\nWe’re proud of our people who define our company’s industry leadership, global team culture and customer-centric focus every day.\n\nWhen you join our team you join a truly diverse, global organization in a fast-moving, values-based, work environment where you can grow on the job, create and shape our digital solutions, tap into industry-leading talent development initiatives, enjoy working with your colleagues and broaden your world view through our international job postings. We offer competitive compensation and benefits for full-time employees including health, dental and vision insurance, a 401k savings plan with an employer match and paid time-off – and our parental leave policy is recognized world-wide as one of the best in the industry.\n\n\nGlobal scope\n\nEvery company, every country wants access to a competitive shipping, logistics and port system – and our people have created one company that offers one, easy-to-use solution to all their shipping needs.\n\n\nMaersk is unique\nMaersk is uniquely positioned to play a significant role in global trade, creating opportunities that help countries, companies and people succeed. Our vision is simple: Maersk is the global integrator of container logistics, connecting and simplifying our customers’ global supply chains. We do this through the global scale of Maersk, the world’s largest shipping line; our Logistics and Services expertise that help customers manage their global supply chains; and through our port operator, APM Terminals, one of the largest container terminal operators in the world with the most strategic locations to serve global supply chains.\n\nKey responsibilities\nThe Operations Manager (OM) is responsible for operations within the facility. This includes being accountable for the business operations, establishment of production standards and operations/services provided within the facility. This position is also responsible for managing, evaluating and mentoring Assistant Managers, Supervisors and Associates. Accurate and timely tracking of internal and external reports including, but not limited to, safety, production, resource allocation, cost and load/unload accuracy is part of the required key performance indicators. The ability to solve problems and articulate issues with both senior managers and direct reports is essential.\nOversee and direct the facility operations to achieve the highest level of safety, productivity, and customer service with a focus constantly on cost and efficient use of laborUnderstand and uphold financial responsibility for the daily production and labor (P&L) and train direct reports on understanding the P&LCommunicate Company information, goals and objectives within the Operations teamEnsure safety policies and practices are being adhered to and are fundamental to the Company cultureEnsure work procedures and work schedules are being adhered to and that corrective action is being taken within the facility operationsPromote collaboration within facility teams to work to provide creative and innovative ideas to improve operational productivity while maintaining a safe work environmentParticipate and/or represent Maersk Warehouse and Distribution (WND) within various operations, safety, and labor related meetingsEnsure Foremen and Assistant Managers are submitting timely and accurate reports, billing and labor payroll\nResponsible for oversight of safe and efficient use of facility equipment, which are monitored daily by Foremen and Assistant ManagersEffectively communicate with other departments and managers to ensure the efficiency of the facility as a wholeHave constant dialog with the Assistant Managers and Supervisors on daily operational issues and events, in their absence report the same information to the Facility ManagerMeet customer and Company key performance metrics, goals and objectivesResponsible to cross train management staff as well as warehouse associatesFoster team environment within the facility and demonstrate strong leadership skillsManage, evaluate, develop, and mentor Assistant Managers and SupervisorsSupport the commitment to the Company’s Core ValuesCoordinate with Managers and Human Resources to ensure adherence to Company policies and proceduresPerform other job-related duties as required\n\nWe are looking for\nQualifications:\n\n5+ years logistics experience in a warehouse setting\n2+ years logistics supervisory experience in a warehouse setting\nHigh School Diploma or G.E.D. required. College degree preferred but not requiredMust be able to work 2nd shift.Intermediate-Advanced proficient with systems (i.e.: Microsoft products; warehouse management systems, etc)Must be able to lift up to 50lbs\nSoft Skills:\nStrong candidates are assertive, adaptable and resilient\nMust be a self-starter, resourceful, solution-orientedStrong multi-tasking and problem-solving abilities\nExcellent verbal and written communication skillsTeam player attitude\nPreferred Qualifications (nice to have)\n1+ years’ 3PL (Third party logistics) experience\n1+ years’ Sortation and Automation experienceExperience with transloading, cross-docking, replenishment, drayage management, and inland transportation.Experience with agile methodologies and/or continuous improvement\n\nYou must be authorized to work for any employer in the US.\n\n\nLocal candidates only; no relocation assistance is provided.\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, disability, protected veteran status, sexual orientation or any other characteristic protected by law.\n\nA.P. Moller - Maersk is an integrated container logistics company working to connect and simplify its customer's supply chains. As the global leader in shipping services, the company operates in 130 countries and employs roughly 70,000 people. With simple end-to-end offering of products and digital services, seamless customer engagement and a superior end-to-end delivery network, Maersk enables its customers to trade and grow by transporting goods anywhere - all over the world.\nUSA South Gate Local Supply Chain/Logistics Operations\nLast application date: 27/2/2022", "url": "https://www.indeed.com/viewjob?jk=2cc052192d26f686&from=serp&vjs=3"},
{"job_title": "newEngineer - Electrical", "summary": "To assist the Engineering/Maintenance Departments in start-up of new and troubleshooting of manufacturing equipment.\nFunction as a resource to hourly craftsmen.", "company": "Goodyear", "location": "Lawton, OK+2 locations", "job_description": "Location: US-OK-LAWTON-PLT-0153-2170\nGoodyear Talent Acquisition Representative: Heather Rodriguez\nSponsorship Available: No\nRelocation Assistance Available: Yes\n#LI-HR1\nPrimary Purpose of the Position:\nTo assist the Engineering/Maintenance Departments in start-up of new and troubleshooting of manufacturing equipment. Must be able to properly adjust, troubleshoot and repair all automatic, electronic, and electrical systems in a heavy manufacturing environment. Demonstrated ability to direct installation, programming PLC logic, AC and DC Drives installation, replacement and setup and all manner of upper level electrical devices for control.\nPrinciple Duties and Responsibilities:\nLearn and maintain a working knowledge of all equipment in the plant. Transfer that knowledge to hourly maintenance craftsmen to better enable them to repair/maintain plant equipment.Assist the Engineering Department in the start-up and troubleshooting of new and revised equipment. Function as a resource to hourly craftsmen. 20% Assist with revising, adapting, or redesigning components and/or systems that become obsolete. Assist with Installing, properly adjusting, troubleshooting and repairing all automatic, electronic and electrical systems.Implement processes & methods that meet internal & external customer requirements. Develop and implement machine technology upgrades to improve quality, productivity, and safety. Support the evaluation of products, processes, methods & obtain maximum results.\nEducation & Certifications:\nBachelors degree in Electrical Engineering\nExperience:\n(0-2 years) Training with PLC's, AC / DC Variable speed drives, Electronic Test Equipment, Mechanical Devices and Calibration of electronic devices. Functional knowledge of all voltages through 480v. required, with working knowledge through 4,600v. desired.\nKnowledge, Skills & Abilities:\nPC SkillsExcellent problem solving and troubleshooting skills.Self-motivated and willing to take initiatives with a positive attitude.Strong verbal and written communication skills and strong interpersonal skills.Ability to work in a team environment.Understanding of technical drawings & procedures (Auto CAD, Autodesk inventor).\nGoodyear is one of the world’s largest tire companies. It employs about 62,000 people and manufactures its products in 46 facilities in 21 countries around the world. Its two Innovation Centers in Akron, Ohio and Colmar-Berg, Luxembourg strive to develop state-of-the-art products and services that set the technology and performance standard for the industry. For more information about Goodyear and its products, go to www.goodyear.com/corporate.\nGoodyear is an Equal Employment Opportunity and Affirmative Action Employer. All qualified applicants will receive consideration for employment without regards to that individual's race, color, religion or creed, national origin or ancestry, sex (including pregnancy), sexual orientation, gender identity, age, physical or mental disability, veteran status, genetic information, ethnicity, citizenship, or any other characteristic protected by law.\nIf you need reasonable accommodation to complete the online application, or any other part of the employment process, please contact the Goodyear Candidate Care Line at 330.796.4500.\nClick here for more information about Equal Employment Opportunity laws, and here for additional supplementary information.", "url": "https://www.indeed.com/viewjob?jk=6cdfba53a0c7ab68&from=serp&vjs=3"},
{"job_title": "PRODUCTION SUPERVISOR - D SHIFT", "summary": "As the Production Supervisor, you would be responsible for coordinating and leading all aspects of the daily activities of your team.", "company": "Nike", "location": "Saint Charles, MO 63304", "job_description": "Become a Part of the NIKE, Inc. Team\nNIKE, Inc. does more than outfit the world’s best athletes. It is a place to explore potential, obliterate boundaries and push out the edges of what can be. The company looks for people who can grow, think, dream and create. Its culture thrives by embracing diversity and rewarding imagination. The brand seeks achievers, leaders and visionaries. At NIKE, Inc. it’s about each person bringing skills and passion to a challenging and constantly evolving game.\nAt Air Manufacturing Innovation (Air MI), we deliver on Nike’s most daring dream: giving every athlete the unparalleled sensation of walking on air. Since Nike introduced the Air sole in 1979, no technology has become more synonymous with Nike than Air. Our teams engineer, make and perfect Nike’s most advanced footwear components. Masters of teamwork, we challenge assumptions in order to get faster, drive efficiency and fine-tune technology to deliver quality performance plastic. At our state-of-the-art facilities located in Beaverton, Oregon and St. Charles, Missouri, Air MI is taking Air to places that we never thought possible. Learn more about Nike Air Manufacturing Innovation.\nWho we are looking for :\nAs the Production Supervisor, you would be responsible for coordinating and leading all aspects of the daily activities of your team.\nWhat you will be doing:\nYou would be responsible for maintaining a safe work environment and promoting a safe work culture. You would set priorities and coordinate the work activities to achieve operational goals and deadlines ensuring on time delivery of products to customers. You would be responsible for identifying, troubleshooting and resolving technical and operational issues. You would ensure departmental operational supply inventories are maintained. This role is responsible for supporting continuous improvements and promoting a lean manufacturing culture.\nSHIFT D: Friday- Sunday & every other Thursday 5:30pm-5:30am\n\n\nWhat you bring:\nBachelor’s degree or other manufacturing related degree with a minimum of 2-3 years’ experience in a leadership role or 2 additional years’ experience may be considered\nDemonstrated ability to make decisions and set direction\nExcellent Communication skills\nProven project management skills\nDemonstrated team building and leadership skills\nStrong technical expertise in a manufacturing environment\nExperience in LEAN Manufacturing or similar principles and practices\nAbility to work with stakeholders of all levels\n\nNIKE, Inc. is a growth company that looks for team members to grow with it. Nike offers a generous total rewards package, casual work environment, a diverse and inclusive culture, and an electric atmosphere for professional development. No matter the location, or the role, every Nike employee shares one galvanizing mission: To bring inspiration and innovation to every athlete* in the world.\nNIKE, Inc. is committed to employing a diverse workforce. Qualified applicants will receive consideration without regard to race, color, religion, sex, national origin, age, sexual orientation, gender identity, gender expression, veteran status, or disability.", "url": "https://www.indeed.com/viewjob?jk=e11445c5803725b8&from=serp&vjs=3"},
{"job_title": "Sales Associate/Cashier", "summary": "_We are currently looking for an outgoing, proficient, and detail-oriented Sales Associate and Cashiers to help assist us with customer accounts, transactions,…", "company": "NxtGen Acquisitions", "location": "Hallandale Beach, FL 33009", "job_description": "NxtGen Acquisitions is an advertising and consulting firm located in Halladale Beach, Florida. We aim to provide the best in customer service, planning and results for our clients. We are currently looking for an outgoing, proficient, and detail-oriented Sales Associate and Cashiers to help assist us with customer accounts, transactions, and customer relations.Sales Associate/Cashier Job Requirements: Must be personable, energetic, positive and enjoy working with people daily.Delivering sales, outstanding customer experience, and operational expectations.Work successfully in a team environment as well as independently.0-3 years of retail experience.Utilizing systems with points of sale and handling cash/credit transactions.Maintaining personal and productivity goalsProvide excellent Customer Service to clients and customers.Ability to learn and share expertise of products and trends to fit customer’s needs.Sales Associate/Cashier Qualifications/Requirements: Be able to work FULL TIME Hours (Monday-Friday).Thrive in dynamic and collaborative environment.Have reliable transportation to our office.At least 18 years of age.Previous experience in Retail or similar position (0-3 years required).We want to hear from you!Apply directly to this ad with a copy of your resume. If you are confident in your interpersonal skills and love working in a dynamic, fast paced environment.Job Types: Full-time, Part-timePay: $600.00 - $800.00 per weekSchedule:8 hour shiftMonday to FridayWork Location: One location", "url": "https://www.indeed.com/viewjob?cmp=NxtGen-Acquisitions&t=Sales+Associate+Cashier&jk=7d3b9cfcaab963db&vjs=3"},
{"job_title": "Cashier", "summary": "Provide excellent, consistent customer service.\nMaintain the Merchandising of Product Displays (different focus based on department).", "company": "Le District", "location": "New York, NY 10281 (Battery Park area)", "job_description": "Company Name: Le DistrictLocation: 225 Liberty Street Tower 2 New York, NY 10281Position: CashierJob Description: Seeking a few individuals to work at Le District’s Rotisserie departmentThe ideal candidates will have an outgoing personality, strong work ethic, and interested in interacting with customers.Job Duties:Provide excellent, consistent customer serviceMaintain the Merchandising of Product Displays (different focus based on department)Understand and maintain Le District's philosophy and aesthetic, including retail displays and signage; regularly check for qualityBe familiar with all equipment: POS systemMaintain cleanliness of work stationsPossess food handling skillsJob Requirements:Ability to stand for a minimum of 6 hoursFood Handling experience a plusOutgoing personalityBasic food prep knowledgePrevious experience as a Counter/Cashier/Retail requiredGood communication skillsGood organizational skills, and a sense of timingFlexible to work days, nights, weekends and holidaysTo Apply:Respond to this Job Posting with a resume in Word or PDF format.If chosen, you will be contacted by a Manager for an interview.Best of Luck,HRJob Types: Full-time, Part-timePay: From $17.00 per hourSchedule:Monday to FridayWeekend availabilityCOVID-19 considerations:All staff are required to be fully vaccinated per the NYC Mandate. This means you must have had 2 shots of a COVID vaccination.Education:High school or equivalent (Preferred)Experience:Cashiering: 1 year (Preferred)Work Location: One location", "url": "https://www.indeed.com/viewjob?cmp=Le-District&t=Cashier&jk=aaf1ab84cd06cd73&vjs=3"},
{"job_title": "Production Engineer", "summary": "Founded in 1950, Callon Petroleum Company is an independent oil and natural gas company focused on growing production and reserves from our oil-weighted, multi…", "company": "Callon Petroleum Operating Company", "location": "Hybrid remote in Midland, TX", "job_description": "Description:\n\nFounded in 1950, Callon Petroleum Company is an independent oil and natural gas company focused on growing production and reserves from our oil-weighted, multi-play, multi-pay assets in West and South Texas. Callon Petroleum is currently accepting resumes for a Production Engineer position based in the Midland, TX office. Callon Petroleum Company offers competitive pay, paid time off, paid holidays along with a benefits package including health, dental, vision, and life insurance.\nPosition Description:Create cost estimates and AFEs for workovers and well maintenance operations.Coordinate with Reservoir Engineers, Geologists, and Frac Specialists to optimize new well completions.Coordinate with Field Operations and Production Surveillance teams to optimize base production.Design, analyze and make recommendations to optimize artificial lift systems.Analyze well failures and make recommendations for optimization.Assist with chemical program remediation.Coordinate with Reservoir Engineers and Geologists in developing capital programs.Track and monitor capital spending to ensure compliance with capital budgets.Coordinate with Field Operations to develop LOE budget.Track and monitor LOE spending to ensure compliance with LOE budgets.Provide technical support to Field Operations, Drilling, Reservoir Engineering, and Geology.\n. Requirements:\nA minimum of a BS in EngineeringA minimum of 5 years industry experience, 7+ preferredAdvanced knowledge of gas lift, electric submersible pumps, rod pumping systems design and optimizationAdvanced knowledge of workover operationsStrong knowledge/and or experience with H2SStrong failure prevention skillsHorizontal and multiple stage completion experience preferredFamiliar with Industry Engineering software packages (i.e. Spotfire, Rodstar, etc.)Experience in Operations preferred – either as Engineer, Production Foreman or similarSelf-starter requiring minimal supervisionProven innovator, excellent collaborator and communicatorGood leadership skillsMust be able to work a partial remote schedule (3 days in the office and 2 days remotely) with the ability to transfer to an in-office schedule by 2022Meet and maintain eligibility requirements to drive a company vehicle.Must be able to work in the United States without the assistance of sponsorship.\nCallon Petroleum Company is an equal opportunity employer, and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity or expression, pregnancy, age, national origin, disability status, genetic information, protected veteran status, or any other characteristic protected by law.", "url": "https://www.indeed.com/viewjob?jk=8a1690fd3856ff86&from=serp&vjs=3"},
{"job_title": "newInside Sales Representative", "summary": "We offer a competitive salary and huge bonuses on sales.\nTop of the line sales tools, everything you need to succeed.\nAll of our Closers make 6 Figures and up.", "company": "River City Marketing", "location": "Remote", "job_description": "RCM is a Digital Marketing conglomerate that has been an industry leader for well over a decade. Our sales teams are well trained and well taken care of.Are you a seasoned Closer looking for your next big opportunity in Sales? Want to start making real money, working with real sales professionals?Come join the winning team, 10+ years of success and growth.Remote Position must have a proper home office or similar.Digital Marketing Agency seeks energetic and motivated Closers for full-time positions.We offer a competitive salary and huge bonuses on sales. All of our Closers make 6 Figures and up.What we are looking for:Someone who is highly money motivated, energetic, positive, and most of all coachable.Someone who can work full time 8am - 4pm PST, Monday - Friday.Someone who is tech savvy and knows how to use a computer well.An experienced Closer who is not afraid to ask for the close.Someone who can easily work remotely and has a remote workplace setup.Punctuality. Must be places when you say you are going to be there.Must be money motivated.This is a position with endless opportunities for growth! If you are highly motivated, energetic, and a team player then you will fit right in.Our Inside Sales Agents are responsible for educating potential clients on our services and signing them up for the right package. Being able to close a deal over the phone is a must, let us show you how!No Limit on Earnings or Commission - Aggressive Closers Make Huge Money Here.8am - 4pm PST Monday - Friday, No Weekends!We Offer:Full TrainingEasy to Use SoftwareTop of the line sales tools, everything you need to succeedScripts, Scripted Rebuttals, Tips and TricksGreat Hourly Pay and Huge BonusesA winning team atmosphereFriendly, collaborative atmosphere and cultureRCM is an Equal Opportunity Employer. We are committed to equal treatment of all employees without regard to race, national origin, religion, gender, age, sexual orientation, veteran status, physical or mental disability or other basis protected by law. This is a 1099 position.Job Type: Full-timePay: $60,000.00 - $210,000.00 per yearSchedule:8 hour shiftMonday to FridaySupplemental Pay:Bonus payEducation:High school or equivalent (Preferred)Experience:Sales Account Executives & Managers: 1 year (Preferred)Work Location: Remote", "url": "https://www.indeed.com/viewjob?cmp=River-City-Marketing&t=Inside+Sales+Representative&jk=7eba3df40182f2f6&vjs=3"},
{"job_title": "newCashier", "summary": "Our team also enjoys great benefits, including daily cash tips, bonus opportunities, valet uniforms, flexible schedules, a daily pay program, cool cars,…", "company": "Parking Management Company", "location": "Baton Rouge, LA 70801 (Downtown area)", "job_description": "Parking Management Company in Baton Rouge, LA is calling all friendly and responsible customer service professionals to apply to join our amazing team as a full-time, part-time, or seasonal Cashier!\nWHY YOU SHOULD JOIN OUR TEAM\nWe are a thriving company that values our employees. We pay our Cashiers a competitive wage of $12/hr. Our team also enjoys great benefits, including daily cash tips, bonus opportunities, valet uniforms, flexible schedules, a daily pay program, cool cars, opportunities for growth, and more. Additionally, our full-time employees receive a great benefits package. We also make it easy to apply with our initial quick mobile-optimized application. If we have your attention, please continue reading!\nABOUT PARKING MANAGEMENT COMPANY\nFounded over 25 years ago in Nashville, Tennessee, PMC is a well-established parking management leader that provides the highest level of valet services in cities across the United States. We are one of the fastest-growing companies in the hospitality industry, and our valet parking services extend to 5-star hotels, resorts, hospitals, restaurants, and special events. Our mission is to uphold personal, longstanding relationships with our clients by maintaining the highest standard of customer service.\nEven during our outstanding growth, we have never forgotten who made us the successful company we are now. We believe that customer service is not just for our guests but our employees as well. Our team is made up of exceptional individuals, and we want our associates to be excited about coming to work every day. We strive to maintain a positive work environment to help our employees thrive in their careers!\nARE YOU A GOOD FIT?\nAsk yourself: Are you good at maintaining confidentiality? Do you thrive in a fast-paced environment? Can you prioritize high-quality customer service? Are you kind and friendly? Do you want an opportunity to choose either full-time, part-time, or seasonal work? If so, please consider applying for this customer service position today!\nYOUR LIFE AS A CASHIER\nThis cashier position offers full-time, part-time, and seasonal opportunities.\nAs a Cashier for our valet services, you play a vital role in keeping the operations of our company running smoothly! Your friendly nature serves you well as you greet customers and initiate sincere conversation. You responsibly handle cash transactions with close attentiveness to detail and the utmost responsibility. No matter the weather conditions, you enjoy being outside instead of stuck at a desk. Whether working by yourself or with others, you maintain a positive attitude and keep an accurate inventory of the available parking spaces. You enjoy meeting new people each day, experiencing variety in your work, and playing an important part in the company's success.\nWHAT WE NEED FROM YOU\nAt least 18 years old\nExperience with handling cash\nWillingness to work outside in all types of weather\nIf you can meet these requirements and perform this full-time, part-time, or seasonal customer service job as described above, we would be happy to have you as part of our team!\nLocation: 70801", "url": "https://www.indeed.com/viewjob?jk=fca9e6dcdce6f4da&from=serp&vjs=3"},
{"job_title": "newCustomer Service Representative - HYBRID", "summary": "* Effectively acts as a liaison between internal departments and outsourcing companies or brokers.\nStrong work ethic, effective interpersonal skills including…", "company": "Financial Pacific Leasing", "location": "Remote", "job_description": "Are you a motivated, detail-oriented, and driven Customer Service specialist? If so, we are looking for Y-O-U! Join our diverse and inclusive team where you’ll feel valued and inspired to contribute your skills and experience.The Company:  Financial Pacific Leasing, a subsidiary of Umpqua Bank, is a direct provider of small-ticket commercial equipment leases. Our employees are smart, hardworking, and fun! We believe that quality service, innovative products, and strong relationships are the key to success for all businesses.Excellent benefits and retirement package.Personal Attributes Required: Strong work ethic, effective interpersonal skills including excellent verbal and written communication, team and goal oriented, professional attitude, work well under pressure, attention to detail, organized, flexible, honest.Job Duties: * Responsible for communicating effectively and professionally while handling incoming calls and written communication from/to customers.* Troubleshoots, analyzes, and remedies internal and external customer issues in a timely and efficient manner and within established guidelines.* Effectively acts as a liaison between internal departments and outsourcing companies or brokers.* Uses knowledge of company systems such as Isaac and Artiva, and performs tasks accurately, to the benefit of the company and our customers.* Responsible for keeping management up to date on any significant situations which could cause harm to the company.* Develops and enhances positive and professional relationships with all customers, internal and external.* Calculates and communicates buyouts (early term, ending and vendor) to customer, broker or vendor.* Prepares payment and contract adjustments.* Performs all other duties as assigned by management.Other Training, Skills and Experience Requirements: High school graduate or equivalent preferred.Physical Requirements & Working Conditions: Work involves sitting, occasional walking, and lifting up to 10 pounds. Requires close visual acuity. Normal office environment. Limited travel.No relocation offered.Umpqua Bank is committed to employing a diverse workforce. Qualified applicants will receive consideration without regard to race, color, religion, sex, national origin, age, sexual orientation, gender identity, gender expression, protected veteran status, or disability. We maintain a drug-free workplace and may perform pre-employment substance abuse testing.Job Type: Full-timePay: $33,746.00 - $40,986.00 per monthBenefits:401(k)401(k) matchingDental insuranceDisability insuranceEmployee assistance programEmployee discountFlexible spending accountHealth insuranceHealth savings accountLife insurancePaid time offVision insuranceWork from homeSchedule:8 hour shiftDay shiftMonday to FridayCOVID-19 considerations:For the protection of our employees we have made arrangements to allow a significant number of our workforce to work remotely. For those who remain in offices, we are actively reinforcing the prevention measures outlined by the CDC.Education:High school or equivalent (Preferred)Experience:Customer Support & Client Services Occupations: 1 year (Preferred)Work Location: Remote", "url": "https://www.indeed.com/viewjob?jk=2162557244771906&q=Office&l=USA&from=web&advn=5337766920021009&adid=383553461&ad=-6NYlbfkN0BjPKvYaAZu7RbvgHcikX-oOEEFs-bBvMG6igDrFCdWeWqA2KcOlUMv2-g2T5jve1xzT0TV8XD49EZORgimsMtf9QjF333YY17Fd1s6AHHV0btnkdjxz7x46ugvgu3OzxgMNTpdeDsZaz3NZjTzbLU3o6u3ggmHjRIBzVVVoqYpBbLc2rUzPz5WGCUq0LB-gT_cxlDSofv3Ap4UdCejDNSJc-oJRKx8iCFkuL3FuG2BiX9Crtd7iWKeudeYgy9flIoZHYLCnex8B9HH49_mLBR9l6S9ZG-Bsdi_WfKhpZtBp7RBUuOxVUBpE37HQFGkYqvapp0MmbtzwluWLZ-x-D_JJxfYb52nTVY5ocbCwJe_EnXmGR3aKvDV&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "FNS, Cashier", "summary": "Cashier is responsible for handling cash, credit/debit card, and employee badge transactions in the Bistro.\nCashier will also be responsible for the preparation…", "company": "FirstHealth of the Carolinas", "location": "Raeford, NC 28376", "job_description": "Cashier is responsible for handling cash, credit/debit card, and employee badge transactions in the Bistro. Prepares daily deposits and balancing of the cash drawer. Cashier will also be responsible for the preparation and serving of food under the supervision of the Food Service Supervisor. Responsibilities will also including cleaning of the kitchen/Bistro. Serves patients and customers with good Customer Service skills.\n\nCasual part time position working varied days 7:30am-3:30pm, and every other weekend.\n\nQualifications: High school graduate or GED. Previous food service and cashier experience preferred.\n\nLocation: FirstHealth of the Carolinas · Food & Nutrition\nSchedule: Casual Part Time: under 20 hrs/wk, Day Shift, Varied days 7:30a-3:30p & every other weekend", "url": "https://www.indeed.com/viewjob?jk=51964021e4caee80&from=serp&vjs=3"},
{"job_title": "Product Development Engineer I", "summary": "This position is eligible for a hybrid schedule of work from home and office.\nWe offer 100% employer-paid medical, dental and vision benefits for employee only…", "company": "Paragon 28 Inc", "location": "Hybrid remote in Englewood, CO+1 location", "job_description": "Paragon 28 is looking to hire several Product Development Engineer I roles with a starting range of $70 - $80,000/year, dependent upon experience, education and skills! This position is eligible for a hybrid schedule of work from home and office.\nWe offer 100% employer-paid medical, dental and vision benefits for employee only coverage and generously subsidized premiums for coverage with dependents in addition to company paid life and disability benefits. Voluntary life/disability/accident options as well as flexible spending account plans are also available. We have a safe harbor 401(k) Plan with 3% match and PTO Plan allowing accrual of 19 days over 12 months to maintain a fulfilling work/life balance. Our working environment is considered “Colorado Casual”. Onsite we have a fresh food kiosk, free parking and fitness center!\nLocated at 14445 Grasslands Dr., just off E-470 and Peoria St. on the east side of Englewood, CO, P28 is a leader in the development and distribution of medical solutions for the foot and ankle industry.\nEstablished in 2010, we are dedicated to creating industry leading solutions and tools to improve the treatment of the most challenging foot and ankle conditions. Every member of our inspired and dedicated team serves a vital role in the achievement of our mission: to strategically build a company around the core principles that drive innovation and quality.\nParagon 28 is an equal opportunity employer and values diversity. All employment decisions are decided on the basis of qualifications, merit and business need.\nJob Title\nProduct Development Engineer I\nReports To\nSr. Director of Engineering\nJob Overview\nThe Product Development Engineer I has responsibility for leading various aspects of design and development as part of a project team with direct supervision. This position participates on meaningful projects that focus on design and development of medical devices with increasing levels of autonomy.\nEssential Responsibilities and Duties\nProduce deliverables in support product development efforts from ideation to commercialization through entire product life cycle and on a given timeline, as directed by senior engineering staff, including:\nResearch and evaluate competitive product for performance characteristics\nConceptualization of new design ideas with some understanding of the inadequacy of existing designs\nParametric modeling and detail design of P28 implant and instrument development\nWork within the P28 product development procedure to create design control documentation for P28 design history files and technical files.\nParticipate in development of testing protocols and assist in the testing process for new and existing products\nCompile and comprehend test results and implement/recommend appropriate design changes\nParticipate in activities related to project phase gate design reviews\nInterface with 3rd party suppliers, contractors, testing houses, etc.\nAssist the P28 Quality and Supply Chain departments to evaluate new suppliers for inclusion in the P28 approved supplier list\nAssist P28 quality team in developing inspection plans\nObserve surgery (live, cadaver, or video) on lower extremity pathology and formulate physician comments/ideas into meaningful design solutions. Document all notes.\nWork to become technical expert resource within specific product categories for sales support and other departments via phone and live product training.\nAssist on patent application preparation\nAssist with other development projects as additional resource when needed, while balancing own workload\nOther duties as directed by manager\nWork Environment\nThis job operates in a professional office environment. This role routinely uses standard office equipment such as computers, phones and copy machines. Occasional use of the development and quality labs necessary, adhering to all lab safety requirements. This position will work with cadaveric specimens.\nPhysical Demands\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job.\nWhile performing the duties of this job, the employee is regularly required to communicate with individuals internal and external to the organization. The employee frequently is required to move about the facility. The employee is required to have close visual acuity to perform activities such as: viewing a computer terminal; inspection of design drawings and small parts. The employee may be required to lift up-to 35 lbs. by themselves.\nPosition Type/Expected Hours of Work\nThis is a full-time position with typical business hours and is eligible for a hybrid schedule of work from home/office. It may reasonably require additional hours during the week and weekend; specific requirements will be determined with Manager.\nTravel\nUp to 10% of overnight travel.\nNotice to Recruiters and Staffing Agencies: to protect the interests of all parties, Paragon 28, Inc. will not accept unsolicited resumes or referrals from any source other than directly from a candidate or an approved vendor that has a written and signed agreement in place through the Paragon 28, Inc. HR department. Please do not contact or forward resumes or referrals to our company employees. Any unsolicited resumes will be considered Paragon 28, Inc. property. Paragon 28, Inc. is not responsible for any charges or fees related to unsolicited resumes or referrals.\nRequires a bachelors degree in Mechanical Engineering, Biomedical Engineering or related engineering discipline with 2-4 years of experience.\nPrior experience in medical device development helpful.\nExperience in taking medical device or similar product from ideation to commercialization helpful.\nUnderstanding of medical device industry regulatory requirements preferred.\nExperience with CAD. SolidWorks preferred.\nHigh proficiency in MS Office\nEffective communication and presentation skills with ability to convey information and respond to questions from groups of peers\nAbility to work in a team environment", "url": "https://www.indeed.com/viewjob?jk=c3b4c612e9d862d2&from=serp&vjs=3"},
{"job_title": "newCAFE CASHIER", "summary": "Job Description School/Center: Port Malabar Elementary Location: 301 Pioneer Avenue, Palm Bay Job Number: 000345 School Year: 2022 FY Position: CAFE CASHIER…", "company": "Brevard Public Schools", "location": "Palm Bay, FL 32907+4 locations", "job_description": "Job Description\nSchool/Center: Port Malabar Elementary\nLocation: 301 Pioneer Avenue, Palm Bay\nJob Number: 000345\nSchool Year: 2022 FY\nPosition: CAFE CASHIER\n\nSubtitle/Areas:\nApply By: 02/09/2022\nDate Available: 01/26/2022\nStatus: All Applicants\n\nContract: 9 Month\nHours/Day: 4.000\n\nQualifications/Certifications:\nJob Type: Support Personnel\nInstructional Subject: N/A\nSupport Personnel Area: Food Service\nCareer and Technology Ed Subject: N/A\nCoaching Activity: N/A", "url": "https://www.indeed.com/viewjob?jk=8a626d923948c741&from=serp&vjs=3"},
{"job_title": "General Counsel", "summary": "As General Counsel at Soar, you will work on a range of corporate-related issues, including but not limited to negotiating and drafting documents for financing…", "company": "Soar", "location": "Remote in New Jersey", "job_description": "General Counsel\nNew Jersey, United States.\nAs General Counsel at Soar, you will work on a range of corporate-related issues, including but not limited to negotiating and drafting documents for financing transactions, advising on corporate governance, managing corporate filings, managing the corporate record-keeping process, assisting on employment and litigation matters, and supporting investor relations.\nResponsibilities:\nReview, draft, and negotiate documentation for different kinds of transactions, including services and consulting agreements, real estate leases, venture financing agreements, M&A Transactions, licensing agreements, software and hardware agreements, and other agreements related to SOAR.\nAssist and advise on corporate governance matters, corporate structure, equity plan management, and compliance, ensure appropriate maintenance of corporate records for SOAR.\nAssist in employment and litigation matters.\nRespond to legal requests from all divisions of the company.\nDraft, implement and oversee internal company policies, procedures, and strategies.\nQualifications\nAt-Minimum 4 years of legal experience working in the corporate group of an AM Law 100 or 200 law firm and/or in-house as an attorney providing guidance on corporate-related issues.\nAbility to translate legal advice into actionable guidance.\nAbility to work under pressure, prioritize and manage a diverse workload, and meet deadlines in a dynamic, fast-paced environment.\nA high level of professionalism, outstanding business judgment, and high legal analytical skills.\nExperience Working in the Technology Industry.\nExperience advising emerging technology companies.\nEducation\nJ.D. from an American Bar Association-accredited law school, membership to at least one recognizable bar, and in good standing or otherwise authorized to practice law in-house.\nSOAR is an equal opportunity employer.", "url": "https://www.indeed.com/viewjob?jk=55b5264bc4d271b3&from=serp&vjs=3"},
{"job_title": "Office Assistant/Data Entry", "summary": "This position supports the executive administrative assistant and professional staff.\nSmall financial services firm located in Westlake, Ohio has an immediate…", "company": "Francis P. Gallagher & Associates, Inc.", "location": "Westlake, OH 44145", "job_description": "OFFICE ASSISTANT/DATA ENTRYSmall financial services firm located in Westlake, Ohio has an immediate opening for an office assistant/data entry position. Duties include data entry, word processing, scanning documents, answering phones, filing and general office tasks. This position supports the executive administrative assistant and professional staff. This is a full time position with benefits. A successful applicant must have at least 5 years of experience as an office assistant and have proven experience with Microsoft Office (Word, Excel and Outlook)Benefits include: health, dental and vision insurance. A 401(k) retirement plan with an employer match is an additional benefit.Applicants must show proof of Covid vaccination.Job Type: Full-timePay: $20.00 - $25.00 per hourBenefits:401(k)401(k) matchingDental insuranceHealth insuranceRetirement planVision insuranceSchedule:Day shiftMonday to FridayCOVID-19 considerations:All employees are required to show proof of Covid-19 vaccinations. Visitors are required to wear masks.Application Question(s):Can you show proof of Covid vaccinations?Experience:administrative: 5 years (Required)Work Location: One location", "url": "https://www.indeed.com/viewjob?jk=0510a3849beeb668&q=Assistant&l=USA&from=web&advn=8875358024114292&adid=382422830&ad=-6NYlbfkN0CmnTafR_tpmUUeWoBHWy_hyM4Mxs_Jh_M5jBO-XN0x-2fYqLR60OsIBIXjl-mv3b8SZJd1dgLvUCEgq-Z-qT0YyxaO6tF267tGaDu8olt115k5d9Elrs5W0WLjbmpmlmJzjwW9g_32wZVBpHznwCvbau8cxPClo4OzxZn3kBNij59XlP0V3VSI7wxPldS0Y25hMAmw7I5IFNVl9tB_UMOQwWXqhZRQUAmwW65nz3qQ3m2R8WCGmLcRXfLVNERo-QbQCQd3O0jvjJOLC4TJkhzii2Migvh6WQKyFU-0_b-Ui0l-LqRgrSebmV9J5VcMZaQIET9pryBbKITtmjCesFB8UwR2ffwju5gR6PGJec5L9v4ya_mE-Wzv&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "Junior Associate", "summary": "The Legal Department is responsible for enforcing WMG’s rights in the recorded music catalog repertoire controlled by its U.S. record labels, managing…", "company": "Warner Music Group", "location": "Hybrid remote in Nashville, TN", "job_description": "At Warner Music Group we’re all about our people. Our global company is made up of knowledgeable, passionate, and creative individuals. Our commitment to Diversity, Equity and Inclusion fosters a culture where you can truly belong, contribute, and grow. We believe in each individual’s value and encourage applications from people of any age, gender identity, sexual orientation, race, religion, ethnicity, disability, veteran status, and any other characteristic or identity.\nIt is the mission of every member of the WMG team around the world to create a nurturing environment for artists, songwriters, and the people behind the music – at every stage of their career. We strive to set WMG apart by embracing innovation – an integral part of our company's DNA.\nConsider a career at WMG, and be a part of one of the most influential forces in culture today.\nJob Title: Jr. Associate, Legal Affairs\nA little bit about our team:\nWarner Music’s Center of Excellence for Shared Services opened in 2017 and is the home to the financial, legal, and administrative functions that provide critical support and best-in-class services to our U.S. Recorded Music and Publishing businesses. The Nashville center embodies the innovative and creative spirit that stems from the company’s deep history in nurturing entrepreneurial thinking and artist-focused innovation, enabling our employees to develop a wide range of skills through cross-function collaboration and development opportunities.\nThe Legal Department is responsible for enforcing WMG’s rights in the recorded music catalog repertoire controlled by its U.S. record labels, managing litigations involving WMG’s recorded music catalog rights in conjunction with WMG’s corporate litigation in-house counsel, fielding inquiries and claims from third parties, researching WMG’s recorded music catalog rights, filing applications to register copyrights in and to WMG’s recorded music repertoire, and managing WMG’s relationships with the labor unions with which WMG’s U.S. record labels have collective bargaining agreements.\nMembers of the Legal Department work closely with employees in the Business Affairs, Finance, Production, Operations, New Media, and Marketing departments of each label client to fulfill the above-referenced responsibilities for the recordings and records those labels release.\nWe have transitioned to a hybrid work schedule at this time, allowing our employees to work a combination of in-office and virtual days. These work arrangements will be periodically reviewed based on business needs.\nWhy this could be your next big break:\nThe candidate hired to fill this position will: (1) conduct general legal research pertaining to WMG’s rights in its existing recording agreements and advise various internal business units regarding those rights and recording agreements, (2) field, research, answer, and resolve inquiries from both internal business units and artists, producers, and other third parties, and (3) assist with the management of incoming claims and the enforcement of WMG’s recorded music rights.\nHere you’ll get to:\nPerform general catalog legal research pertaining to WMG’s rights in its existing recording agreements and other contracts, including reviewing, analyzing, and interpreting various provisions in the recording agreements and other contracts at the request of various internal business units such as the royalty, publishing, and revenue assurance teams;\nField, research, answer, and resolve incoming inquiries from recording artists, producers, and other third party royalty participants and their representatives;\nField, research, and resolve incoming legal claims from recording artists, other third parties and their representatives, including, without limitation, accounting claims, copyright claims, sample claims, and reversion-of-rights claims;\nCommunicate the relevant details of the aforementioned incoming inquiries and claims to the relevant internal clients and work with other attorneys in the Legal Department to secure the approval of such clients over the resolution of such matters;\nDraft legal documents ( e.g. , cease and desist letters, indemnification letters, tolling agreements, settlement agreements, etc.) as directed by other attorneys in the Legal Department;\nAssist the corporate in-house litigation team by performing legal research; and,\nPerform other tasks as requested by Legal Department senior management and various business units across WMG\nAbout you:\nJuris Doctor degree from an ABA-accredited, U.S. law school is required;\nLicense to practice law in Tennessee is required;\nCandidate must be a problem solver, with the ability to find timely and creative solutions to unique issues and assignments;\nCandidate must possess excellent verbal and written communication skills;\nCandidate must possess excellent analytical, mathematical, and organizational skills;\nCandidate must possess strong legal and Internet research skills;\nCandidate must have strong computer skills and proficiency using Microsoft Office’s Excel, Word, and PowerPoint applications;\nCandidate must be able to work well independently and as part of a team;\nCandidate must be able to meet deadlines consistently and effectively while working under pressure; and\nCandidate must be able to manage multiple assignments at any given time and prioritize them effectively and appropriately.\nIt would be music to our ears if you also had:\n1 or more years of relevant music industry and/or law firm experience, including reviewing and analyzing music industry recording agreements and resolving legal claims.\nAbout us:\nWith its broad and diverse roster of new stars and legendary artists, Warner Music Group is home to a collection of the best-known record labels in the music industry including Asylum, Atlantic, East West, Elektra, FFRR, Fueled by Ramen, Nonesuch, Parlophone, Rhino, Roadrunner, Sire, Warner Records, Warner Classics, and Warner Chappell Music, one of the world's leading music publishers with a catalogue of more than one million copyrights worldwide.\nFor more than four decades, WMG has been an industry-leading force in providing a world-class array of services designed to help artists and labels grow their careers and their businesses. Artist & Label Services is the umbrella for WEA (Warner-Elektra-Atlantic) – the pioneering WEA distribution and marketing network – and Alternative Distribution Alliance (ADA) – the ground-breaking global distribution company for independent artists and labels.\nLove this job and want to apply?\nClick the “Apply” link at the top of the page, or apply directly with your LinkedIn. Applying with LinkedIn will import all of the information you put in your profile but will still allow you to upload a resume and cover letter.\nDon’t be discouraged if you don’t hear from us right away. We’re taking our time to review all resumes and to find the best people for WMG.\nThanks for your interest in working for WMG. We love it here and think you will too.\nWMG is committed to inclusion and diversity in all aspects of our business. We are proud to be an equal opportunity workplace and will evaluate qualified applicants without regard to race, religious creed, color, age, sex, sexual orientation, gender, gender identity, gender expression, national origin, ancestry, marital status, medical condition as defined by state law (genetic characteristics or cancer), physical or mental disability, military service or veteran status, pregnancy, childbirth and related medical conditions, genetic information or any other characteristic protected by applicable federal, state or local law.", "url": "https://www.indeed.com/viewjob?jk=9a38af479c8f3774&from=serp&vjs=3"},
{"job_title": "Chemical Process Engineer", "summary": "The process areas include raw materials, production processing and finished product testing and analysis.\nProvides chemical process support in multiple areas in…", "company": "Kingspan Insulated Panels", "location": "Remote in Modesto, CA", "job_description": "Overview:\n\nKingspan Insulated Panels North America, a division of the Kingspan Group plc headquartered in Ireland, is a global and trusted leader in the design, manufacturing, and supply of high-performance sustainable building products and solutions for the construction industry. As the most energy-efficient, cost-effective building envelope solutions, insulated metal panels are at the forefront of sustainability. We serve the architectural, commercial/industrial, cold storage and food processing markets, and are committed to delivering the most advanced building products on the market. Learn about our Planet Passionate initiatives: https://www.youtube.com/watch?v=EEeIS55WMOk\nAt Kingspan, our future success is based on the quality of our people, who's expertise and motivation have helped ensure that we remain at the forefront of the construction materials manufacturing industry. In joining Kingspan you become an important part of a growing organization with a reputation for innovative design and use of technology, technical expertise, product quality, service excellence, and dedication to sustainability.\nReady to be part of our team?\nWe are looking for a Chemical Process Engineer for our Modesto, California office!\nSummary: Provides chemical process support in multiple areas in a manufacturing environment. The process areas include raw materials, production processing and finished product testing and analysis.\nResponsibilities:\n\nEssential Duties:\nProvides chemical process support in multiple areas in a manufacturing environment.\nWill function within a divisional and finished product testing and analysis.\nTo assume responsibility for all aspects of the chemical process for a manufacturing location.\nResponsible for reporting on the analysis of process parameters, process capability and tests relating to the manufacture of a quality product.\nReports key findings and issues to the supervisor immediately.\nCommunicate with other teams and departments within the business are crucial.\n\nQualifications:\n\nEducation/Experience:\nBachelor's degree or equivalent desired with an emphasis in mechanical, chemical, polymer science, engineering or related technical field.\nZero to three years’ experience with products and processes in a manufacturing environment with chemical processing an advantage.\nExperience with SPC, 6 sigma or other analysis software desirable.\nComputer Skills:\nMust be proficient in all Microsoft Office applications (Word, Excel, Power Point) and Outlook.\nOther Skills and Requirements:\nMust be self-motivated, independent, and adaptable.\nHigh level of interpersonal skills to handle sensitive and confidential situations and documentation.\nGood to excellent spelling, grammar and written communication skills.\nStrong written and oral communication skills.\nStrong organizational and problem solving skills.\nExcellent telephone and oral communication skills.\nAbility to maintain a high level of confidentiality.\nTravel is involved for training so candidate must possess a valid passport and full clean driver’s license and have the ability to relocate within North America.\nMust have the desire to strive for continuous improvement and excellence within a fast-paced growth environment.\nPhysical Demands:\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\nWhile performing the duties of this job, the employee is regularly required to talk or hear. The employee frequently is required to stand. The employee is occasionally required to walk, sit, use hands to finger, handle or feel objects, tools, or controls, reach with hands and arms, climb or balance, and stoop, kneel, crouch or crawl.\nThe employee must frequently lift and /or move up to 10 pounds and occasionally lift and/or move up to 50 pounds. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception and ability to adjust focus.\n\nEmployment Disclaimer:\n\n**Kingspan is an Equal Opportunity Employer**", "url": "https://www.indeed.com/viewjob?jk=aa964856a9512ab2&from=serp&vjs=3"},
{"job_title": "newData Entry Clerk", "summary": "Reviews NAPIS inputs for accuracy and informs Director of Information and Assistance Management of any problems regarding workflow or compliance.", "company": "EAST BATON ROUGE COUNCIL ON AGING", "location": "Baton Rouge, LA 70806 (Goodwood area)", "job_description": "Position Characteristics:\nUnder the direction of the Director of Information & Assistance Management and in accordance with GOEA regulations position provides data entry services into the NAPIS software.\n\nDuties and Responsibilities:\nReviews Care Manager in-home assessments paperwork for entry into Wellsky/SAMS.\nPrint out completed initial assessment, re-assessments and congregate assessments from Wellsky/SAMS.\nEnsure accurate data is entered into various agency systems including but not limited to Wellsky/SAMS, Senior Stat, Power to Care, etc.\nComplete data entry for senior clients in the Senior Stat system that receive congregate meals and ensures creation of a Senior Stat Card.\nReviews NAPIS inputs for accuracy and informs Director of Information and Assistance Management of any problems regarding workflow or compliance.\nDirectly manages the file maintenance program for Information and Assistance and conducts periodic audits to insure compliance.\nPrepares route sheets and reconcile meals for Meals on Wheels.\nHelps in cleaning up computer files and resolving duplicates.\nPrepares membership lists.\nPerforms data entry for assessments, utility assistance, chores, shopping, Meals on Wheels, etc.\nChecks reports, data input and records for accuracy.\nFiles and indexes programs, operating manuals, machine instructions, diagrams and flow charts, and other materials related to the computer.\nPerforms miscellaneous clerical tasks relating to system procedures such as filing and coding.\nProvides daily, weekly, monthly and quarterly reports as required to the Director of Information and Assistance Management, Director of Operations, Executive Director and required governmental officials on the status of Information and Assistance programs.\nAny other duties deemed necessary.\n\nKnowledge, Skills and Abilities:\n\nKnowledge of and orientation to the philosophy of EBRCOA as presented in Mission/Philosophy statement.\nAbility to establish and maintain a positive and professional relationship with co-workers, clients and visitors; cultural sensitivity and ability to relate well and effectively in diverse workplace and with a diverse client population. Able to comfortability and respectfully serve the special needs of an elder client population.\nAbility to communicate and interact both verbally and written.\nAbility to work in a fast-paced work environment.\nAbility to follow oral and written instructions.", "url": "https://www.indeed.com/viewjob?jk=92cce8b581f78805&from=serp&vjs=3"},
{"job_title": "newHealthcare - Experienced Healthcare Administrative Assistant...", "summary": "There will be extensive course work/training in healthcare admin assistant will be provided to the prospective employee.\nGreet and assist office visitors.", "company": "Allied Dentists LLP", "location": "New York, NY 10036 (Midtown area)+1 location", "job_description": "Please note, this is a career-track position. While there is no requirements for prior administrative assistant work experience in healthcare, a bachelor's degree (four-year college program), with GPA of B or better is required. There will be extensive course work/training in healthcare admin assistant will be provided to the prospective employee.Our offices are a cutting-edge healthcare specialty practice located in midtown Manhattan.Are you detail-oriented, organized, and like working in a structured environment? You may want to consider joining our team as an administrative assistant!A day in the life of an Administrative Assistant at our Office:· Greet and assist office visitors.· Organize and manage documents and files,· Generate daily reports, help create documents and presentations, and participate in brief daily huddles· Transcribe minutes from meetings and conduct research.· Maintain professional communication for the office: handle, draft, send and receive most of the office communications, phone calls, mail, and email· Send and receive documents for the company· Provide customer service· Provide real-time scheduling support, coordinating, and booking appointments and meetings and preventing conflicts.· Light negotiation with vendors, buy and manage supplies, sourcing for suppliers (vendors) and submitting invoices· Assist in various daily operations· Anticipate the needs of others to ensure their seamless and positive experience.Our offices are a cutting-edge healthcare specialty practice located in midtown Manhattan.This position offers immediate exposure to patients and referring doctors, giving you the opportunity to meet amazing people and build relationships. Bring your future to our practice and benefit from:· Healthcare benefits· Retirement benefits· Work-life balance and flexibility- starting employees receive two weeks of paid time off· Opportunities to be mentored, mentor others and implement change· Ability to grow as we continue to expand· Access to industry experts, cutting-edge research, and professional development courses from neighboring universities to improve your skills.· Room for significant growth for dedicated candidates who excels in his/her work and assessmentsQualifications · A bachelor's degree.· Excellent computer skills, especially typing.· Attention to detail.· Desire to be proactive and create a positive experience for others.· Please note: Prior administrative experience is required, but experience in a healthcare setting is not required because extensive training will be provided.About us EOI-NYC, a group specialty practice, is one of New York City’s most distinguished private healthcare practices and a recognized employer of choice among small businesses. Founded in 2002, EOI-NYC now treats close to a thousand new patients each year.By making our patients our first priority every day, we have become one of the most trusted group specialty practices in New York City. When we do our job right, thousands of people around New York find relief and comfort.Our long-term positive healthcare results and outstanding service set us apart from our competitors while our workplace sets us apart from other employers.EOI-NYC is a business that operates on trust- trust that we focus on our patients’ and clients’ best interests, trust that the treatments rendered are the best and most suitable for our patients, and trust that we employ intelligent, ethical, and informed doctors and staff. That’s why we hire best-in-class minds to deliver the most optimal treatment, most comprehensive consultative services to our referring doctors, and the most cutting edge continuing education courses to the dental community.Job Types: Full-time, Part-timePay: From $50,000.00 per yearBenefits:401(k) matchingHealth insurancePaid time offSchedule:Monday to FridaySupplemental Pay:Bonus payCOVID-19 considerations:CDC's Engineering, Environmental and Infection Control protocols are strictly adhered to. All employees are vaccinated.Work Location: One location", "url": "https://www.indeed.com/viewjob?cmp=Advanced-Endodontics-of-NYC&t=Healthcare&jk=fe997bb0f7685f8b&vjs=3"},
{"job_title": "newElectrical Engineer", "summary": "Your partners will be software engineers, electrical engineers, architects and program managers.\nWe’re looking for skilled design verification engineers to work…", "company": "Microsoft", "location": "Redmond, WA 98052 (Overlake area)+7 locations", "job_description": "Are you passionate about building cool devices and technologies? The Surface Team focuses on building devices that empower every person and every organization to achieve more. A fundamental part of our strategy is having desirable and powerful devices that enable the experiences people want and elicit their excitement. Creating these devices involves a close partnership between hardware and software engineers, designers, and manufacturing. We are currently building the next generation and Surface needs you!\n#DSQO\n#NextPlay\nResponsibilities\nWe’re looking for skilled design verification engineers to work in the hardware quality team to drive full featured, performant and robust hardware integration with Surface devices. Supporting the keyboard and touchpad subsystem, you’ll work across all disciplines to deliver innovative products across Surface Hardware. Your partners will be software engineers, electrical engineers, architects and program managers.\nQualifications\nRequired Qualifications:\nBS in Electrical or Computer Engineering or possess the equivalent in experience\n5+ years of experience contributing electrical design for products in the consumer PC or consumer electronics industry\nTest automation experience\nExperience using one or more hardware debugging tools including logic analyzers, oscilloscopes, JTAG, Flash emulators, or ICE\nAbility to comprehend hardware schematics\n Preferred Qualifications:\nExperience with embedded systems and low level interfaces such as I2C, SPI, USB at the electrical and firmware level\nProven experience in a quality organization with experience writing actionable bugs and driving issues to resolution\nStrong problem solving and debugging skills for modern-day multiprocessor systems (able to write/debug code, use HW level code debuggers and diagnostics tools)\nStrong communication skills required, including the ability to clearly express technical concepts in verbal and written forms. Able to scale conversations from block diagrams to schematic and / or C-level code explanations\nMust be able to plan work, and work to a plan adapting as necessary in a rapidly evolving environment\nThe ability to comprehend and assimilate technical concepts across multiple disciplines is a plus\nEnthusiastic, motivated and self-driven\nExperience with input devices such as keyboards, touchpads or pens\nExperience working with development partners in bringing high volume consumer electronics devices to the market\nExperience in system engineering, Design of Experiments and statistics\nSome travel may be necessary\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.\nBenefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.", "url": "https://www.indeed.com/viewjob?jk=21e5f43f73e04ed6&from=serp&vjs=3"},
{"job_title": "Systems Engineer- REMOTE role", "summary": "Provide technical support across systems engineering and mission assurance disciplines.\nIdentify and assess critical infrastructures to determine criticality…", "company": "ICF", "location": "Remote in Washington, DC", "job_description": "ICF is seeking Systems Engineer to provide technical services and assessment for physical and virtual infrastructure assets. You will support DoD projects, many in the National Capital Region.\nWhat you will do:\n\nProvide technical support across systems engineering and mission assurance disciplines\nIdentify and assess critical infrastructures to determine criticality and develop risk management plans\nApply software engineering, telecommunications analysis, information assurance analysis, and/or electric power engineering subject matter expertise.\nWork effectively with various parts of the DoD organization, other agencies, and ICF teammates to accomplish tasks\nProvide technical input for recommendations for mission planning\n\nWhat you will need:\n\nBachelor’s degree in systems engineering or related discipline\n4 years minimum of experience in the application of Systems Engineering methodologies and models in the federal Government, including expertise in Department of Defense Architecture Framework capabilities-based requirements processes\nExperience in supporting Mission Assurance Assessments and applying relates benchmarks, guidelines, instructions, and procedures\nExperience assessing commercial-off-the-shelf systems engineering tools\nExperience with applying model-based system engineering principles and tools and in using systems engineering tools to identify gaps and overlaps in processes\nExperience with providing results and recommendations to senior leadership and working with the Services and Combatant Commands\nU.S. Citizenship required (required by federal government for position). High level clearance required.\n#LI-CC1 #Indeed\nWorking at ICF\nWorking at ICF means applying a passion for meaningful work with intellectual rigor to help solve the leading issues of our day. Smart, compassionate, innovative, committed, ICF employees tackle unprecedented challenges to benefit people, businesses, and governments around the globe. We believe in collaboration, mutual respect, open communication, and opportunity for growth.\nWe can only solve the world's toughest challenges by building an inclusive workplace that allows everyone to thrive. We are an equal opportunity employer, committed to hiring regardless of any protected characteristic, such as race, ethnicity, national origin, color, sex, gender identity/expression, sexual orientation, religion, age, disability status, or military/veteran status. Together, our employees are empowered to share their expertise and collaborate with others to achieve personal and professional goals. For more information, please read our EEO & AA policy .\nCOVID-19 Policy : New or prospective U.S. employees must provide proof of complete vaccination on the date of their commencement of employment. If selected for employment, you will provide proof of your full vaccination status, defined as vaccinated two weeks after receiving the requisite number of doses of a COVID-19 vaccine approved or authorized for emergency use by the FDA.\nReasonable Accommodations are available, including, but not limited to, for disabled veterans, individuals with disabilities, and individuals with sincerely held religious beliefs, in all phases of the application and employment process. To request an accommodation please email icfcareercenter@icf.com and we will be happy to assist. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations. Read more about non-discrimination: EEO is the law and Pay Transparency Statement .\nDC Remote Office (DC99)", "url": "https://www.indeed.com/viewjob?jk=ec5cfb431884c11e&from=serp&vjs=3"},
{"job_title": "Production Assistant, How I Built This", "summary": "The ideal candidate is already very familiar with the program, has professional experience working in long-form audio, and a solid understanding of how to write…", "company": "NPR", "location": "Remote in Washington, DC", "job_description": "OVERVIEW\n\nA thriving, mission-driven multimedia organization, NPR produces award-winning news, information, and music programming in partnership with hundreds of independent public radio stations across the nation. The NPR audience values information, creativity, curiosity, and social responsibility – and our employees do too. We are innovators and leaders in diverse fields, from journalism and digital media to IT and development. Every day, our employees and member stations touch the lives of millions worldwide.\n\nAcross our organization, we’re building a workplace where collaboration is essential, diverse voices are heard, and inclusion is the key to our success.\n\nNPR’s How I Built This is looking for a Production Assistant to join our highly collaborative and creative team. The ideal candidate is already very familiar with the program, has professional experience working in long-form audio, and a solid understanding of how to write, frame and edit a complex narrative. An academic background in business is not required but a passion for business-and specifically, entrepreneurship-is expected. On this show, we are fascinated by what makes founders tick, about what they were like before their brands became household names, about their fears, failures, triumphs and insights. The ideal candidate will share our enthusiasm, as well as the spirit of optimism and inspiration that How I Built This listeners have come to love and look forward to.\n\nHow I Built This is a weekly, interview-based podcast about innovators, entrepreneurs and idealists, sharing the powerful stories of how they built some of the world’s best-known brands. Hosted by Guy Raz, the show is a narrative journey marked by success, failure, serendipity and grit.\n\nThe Production Assistant position can be a remote position, but candidates would ideally be located near a major U.S. airport as they will be expected to travel occasionally to Washington D.C. This role will report to the Senior Editor and Executive Producer of How I Built This.\n\nQUALIFICATIONS:\n\nEDUCATION:\n\nBachelor’s degree or the equivalent combination of education and experience\n\nYOUR RESPONSIBILITIES:\n\nGenerates, pitches and researches interview ideas for the program\nAs needed, pre-interviews guests and prepares detailed research material for the host\nEdits, writes, and mixes individual episodes of the show, from raw interview to fully- produced mix\nAssists with live event production (travel required)\nAs needed, assists with the production of digital media content\nOther duties as assigned\n\nYOUR SKILLS AND COMPETENCIES:\n\nAt least 2 years audio editing and production experience, preferably some of it in long-form narrative; ability to edit audio confidently on deadline with minimal supervision\nAt least 2 years experience in writing for audio: broadcast and/or podcast\nA passion for and deep knowledge of business and entrepreneurship\nAbility to effectively collaborate with others, demonstrating, at all times, respect for the diverse constituencies at NPR and beyond\nAbility to handle multiple projects simultaneously, under stringent timeframes and changing conditions; ability to prioritize, anticipate and communicate effectively\nSolid knowledge of research tools, including computer-access data banks\nExperience with and demonstrated commitment to fact checking\nStrong working knowledge of digital media, including proficiency in social media as a way to distribute content\nHighly supportive of cultivating and promoting diversity, equity, and inclusion in the workplace\nAbility and willingness to work varied shifts\n\nThis position is covered under the terms of a collective bargaining agreement with SAG-AFTRA. The minimum salary for this position is $60,000.00\n\nDoes this sound like you? If so, we want to hear from you. All applications must include a resume and cover letter to be considered.\n\nWant more NPR? Explore the stories behind the stories on our NPR Extra blog. Get social with NPR Extra on Facebook and following @NPRExtra and #NPRLife on Twitter and Instagram. Find more career opportunities at NPR.org/careers and on Twitter at @NPRJobs.\n\nNPR is an Equal Opportunity Employer. NPR is committed to being an inclusive workplace that welcomes diverse and unique perspectives, all working toward the same goal – to create a more informed public. Qualified applicants receive consideration for employment without regard to race, color, ethnicity, national origin, ancestry, age, religion, religious belief, sex (including pregnancy, childbirth and related medical conditions, lactation, and reproductive health decisions), sexual orientation, gender, gender identity or expression, transgender status, gender non-conforming status, intersex status, sexual stereotypes, nationality, citizenship status, personal appearance, marital status, family status, family responsibilities, military status, veteran status, mental and physical disability, medical condition, genetic information, genetic characteristics of yourself or a family member, political views and affiliation, unemployment status, protective order status, status as a victim of domestic violence, sexual assault, or stalking, or any other basis prohibited under applicable law.", "url": "https://www.indeed.com/viewjob?jk=492827a35d90f2bd&from=serp&vjs=3"},
{"job_title": "newResearch Assistant- Women's Rights National Historical Park", "summary": "They will compile research materials on each of the husbands, including their relationships to reform movements of their time.", "company": "American Conservation Experience - EPIC", "location": "Remote in Seneca Falls, NY+1 location", "job_description": "Summary: American Conservation Experience (ACE), a nonprofit Conservation Corps, in partnership with the National Park Service (NPS) is seeking a Research Assistant interested in dedicating 11 weeks to support Women's Rights National Historical Park in researching the husbands of the women who organized the 1848 Women's Rights Convention.\nFor more information about ACE, please visit: www.usaconservation.org.\nStart Date: June 6, 2022 (flexible)\nEnd Date: August 19, 2022\nThe Cultural Resources Diversity Internship Program (CRDIP) is a professional development internship that introduces students, from backgrounds historically underrepresented in the National Parks, to career opportunities within Cultural Resource Management in the NPS. CRDIP participants will have the opportunity to attend several professional development webinars as well as write blogs or create videos about their projects throughout the summer.\nLocation: Women's Rights National Historical Park tells the story of the first Women's Rights Convention held in Seneca Falls, NY on July 19-20,1848. It is a story of struggles for civil rights, human rights, and equality, global struggles that continue today. The efforts of women's rights leaders, abolitionists, and other 19th century reformers remind us that all people must be accepted as equals. A remote position will be offered to those outside of the commuting area.\nFor more information regarding Women's Rights National Historical Park, please visit their NPS website: https://www.nps.gov/wori/index.htm\nLiving Allowance: ACE Member is expected to contribute ~40 hours/week and will receive a living allowance of $480/week to offset the costs of housing, food, and incidental expenses, dispersed bi-weekly.\nHousing: Housing is the responsibility of the member and not provided by ACE or NPS. An allowance of $700/month will be provided to help offset the cost of housing.\nAmeriCorps: This position may be eligible for a 300-hour AmeriCorps Education Award ($1,342.86) upon successful completion of service hours.\nPosition Description: In 1848, five women convened the First Women's Rights Convention in Seneca Falls, NY, and launched a movement for equality that continues today. This gathering marked the first time in American history that women and men publicly demanded women's right to vote. As the National Park Service starts to prepare for the 250th anniversary of the founding of our country, our park is starting to think about ways that we can tell a broader and more inclusive story. A Research Assistant would support this commemoration work and create legacy materials by engaging with historic research into the husbands of the women who organized the 1848 Convention. They will compile research materials on each of the husbands, including their relationships to reform movements of their time.\nThe Research Assistant will present a training to park staff on the men and their role in reform, with a focus on abolition. They will compose a series of social media posts, a brief web/shared content article, as well as present the discoveries during an interpretive program to the public.\nQualifications:\nRequired\nWilling to use personal computer and access to reliable internet\nStrong research and writing skills\nAccess to a physical or digital library for research use\nComfortable with speaking to groups\nWilling and able to represent ACE and the partner organization in a professional, positive, and enthusiastic manner\nAbility to be both self-directed/work alone, and be a positive, contributing member of a group\nUS Citizen or Permanent Resident\nWilling to undergo and must pass required criminal history checks\nAbility to perform the essential duties of the position with or without reasonable accommodation\nACE Members must verify that they are fully vaccinated for Covid-19 by the time they start their term or request a medical or religious exemption\nTo Apply: Please submit your resume, a cover letter demonstrating your interest and experience, and contact information for three professional/academic references to the online application page for this position here: https://usaconservation.applicantpool.com/jobs/. Early consideration will be given as resumes are received. If you have any questions regarding this position please feel free to contact ACE EPIC Program Manager, Jen Wells at jwells@usaconservation.org.\nThis position will close on Friday March 4, 2022\nEEO: American Conservation Experience provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, American Conservation Experience complies with applicable state and local laws governing non-discrimination in employment in every location in which the company has facilities.", "url": "https://www.indeed.com/viewjob?jk=4a8cf4e17131cc87&from=serp&vjs=3"},
{"job_title": "Talent Assistant", "summary": "Greeting guests and their publicists, managers, agents, etc. for on-site interviews.\nThis entry-level role is perfect for candidates looking to start their…", "company": "Barstool Sports", "location": "New York, NY", "job_description": "Barstool Sports, the preeminent next-generation sports media brand and platform, is seeking a Talent Assistant to the Talent Relations Department. This entry-level role is perfect for candidates looking to start their career in the Entertainment/Sports industry. This will be an in-person role based in our New York City Headquarters.\nWhat You'll Do\nGeneral administrative duties: calendar management, travel booking, organization of Google Docs (Sheets, Forms, etc.), and other administrative work as needed.\nAnticipate department needs; proactively provide support and resources to ensure success\nGreeting guests and their publicists, managers, agents, etc. for on-site interviews\nResearch & maintain a catalog of upcoming celebrity projects in film, television, music, books, etc.\nPitch unique and relevant talent that will attract an audience.\nManage gifting for guests across all Barstool platforms.\nSupport Talent Department on-site for interviews (live & virtual) and live events.\nWhat You Have\nPrevious internship experience within the entertainment/sports industry.\nStrong interest & knowledge of pop culture, entertainment, sports, current events, influencers, etc.\nA self-starter with a high level of detail orientation and can work at a quick pace.\nYou’re an open and direct communicator; you’re not afraid to throw out an idea or challenge an existing one.\nAn ability to multi-task under pressure in a timely fashion.\nBarstool Sports is a company that will drive the way media is created and consumed for years to come. Working at Barstool Sports means being part of a team that is solutions-oriented, celebrates creativity, and supports one another.\nJoining means having access to competitive and valuable benefits and perks, including but not limited to:\nCompetitive medical, dental, and vision insurance; Flexible Spending Accounts and Commuter BenefitsA 4% 401(k) employer matchUnlimited vacation time, including Summer break in July and Holiday break in DecemberMonthly employer contribution towards cell phone reimbursementEmployee discount to the Barstool Sports storeFinancial wellness benefits through OriginA monthly stipend for UberEats\nWhat We Value\nRep the brand as best you canWe have lots of different brains, be open to themNever change who you are, that's who we hiredFind the solution, don't be the problemDon't be afraid to try something newCommon Sense. Use it.Be there for your audienceAlways think about how you can help\n\nBarstool Sports is for everyone. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status.\nBarstool Sports does not accept unsolicited headhunter or agency resumes. Barstool Sports will not pay any third-party agency or company that does not have a signed agreement.", "url": "https://www.indeed.com/viewjob?jk=5c141d15babe95e1&from=serp&vjs=3"},
{"job_title": "newPersonal Assistant/Household Manager", "summary": "Minimum of 5-8 years of previous experience as a personal assistant a must.\nAble to work legally in the United States, with a valid passport, driver’s license,…", "company": "Excellence Services, LLC", "location": "Atherton, CA", "job_description": "$72,800 to $120,000+ Full Benefits. DOE.Up to 20% performance-based Bonus.Atherton, California, USAABOUT US: Excellence Services LLC is a professional private-owned company that provides luxury service for an HNW family exclusively. We help our client enjoy their life and encourage employee success.ROLE AND LOCATION: Executive Personal AssistantAtherton, CAFull-time, 40 hours / week, Monday - Friday, 8:30a - 5:00pCompetitive Compensation, and Benefits after 90-day Introductory PeriodPRIMARY DUTIES: Primary responsibilities will include ensuring the smooth running of the household, performing administrative and household tasks, and working closely with existing staff.Errands: Dry cleaning, shopping, deliveries.Shipping and tracking various packages; manage returns.Personal shopping as requested.Household: Perform weekly walkthroughs using household checklists to identify action items.Schedule and work closely with other staff on various household vendors and contractors.Maintain a household vendor list. Build strong relationships with vendors.Coordinate other household staff and assist with monthly schedules.Identify and oversee various household projects as needed.Keep an inventory of all household supplies (light bulbs, batteries, cleaning supplies), and restock as needed. Be mindful of expiration dates.Keep an inventory of personal items for principals, and restock as needed. Manage PAR lists.Assist with inventory of all items in storage.Maintain and update household manuals.Maintain an approved products list for home and personal items, including sourcing information.Shop for household items as needed.Secure residence at end of the day when needed – all doors locked, security system armed.Light household chores.Prepare home for occasional events. Coordinate with vendors for holiday decor (Halloween, Christmas).Home Office: Respond to incoming calls and greet guests.Oversee onsite vendors as needed.Demonstrate excellent email etiquette, concise and accurate communications.Blind copy email messages to Principals. Maintain strictest confidences--never disclose Principals’ contact information.Maintain Principals’ personal Google calendars (separate from professional calendars).Schedule personal appointments. Calendar items forwarded by Principals.Update and maintain Google Contacts. Ensure information is synced to phones.Maintain a filing system for household needs (e.g. car registrations, maintenance contracts, warranties, contractor bids, etc.).Order home office supplies and monitor inventory.Email a daily activities report to Principals.Other: Track birthdays and other important dates.Purchase gifts, develop and maintain gift tracker, and review and audit receipts.Prepare and submit expense reports.Occasional wardrobe maintenance, i.e., schedule tailor, cobbler, etc.Work with travel concierge and accountant as needed.Plan and coordinate family activities and events.Assist with personal archival projects.QUALIFICATIONS AND CHARACTER SKETCH: Worked in hospitality industry or worked for family office.Vault-like ability to maintain confidentiality and be ultra discreet.Minimum of 5-8 years of previous experience as a personal assistant a must.Graduate of a 4-year college or university preferred.Typical 8:30 a.m. - 5:00 p.m. work schedule, with the flexibility to work weekends and evenings.This is live-out position.Strong work ethic, reliable, punctual, and honest. Practical and efficient.Technically savvy. Familiar with Gmail, Google Docs, Google Sheets and Calendar. Resourceful in terms of internet search and online shopping.Comfortable with iPhone or Android, including texting, camera phone, and smartphone apps.Highly organized, meticulous, detail-oriented and thorough. Able to multitask and prioritize well.Positive attitude, team player, capable of working well with a vast array of high-quality vendors.Gracious.Excellent command of the English language, both written and spoken.Personable and polite, with excellent people skills.Proactively identifies and resolves problems.Able to work independently, but takes direction well from Principals.Able to perform physical, hands-on tasks in order to assist the household and staff office to run well. Must be able to lift 40 pounds.Flexible and able to accommodate spontaneous changes to routines and plans.Able to travel with Principals to assist.Long-term intent.Able to work legally in the United States, with a valid passport, driver’s license, and clean driving record.Able to travel with little notice. Registration with the US Global Entry Program a real plus.Able to withstand deep background, credit, and reference checks.Willing to take a pre-employment physical, psychological exam and drug screen.OUR CORE VALUES: Principal’s FirstHighly Private Clients are the focus, and Principals are the Clients.Learn from mistakesBrave to face and admit the truth. Learns and grow from mistakes. Makes thoughtful choices and changes to avoid mistakes or at least low-cost mistakes. High-cost or repeated mistakes will lead to disciplinary action. Conscientious*Finish duties conscientiously, effectively and promptly. Dedication*Be dedicated. Keep improving. Accountable*Due diligence. Be accountable. Independent*Think and act independently. Resilience*Does not complain or shy away from assigned works. Confronts difficulties bravely. When the going gets tough, the tough get going.Job Type: Full-timePay: $72,800.00 - $120,000.00 per yearBenefits:Health insurancePaid time offSchedule:8 hour shiftMonday to FridaySupplemental Pay:Bonus payWork Location: One location", "url": "https://www.indeed.com/viewjob?cmp=Excellence-Services,-LLC&t=Personal+Assistant+Household+Manager&jk=51309254f62592e0&vjs=3"},
{"job_title": "newExecutive Assistant", "summary": "Ability to act as gatekeeper and escalate relevant information to executives as needed.\nThe primary focus of this position is to become a trusted partner to and…", "company": "Major League Baseball", "location": "New York, NY", "job_description": "MLB is looking for an Executive Assistant to support the Technology and Strategy teams in New York City. The position will be based in NYC. The primary focus of this position is to become a trusted partner to and support the Chief Product Officer/EVP, Engineering and the EVP Strategy & Development as they lead their respective organizations.\n\nLocation: NYC office\n\nPosition Description:\n\nWork in a fast-paced environment and use a wide range of skills and knowledge of organizational policies and procedures to get tasks completed\nPartner with each EVP to develop a deep understanding of their goals, priorities, and operating cadence in order to proactively provide support that enhances day to day operations of each organization\nOrganize meetings, including scheduling, sending reminders, and managing catering when necessary\nManage each executive's day-to-day calendar, including making appointments and prioritizing the most sensitive matters\nCoordinate weekly/quarterly team meeting agendas\nCoordinate domestic and international travel\nProvide administrative assistance, such as writing and editing emails, drafting memos, and preparing communications on the executive's behalf\nAssist with projects across the global organization as needed\nQualifications:\n\nSelf-driven and results-oriented with a strong will to succeed\nA naturally organized person with determination to deliver excellence\nWorld-class organizational and multi-tasking skills – strong project management capability\nProactive and flexible\nTeam oriented\nCustomer-focused\nStrong initiative and ability to work independently\n\n\nYou will thrive if you have\n\nA strong ability to communicate confidently, both written and verbally, and build strong relationships at all levels, both internally and externally\nExperience working in a fast-paced environment\nExcellent interpersonal skills, business judgment, superior work ethic, dynamic and highly team-oriented, and able to work efficiently with cross-functional teams\nSound judgment, high integrity, and ability to maintain strict confidential information\nAbility to treat confidential information with appropriate discretion\nExceptional attention to detail\nAbility to work effectively with minimal supervision; resourceful\nTime management and ability to meet deadlines\nAbility to manage multiple priorities and shifting demands with a good attitude\nExcellent verbal and written communication skills\nStrong organizational skills and ability to multitask\nProblem-solving and decision-making skills\nAbility to act as gatekeeper and escalate relevant information to executives as needed\nProficiency in Microsoft Office Suite, PowerPoint, MS Teams and Concur systems\nExperience working across global geo's\nA Bachelor's Degree or equivalent work experience\n\n\nWhy MLB?\n\nMajor League Baseball (MLB) is the most historic of the major professional sports leagues in the United States and Canada. Employees love working at MLB because of the culture of growth, teamwork, and professionalism. Employees who are most successful at MLB take initiative, know how to identify problems and provide solutions, and always put the Team first. For those ready to step up to the plate and join the Major Leagues, MLB takes the same approach as teams do with their players: empowering our \"workforce athletes\" to be at their best by engineering experiences that put employees in the best position to succeed. Major League Baseball is looking for candidates who are passionate about growing America's pastime to best serve its fans for decades to come.\n\nMLB's vision is to be the global sport of choice for youth to play, fans of all backgrounds to enjoy and a desired destination for employment. With a belief that the journey to growth and greatness is ongoing, MLB gives employees the opportunity to continue learning and honing their skills with programs such as: tuition reimbursement; mentorship programs; lunch and learns; online course subscriptions; paid industry certifications; business resource groups; and more.\n\nMLB provides its employees with exceptional medical, dental, and vision coverage. Premiums are 100% employer covered to help employees focus on being their best!\n\nMajor League Baseball is proud to be an equal opportunity workplace. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you have a disability or special need that requires accommodation, please let us know.\n\nAre you ready to Step Up to the Plate? Apply below!\nAll in-office and ballpark-based positions are subject to MLB's mandatory Covid-19 vaccine policy", "url": "https://www.indeed.com/viewjob?jk=b1a8b500e8160de5&from=serp&vjs=3"},
{"job_title": "newUnderwriting Assistant", "summary": "ARU’s area of specialization is in developing and distributing niche farm/ag insurance programs, with a particular concentration on challenging property risks.", "company": "Agribusiness Risk Underwriters", "location": "Remote", "job_description": "Despite all the benefits working from home provides to employees, many employers are starting to require a transition back to working from the company office. Join us and “just say no” to going back! Agribusiness Risk Underwriters (ARU) is a modern company with a 100% remote / work-from-home workforce.COMPANY INTROAgribusiness Risk Underwriters (ARU) is a specialty underwriting organization and an affiliate of international carrier group Accelerant Holdings. ARU’s area of specialization is in developing and distributing niche farm/ag insurance programs, with a particular concentration on challenging property risks. As a modern company, ARU is heavily invested in technology; however, our core underwriting approach relies on deep niche expertise and the nuances of human judgment.POSITION INTROARU is experiencing rapid growth, and we are seeking an individual to join our team in a support role as an Underwriting Assistant. While previous insurance experience is certainly welcome, previous insurance experience is NOT REQUIRED. If you have been seeking to get into the insurance industry but haven't had the proper experience for other positions, this could be your perfect opportunity! The right fit will be naturally curious and academic-minded, be a very fast learner, be highly collaborative, have extremely strong organizational skills, and will demonstrate an impeccable commitment to thoroughness and detail.WHAT WE’RE OFFERING TO YOU:You will be working in a 100% remote position, for an employer that pro-actively supports its employees’ comfort and safety.As an Underwriting Assistant at Agribusiness Risk Underwriters, you will be on a career “fast track” to a role as an Underwriter or Operations professional.As an Underwriting Assistant, you will have a salaried position in a fast-growing, modern, technology-based company, where your contribution will be critical to the company’s success, and where individual performers are recognized and promoted.You will have 100% employer-paid health insurance, generous PTO, and a 100% vested retirement plan with company matchYou will work in a supportive, team-driven environment.DUTIES:Help ARU be the best in the world at what we do, and do not ever settle for mediocrity. Actively participate in ARU’s culture of collaborative problem-solving.Treat every assignment as an opportunity to: 1) learn and grow as an insurance professional, and 2) prepare for increased responsibilities in the company.Perform with a high level of polish and professionalism, in all spoken and written communications. Address internal and external business challenges in a graceful and tactful manner. Complete all duties with a high degree of urgency, thoroughness, and accuracy.Support ARU’s underwriting operations with a wide variety of administrative and quality-assurance duties, such as: reviewing applications for accuracy and completeness, entering data into multiple insurance technology systems, communicating with brokers and providing excellent customer service, coordinating communications among various ARU internal departments, generating documents and spreadsheets as requested, gathering information from multiple sources to ensure file completeness, interfacing with the billing department on billing matters, and other general office and support duties.Support ARU Underwriters on day-to-day requests and also special projects.Master the use of all ARU information technology systems.Other, as assignedWHAT WE MINIMALLY REQUIRE - YOUR EDUCATION, EXPERIENCE, AND SKILLSET:Excellent customer service skills, with the strong ability to resolve challenging situations with a patient and calm demeanorExceptional personal organization,time-management, and record-keeping skillsProfessional, polished, and tactful, in the spoken word and in written formHigh intellectual curiosity, with an enjoyment of learning and self-improvementExcellent critical thinker and problem-solver under pressureProven ability to take ownership of assigned responsibilities and accompanying resultsProficient with modern business technologyREMOTE POSITION / HOME OFFICE REQUIREMENTS:This is a 100% remote position. As such, adherence to remote-work best practices is required, which includes having an appropriate professional home-office set-up, with reliable high speed internet. The space used for the office must be a separate enclosed room with a door that closes and that has professional decor appropriate for video conferencing.ABOUT ARU’S CULTURE:We demand excellence from ourselves and those around us; we work accurately and thoroughly, but also with a great sense of urgency; we are excellent critical thinkers and creative problem solvers; we contribute cheerfully to ARU’s environment of collaborative brainstorming and respectful debate; we love to explore and experiment, and we are comfortable occasionally blazing a trail that ends up actually being a “bridge to nowhere” -- just as long as we fail fast, pivot appropriately, and become tougher and smarter as a result; we love to learn, read, and grow as human beings; we believe in science-based truths, and we know there is no such thing as an alternative fact.MORE ABOUT ARU:ARU was founded on principles of creativity and innovation, with a goal to use expertise, engineering, and technology to disrupt the legacy marketplace. Our core mission is to deliver a superior experience to our policyholders, while also maintaining sustainability and consistency writing historically-challenging classes of business. To do so, we build and deploy 100% proprietary insurance products, we invest heavily in property loss prevention engineering and research, and we develop home-grown software and other technology. We also focus on collaborative broker and policyholder relationships, which allow us to deliver shared victories for all stakeholders. ARU is part of the Accelerant Insurance family: https://accelins.com/Job Type: Full-timePay: $40,000.00 - $60,000.00 per yearBenefits:Health insuranceHealth savings accountPaid time offRetirement planSchedule:Monday to FridayApplication Question(s):Please describe why you are seeking a new position.(if you attached a cover letter that already addressed this, please just enter \"see cover letter\" here)Please describe your greatest strengths as a professional.(if you attached a cover letter that already addressed this, please just enter \"see cover letter\" here)Work Location: Remote", "url": "https://www.indeed.com/viewjob?cmp=Agribusiness-Risk-Underwriters&t=Underwriting+Assistant&jk=8be6427379b177d0&vjs=3"},
{"job_title": "Virtual Assistant", "summary": "Proven experience as an assistant working remotely or relevant role.\nYou will perform various administrative tasks, including answering phone calls, emails,…", "company": "Inflatable VA", "location": "Remote", "job_description": "We are looking for a virtual assistant to provide administrative support to our team while working remotely. You will perform various administrative tasks, including answering phone calls, emails, scheduling events, and more. For this role, a strong Internet connection is required, along with experience using communication tools. Ultimately, you should be able to handle administrative projects and deliver high-quality work under minimum supervision.ResponsibilitiesRespond to emails and phone callsSchedule eventsManage a contact listOrganize staff calendarsPerform market researchMarket on social media outletsProvide customer service as first point of contactSkillsProven experience as an assistant working remotely or relevant roleFamiliarity with current technologies, like desktop sharing, cloud services and VoIPExperience with word-processing software and spreadsheets (e.g. MS Office)Knowledge of online calendars and schedulingExcellent phone, email and instant messaging communication skillsExcellent time management skillsSolid organizational skillsHigh school diploma; additional qualifications as an Administrator or Executive Assistant are a plusJob Types: Full-time, Part-time, ContractPay: $13.00 - $15.00 per hourBenefits:Flexible scheduleSchedule:8 hour shiftDay shiftMonday to FridayOn callWeekend availabilityEducation:High school or equivalent (Preferred)Experience:Customer service: 4 years (Required)Language:English (Preferred)Work Location: Remote", "url": "https://www.indeed.com/viewjob?cmp=Inflatable-VA&t=Virtual+Assistant&jk=de7eac62f8d7db27&vjs=3"},
{"job_title": "newIntermittent Main Store Customer Experience Associate-Cashie...", "summary": "To ensure compliance with an applicable nationwide preliminary injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing…", "company": "The Exchange", "location": "Ellsworth AFB, SD+4 locations", "job_description": "**YOU DO NOT NEED TO BE ASSOCIATED WITH THE MILITARY TO APPLY.**\n\nCOVID-19 Vaccination Requirement\nTo ensure compliance with an applicable nationwide preliminary injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a Federal job announcement includes the requirement that applicants must be fully vaccinated against COVID-19 pursuant to Executive Order 14043, that requirement does not currently apply. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and quarantine.\n\nAs a Customer Experience Associate at the Exchange, you will be a part of an award winning team. We are committed to hiring our military members and their families, along with anyone that wants to give back to those that serve. We offer various retail opportunities- from front-end cashiers or working in our various departments, to our Express and Class 6 stores. And by joining us, you’ll be a part of something great- we give back 2/3rd of our earnings annually to the military community.\nWe offer flexible scheduling, comprehensive medical, dental, life and disability insurance, paid time off, shift differential/holiday pay, and a traditional pension and 401K plan to qualifying associates. You’ll also have access to the base and its facilities, our Mass Transit program, and status as an employee of the DoD.\nSo what can you expect as a Customer Experience Associate at the Exchange?\nGreet every customer with eye contact and smile in your authentic way\nAcknowledge every waiting customer as soon as they arrive to your lane to let them know you’ll be right with them\nComplete transactions accurately and efficiently while engaging customers in appropriate conversation\nHelp customers by following the proper procedure for bagging merchandise and moving large or heavy items\nWe know that you can work anywhere. However, working at the Exchange is the start of something great! While you make it easy for our customers, we focus on you and your development! Our people make us who we are. We want to see you grow, so we put growing together at the forefront of everything we do. It is our duty to provide you with the tools and resources that you need to succeed. Joining the Exchange means joining a team that is devoted to you!\nFacility Name\nELLSWORTH MAIN STORE\nJob Grade\n1\nJob Tier\n0\nCareer Area\nRetail Operations\nSupervisor\nNo\nJob Qualifications\nCOMPLETION OF HIGH SCHOOL OR THE EQUIVALENT. RETAIL EXPERIENCE, DEMONSTRATED WILLINGNESS AND POTENTIAL FOR ADDITIONAL RESPONSIBILITY.\n\nIf a sufficient number of qualified candidates do not apply, the minimum qualifications may be lowered without reposting.\nAdditional Qualifications/Requirements\nINTERMITTENT POSITION- HOURS 0-34 PER WEEK.\nSalary Minimum\n$15.00\nSalary Maximum\n$15.00\nNumber of Positions Remaining\n1\nJob Expires\n12-Feb-2022", "url": "https://www.indeed.com/viewjob?jk=748c35b0a2686ce0&from=serp&vjs=3"},
