[
{"job_title": "new2022 Virtual Summer Associate - Operations, ACPNY", "summary": "In collaboration with cross functional groups, (strategy, clinical, nursing, human resources, and IT) the operations group plans, implements and evaluates…", "company": "EmblemHealth", "location": "New York, NY", "job_description": "2022 Virtual Summer Associate Program – Operations, ACPNY\nEmblemHealth is a family of health and wellness companies that believes in our mission to create healthier futures for our customers, patients, and communities. Everything we do is guided by our core values:\n\nEmpower\nWe believe in acting as proactive self-starters and enabling our colleagues to succeed.\nDeliver\nWe believe in achieving our goals and taking accountability for our actions.\nDo It Together\nWe believe in caring for our customers, patients, and one another, while valuing diversity, equity, and inclusion.\nAs one of the nation’s largest not-for-profit health insurers, EmblemHealth serves more than three million people in the New York tristate area. We are anchored by our 80-year-old not-for-profit roots while remaining change agents fueled by innovation and excellence to create better health outcomes.\n\nOur family of companies also includes ConnectiCare, one of Connecticut’s leading health plans; AdvantageCare Physicians, a primary and specialty medical group; and WellSpark, a digital wellness company.\n\nWe are proud that our workforce is as diverse as the communities we serve, and we are intentional about our inclusive practices for our organization.\nIf you want to be a part of a bigger story, if you want to make a difference in people lives and the communities around you, if you think healthcare matters to every one of us – Join us!\nOperations\nThe Operations team is responsible for managing and leading the health care delivery processes in the medical offices across five regions including Manhattan, Staten Island, Brooklyn, Queens, and Long Island. Operations leaders drive change, solve complex problems, and create dynamic new approaches that will improve the value, quality, and cost of patient care. In collaboration with cross functional groups, (strategy, clinical, nursing, human resources, and IT) the operations group plans, implements and evaluates processes and workflows designed to optimize care delivery and create patient service excellence.\n\nSummer Associate Program\nThe Summer Associate Program provides opportunity for students to work alongside of senior leaders who are committed to growing, developing, and empowering the next generation of healthcare leaders. The Operations Summer Associate will work on special projects designed by the business and participate in the following career development activities:\nIntroduction to the Health Care IndustrySenior Leadership Networking LunchLearning & Development SeriesFinal Project Presentations\nProgram Details\n9-week paid program; Monday, June 6, 2022 to Friday, August 5, 2022Full-time; 40-hours per weekHourly rate of $30 per hourProject-driven\nWe are looking for candidates who are -\nPursing an undergraduate or graduate degree in the healthcare Industry; rising undergraduate juniors/seniors, and first-year graduate students strongly preferredStrong academic performance, minimum GPA of 3.0 or above preferredAnalytical, collaborative, and strong communication skillsProject management", "url": "https://www.indeed.com/viewjob?jk=d1d971809132aa8c&from=serp&vjs=3"},
{"job_title": "newExecutive Assistant, CEO", "summary": "Oversee daily operations through collaboration with CEO and senior management, performing an array of administrative tasks from handling schedules, attending…", "company": "Tinder", "location": "Hybrid remote in New York, NY", "job_description": "Tinder started on a college campus in 2012 and broke down the barriers - geographic, historic, cultural - that limit who we meet. We went from 1 swipe to 1 billion swipes a day, in 2 years! No technology grows that fast unless it fills a powerful, unmet human need. Today, Tinder is the world’s most popular app for meeting new people. The app is available in 190 countries, and 40+ languages, it’s been downloaded more than 450 million times and led to 60 billion matches, and is the highest-grossing non-gaming app globally. There’s never been a more exciting time to be at Tinder. We are on a course to redefine the way young people meet and connect today, if you would like to be a part of that, keep reading.\nThe Role:\nWe’re looking for an Executive Assistant to join our team! Reporting to our CEO, you will provide outstanding daily administrative support and get energized by working in a fast-paced environment. This is a perfect role for someone who takes initiative, is intuitive, and thinks strategically. Although this position may offer some remote work flexibility, this role will be based in our New York office and will require travel to our San Francisco and Los Angeles offices as needed.\nIn addition to managing the CEO’s complex calendar and schedule, you will work with cross-functional global leaders and provide high caliber administrative support that will help us execute company projects and goals. Your creativity, passion, and organizational skills will be critical in supporting the CEO team meetings and special events. We are looking for someone to help build and lead organizational culture in hybrid and remote working environments across the US and globally.\nAdministrative Support\nOversee daily operations through collaboration with CEO and senior management, performing an array of administrative tasks from handling schedules, attending meetings and calls, maintaining team communications, and ensure execution of action items and follow-ups\nBuild presentations, create meeting agendas, maintain meeting notes, and optimize meetings for different time zones to support our distributed international team\nServe as liaison between staff, executives, and senior leaders, regarding company climate, employee well-being, project updates, proposals, and planning\nArrange domestic and international travel and provide ongoing support as needed\nAssist the HR department with new hires, collect documentation, help facilitate onboarding, and collaborate to address and resolve all employee concerns\nPrioritize, multi-task, and operate in a continuously evolving environment\nHandle projects and communication by providing status updates and ensuring that cross-functional partners are included in meetings and communications\nBuild and run an organized department library of resources and documentation and identify any gaps with team members\nCollaborate with workplace experience for team space planning & strategy\nTeam Morale, Events and Celebrations\nPartner with cross functional teams to plan and execute meetings and offsites\nIdentify the team’s learning and training opportunities, and partner with our Talent Development team to work on resources or communicate training needs\nWork closely with the workplace experience and HR teams to coordinate birthdays and landmark celebrations\nManage team swag\nComplete other duties as assigned\nWhat we’re looking for:\n3+ years of work experience supporting at the senior executive level\nExperience supporting hybrid and global teams\nFlexibility beyond standard office hours\nExperience with Google-Suite (Gmail, Calendar, Docs, Slides, etc.)\nAbility to adapt to changing priorities with excellent time management skills\nPositive relationship management skills and the ability to effectively collaborate with a diverse set of partners\nDemonstrate discretion and integrity when working on confidential business and organizational issues\nStrong verbal and written communication skills\nDemonstrated presentation skills, with an ability to express high-level concepts efficiently and effectively to a wide range of audiences\nStrong project management skills\nBased on Tinder’s vaccination policy and considering this position is a crucial in-office support function, the successful candidate is required to be fully-vaccinated against Covid-19 with one of the United States FDA-approved vaccine options. If an exemption and/or accommodation to our vaccination policy is requested, a member of the human resources department will be available to begin the interactive accommodation process.\n\nAt Tinder, we don’t just accept difference — we celebrate it, we support it, and we thrive on it for the benefit of our employees, our product, and our community. We strive to make our workplace an inclusive and diverse environment, giving people from all walks of life the opportunity to have a voice. We champion and encourage those who bring different perspectives, ideas, and creativity to join our team dedicated to bringing people together across the globe. Tinder is proud to be an equal opportunity workplace where we welcome all people regardless of sex, gender identity, race, ethnicity, disability, or other lived experience.", "url": "https://www.indeed.com/viewjob?jk=fd56deba91342b10&from=serp&vjs=3"},
{"job_title": "Web Order Processor", "summary": "Under immediate guidance, an *Web Order Processor* will help to process and finalize orders that were placed independently by customers online.", "company": "Discount Tire", "location": "Remote in Phoenix, AZ", "job_description": "Here at Discount Tire, we celebrate the spirit of our people with extraordinary pride and enthusiasm. Our business has been growing for more than 60 years and now is the best time in our history to join us. We are opening more locations every year and we are always looking for qualified individuals to join us in our growth. We are a company that promotes from within, both in our retail and corporate operations.Under immediate guidance, an Web Order Processor will help to process and finalize orders that were placed independently by customers online. Our contact center, located in North Phoenix, facilitates interactions with customers through both inbound calls, e-mails, and web orders. If you are a hardworking and self-motivated individual that values relationships, this is the career for you! Discount Tire Direct combines outstanding earning potential and great benefits with a fun and exciting workplace.NO AUTOMOTIVE EXPERIENCE REQUIRED! WE PAY YOU WHILE WE TRAIN YOU!Essential Duties and Responsibilities: Reviews orders for product requirements such as sizing, fitment, and safety standards. Also, ensures product orders align with industry and company safety standards.Identifies and marks orders that cannot be filled due to fitment, fraud, inventory, and any other issue preventing the order from being completed. Informs customer electronically and escalates order exceptions to eBusiness Team for follow up and resolution.Verifies product inventory status such as product availability, stock level, location, and stock replenishment schedule.Support the Discount Tire Direct Sales team by assisting with drop ship orders, special orders, and processing orders.Finalizes orders with proper distribution center and determines best method of product delivery for the customer, including, but not limited to, special orders, split shipments, and drop shipments.Processes credit card, PayPal, and Synchrony Bank Discount Tire Credit Card payments for online orders. Notifies customers electronically if payment is declined and/or escalates to eBusiness Apprentice for resolution.Qualifications: Customer service skills, including the ability to manage and respond to different customer situations while maintaining a positive and friendly attitude are essential.Basic level computer experience, including skills in Microsoft Word and Excel, are necessary.The ability to work successfully both independently and within a team is necessary.The ability to work efficiently under pressure, accurately, meet deadlines, present a professional demeanor and work well independently is essential.In addition, organizational and problem-solving skills, a can-do attitude, and the ability to adjust to changing requirements are essential.Maintaining confidentiality, treating others with respect, and upholding company values are key attributes.Educational Requirements: This position requires a high school diploma or GED equivalent.Work RemotelyYesJob Type: Part-timePay: From $14.70 per hourSchedule:Day shiftMonday to FridayWork Location: One location", "url": "https://www.indeed.com/viewjob?cmp=Discount-Tire&t=Web+Order+Processor&jk=942862067683aa41&vjs=3"},
{"job_title": "Packaging Technician (1st shift) - $20-$25.50/hour – $1,500...", "summary": "Working knowledge of mechanical packaging equipment, a plus.\nOur packaging technicians apply a disciplined packaging and barcoding service to specific…", "company": "Safecor Health, LLC", "location": "Woburn, MA 01801+3 locations", "job_description": "$1,500 SIGN-ON BONUSES OFFERED!\nPAY RATE: $20-$25.50/hour based on experience with the opportunity to be promoted from within\nSHIFT: Full-time first shift (8am-4:30pm) Monday through Friday\nAbout Safecor Health\nSafecor Health is an industry leader and essential employer committed to helping hospitals ensure quality and patient safety. We do this by providing unit-dose medication packaging services for hospital and health system pharmacies, pharmaceutical manufacturers, and digital pharmacy companies. By taking away the challenging and time-consuming tasks of repackaging, Safecor Health allows hospital pharmacy staff to refocus their attention back to what really matters: our loved ones.\nThe role of the Packaging Technician\nOur packaging technicians apply a disciplined packaging and barcoding service to specific medications in our production facilities. This important work we do helps our hospital customers deliver safe, high-quality medication and care to their patients.\nYou will be responsible for repackaging all unit-dose medications as required. This includes operating our packaging equipment to repackage oral solids into unit-dose, and filling cups, vials, and syringes as specified. The packaging technician position is also responsible for maintaining the packaging equipment for daily use, including cleaning and general equipment troubleshooting.\nWhat you bring to the table:\nIf you're looking for stability and longevity with the opportunity to grow your career, you could be a great fit for our diverse team of packaging technicians.\nStrong attention to detail with a focus on quality\nWorking knowledge of computer hardware (PC Windows)\nWorking knowledge of mechanical packaging equipment, a plus\nGood organizational skills - accurate, reliable, and efficient\nHigh school diploma or equivalent required\nPrevious experience in hospital pharmacy or health care industry preferred\nPharmacy Technician Certification a plus\nWhat your day-to-day will look like:\nSafecor Health is a fast-paced, high-energy workplace with ample opportunities to learn new skills each day.\nPerform all unit-dose medication packaging and complete daily orders as needed.\nMaintain supplies needed in the workstation to fulfill services.\nPerform daily preventative maintenance and necessary routine adjustments on the packaging equipment.\nGenerate accurate packaging labels according to requirements regarding verification procedures as specified in our standard operating procedures.\nFollow standard operating procedures in accordance with current Good Manufacturing Practices (cGMP) and other regulatory standards.\nHow we take care of you and your family:\nThe meaningful work you do helps our customers support their patients, so we'll work hard to support you.\n$1,500 sign-on bonus!\nClean and safe work environment\nMedical, dental, and vision insurance\nCompany-paid life insurance\nPaid time off (PTO)\nEarned sick time (EST)\nHoliday pay\nWeekly pay\n401k\nOpportunities for internal promotion\nMonthly employee appreciation meals", "url": "https://www.indeed.com/viewjob?jk=0d4f611ef94ccf54&q=Technician&l=USA&from=web&advn=6359985025828115&adid=311338277&ad=-6NYlbfkN0CSc9FKj-X37TyRYNM2ms2h__eQS6H9NU5BV_0Fq7BFfqOqw_M_yy-MLPCViFhwCVw6aOSoYw2wDZydkX4iO7jXA4pzj-7FZXtH40RGwxxdh9Pt0KaJScDyhVDdFwbXebZ_YeQ-OxDQZxj_vzF16rLBdvvrlSNfPhsKBBLdMIpNO7YPb9GUlhQL4pfVg0QZ2wKVMTQSlJw8ESmPNqVat5-gLg1IofR_jd83a-Zx1gfgAJMXxCmC1JeYLraZgNJ7Dmn19CcZnHTQ1-SO1FZsVhCg0KCPx3_blSckyP5Krg4_toYCLCnYPWVIZFlbE_F0UcLoExljSMJQ5uGA9qAoFTEkotJRMBL_aMokeaXbLDTUXVmjc-DdoQ5lMO9t32R338I%3D&sjdu=3j2yV1Cyo1TUbNt3be92UkyflQrHHfeJU98511-PjyrhSc9brRpZZGHzwmbsaQRwmt1diJerBLFrqRTD6u1XJoc4PFSiHNwX9R9B_QlLbPo&acatk=1frep1ltat4ap800&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "Strategy and Operations Lead", "summary": "2 years of experience in business administration, quantitative analysis, and operations.\nExperience in management consulting, corporate development, finance…", "company": "Google", "location": "Hybrid remote in New York, NY+27 locations", "job_description": "Note: Google’s hybrid workplace includes remote and in-office roles. By applying to this position you will have an opportunity to share your preferred working location from the following:\n\nIn-office locations: Sunnyvale, CA, USA; New York, NY, USA.\nRemote location(s): United States.\nMinimum qualifications:\n\n2 years of experience in business administration, quantitative analysis, and operations\nExperience in SQL and other reporting tools and techniques\nExperience in statistics and executive-level dashboarding of data, and in process improvement\nExperience with building solutions for enterprise-level processes (e.g., finance, planning and budgeting, business intelligence, operations, etc.)\nPreferred qualifications:\n\nExperience in management consulting, corporate development, finance/investment banking, or operations\nExperience leading complex operational and strategic initiatives across various organizations\nExperience with executive-level communication and influencing successfully across levels and organizational boundaries\nDistinctive problem solving and analysis skills, combined with impeccable business judgment\nExceptional at converting unshaped issues into crisp, concrete challenges to be solved\nAbout the job\nGoogle Cloud enables digital transformations for organizations of all sizes, operating in all industries and geographies. The Chief of Staff organization within Business Platform and Cloud Operations (BP&CO) supports Google Cloud growth, working with Google Cloud business leaders to identify strategic priorities and design and implement business processes to support them.\nIn this role, you will lead the strategy and execution of operational projects such as designing and implementing a headcount management process, executing the organization’s talent strategy, executive and project reporting, and strategic planning. You'll focus on data collection, draw insights from analysis, and then develop compelling, synthesized recommendations. You will be comfortable with structuring complicated issues and finding creative solutions to business challenges. You'll work in a rapidly changing environment and demonstrate problem-solving leadership with limited oversight.\nYou will be highly strategic, comfortable with ambiguity, and an exceptional communicator with a bias for action and results. You'll be an agile and creative problem solver, and an outstanding cross-functional and executive-level relationship builder.\nGoogle Cloud provides organizations with leading infrastructure, platform capabilities and industry solutions. We deliver enterprise-grade cloud solutions that leverage Google’s cutting-edge technology to help companies operate more efficiently and adapt to changing needs, giving customers a foundation for the future. Customers in more than 150 countries turn to Google Cloud as their trusted partner to solve their most critical business problems.\nAdditional Information\n\n(Colorado only*) Minimum salary of $124,000 + bonus + equity + benefits.\n\nNote: Disclosure as required by sb19-085 (8-5-20) of the minimum salary compensation for this role when being hired into our offices in Colorado.\nResponsibilities\nCreate and execute on operational processes and practices that drive efficiencies for the organization.\nGather and analyze large amounts of information and turn it into compelling, insightful recommendations.\nBuild consensus among cross-functional teams and influence decision making with executive-level audiences. Lead execution against recommendations quickly and accurately.\nIdentify opportunities to develop strategic recommendations, execution plans, and key performance indicators to improve the operations of the BP&CO organization.\nFoster a culture of high organizational performance through internal and cross-group initiatives.\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form.", "url": "https://www.indeed.com/viewjob?jk=38df1958116944e1&from=serp&vjs=3"},
{"job_title": "newPeople Operations Coordinator", "summary": "As the operations coordinator you will be our day to day superhero for all things ops.\nWe encourage our people to travel and connect in person either through…", "company": "PeopleOps Jobs", "location": "+2 locationsRemote", "job_description": "At ConsenSys we have a vision of a world where data sovereignty and financial well-being is accessible to every person and organization. We believe Ethereum and decentralized protocol technology is a more trustworthy and equitable foundation for how we create and share value across the web. On this trusted, open source foundation, we can accelerate the world’s transition to a universally accessible network of distributed participants where transparency, security and freedom are fundamental.Our product suite, composed of Truffle, Infura, Quorum, Codefi, MetaMask, and Diligence, serves millions of users, supports billions of blockchain-based queries for our clients, and has handled billions of dollars in digital assets. As the leading Ethereum software company, ConsenSys enables developers, enterprises, and people worldwide to build next-generation applications, launch modern financial infrastructure, and access the decentralized web. To learn more about ConsenSys, and explore our products and solutions, visit http://consensys.net/.Why join ConsenSys?Remote first. You’ll be joining a team based all over the world. Providing the unique opportunity to work with people from across 6 continents. We encourage our people to travel and connect in person either through retreats, conferences, or just for fun!Flexible working arrangements. You can create the work week that works for you with flexible hours and locations. We believe everyone has the right to individual sovereignty. We empower and support you to make your own schedule and own your own time.Continuous learning and opportunities. As a destination employer, ConsenSys is committed to your growth and development. We provide continuous on the job learning and opportunities, as well as offering the comprehensive ConsenSys Advance Program which includes full access to Coursera training courses, bespoke training programmes, technical learning sessions and our world class blockchain and Ethereum Academy.Unlimited vacation/holidays. We value downtime to recharge and reset, ensuring everyone at ConsenSys has work/life balance. Company-wide we participate in “zero productivity” days to take a break from work, shut down, and sit back and relax.One of the most recognized tech companies in the blockchain ecosystem globally. Work experience at ConsenSys is a tremendous reference for your future career. You’ll join a network of entrepreneurs and technologists that reaches the edge of our ecosystem.About People & TalentPeople and Talent support the entire ConsenSys community. We strive to be the destination employer of choice for our ecosystem. That goal is embedded in all the work we do to attract, retain and support our amazing talent. By joining our team you’ll be working with a diverse group of incredible individuals who put ‘people first’ and are designing and building the workplace of the future.What you’ll doAs the operations coordinator you will be our day to day superhero for all things ops. You will be managing many of our internal systems to ensure our business runs smoothly and all deadlines are met. You’ll be working closely with the entire People & Talent function feeding key information to the Ops team.Your role will be split over multiple different projects ensuring consistency across all systems and data integrity while also being our 3rd party voice for day-to-day tasks, systems and additional projects. One of the projects you’ll be working on will be onboarding new hires through assisting with data implementation, supporting any needs of new hires, liaising with People Partners & Leads, organizing any onboarding orientations, learning sessions, and new hire check-ins across the organization, and co-managing equipment procurement.You will also be responsible for the day to day maintenance of our HR software tool Namely reviewing data, flagging any updates, building out current systems, running reports, managing training and sending weekly reports. For our additional HR platforms, TriNet and Velocity PEO, you will be serving as the admin for these tools ensuring all new hires are added to relevant platforms, verifying documentation, submitting payroll, connecting with platform reps, managing the operational piece of terminations, and communicating to the wider team on any compliance issues globally.As well as your operational skills we’re looking for an individual who has a passion for helping others and building out systems that do that. You’ll be the doer for any operational requests that come through ZenDesk and ensure we have an active voice in our ecosystem. There will also be many opportunities to bring your unique skill set to a project you are passionate about in supporting our key goals as an operational team for the larger ConsenSys community.Would be great if you brought this to the roleThe ability to work across multiple different systems and platforms with easeA clear understanding and comfortability with tools and technology systems for HRConfident in managing the full lifecycle of new hires onboarding experienceA data expert who can manage insights from numerous tools while ensuring data integrity across all systemsExcellent verbal and written communication skillsStrong organizational, time management skills and the ability to self-organizeGeneral knowledge of customer service tools and workflowsCan-do attitude and a willingness to step into new processes, or areas of work, outside your field of expertiseDon't meet all the requirements? Don't sweat it. We’re passionate about building a diverse team of humans and as such, if you think you've got what it takes for our chaotic-but-fun, remote-friendly, start-up environment—apply anyway. While we have a pretty good idea of what we need, we're ready for you to challenge our thinking on who needs to be in this role.ConsenSys is an equal opportunity employer. We encourage people from all backgrounds to apply. We are committed to ensuring that our technology is made available and accessible to everyone. All employment decisions are made without regard to race, color, national origin, ancestry, sex, gender, gender identity or expression, sexual orientation, age, genetic information, religion, disability, medical condition, pregnancy, marital status, family status, veteran status, or any other characteristic protected by law.Job Type: Full-timePay: $30,206.00 - $73,056.00 per yearBenefits:Flexible schedulePaid time offProfessional development assistanceSchedule:8 hour shiftWork Location: Remote", "url": "https://www.indeed.com/viewjob?cmp=SelectSoftware-Reviews&t=People+Operation+Coordinator&jk=a0d9b8a24a4897e4&vjs=3"},
{"job_title": "Truck and Bus Technician", "summary": "All Aspects of Repair and preventative maintenance on Late model truck and bus fleet.\nDiesel engine repair: 1 year (Preferred).", "company": "VOIGT'S BUS", "location": "Minneapolis, MN 55432", "job_description": "All Aspects of Repair and preventative maintenance on Late model truck and bus fleet. Opportunities for advancement in near future if desired and qualified. Be part of a team that solves problems and improves our organization to serve our customers and employees.Job Type: Full-timePay: $26.00 - $35.00 per hourBenefits:Dental insuranceFlexible scheduleHealth insurancePaid time offReferral programVision insuranceSchedule:8 hour shiftSupplemental Pay:Bonus payExperience:Diesel engine repair: 1 year (Preferred)Mechanical knowledge: 1 year (Preferred)Work Location: One location", "url": "https://www.indeed.com/viewjob?jk=17f9cebea75922ff&q=Technician&l=USA&from=web&advn=5078298083181233&adid=382287292&ad=-6NYlbfkN0BiFWglDtXxlI5uFN60L5bLZVRBpqnCE7N29TWbqNv_95AakcvZya4lnpRgA8GeOduVsavyaIdms5bSAu5lCdjyf4eAlkZyS-btMaz24XF0caJzoLJLYYjacMgNc3o9BZGj-CXKQ5Sw1TuG8UvnSjoCGrUyDbpip98hbStzGjwQP6MgZnjvCFoY3fCuxuT5BN7sjOLnR1tyc1a64zWsXnHZtGmKkgrqY3Dfx0u7q5Eg--bm44fa7A7tCCWEw41gkv84vQoNpsV_bcCVxGpggNJ3b-Qe1aDo063uc040KpVdblXPk8HIedMYb6Bh4HaWokQaojZKinqyx8SdMa1SVw85kxCtRZ0rEBsqvYDOxBHdWZfTob6YzI1az8ZFQhnJtaY%3D&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "newSrAssc, Operation Svcs", "summary": "Performs duties such as maintaining all level of files, searching and investigating information contained in files, processing departmental documents requiring…", "company": "CoreLogic", "location": "Irving, TX 75063 (Freeport/Hackberry area)", "job_description": "Job Summary:\nJoin our team of over 5,000 employees globally, who provide the insights through data and next generation technology that help millions of people find, buy and protect the homes they love. From the beginning, CoreLogic has been driven by a single purpose – to innovate and create solutions that solve our clients’ toughest challenges in the housing market. CoreLogic is the trusted source for property intelligence, with deep knowledge of powerful economic, social, and environmental forces that promote healthy housing markets and thriving communities.\nWe apply that same dedication to creating a diverse and inclusive work culture that inspires innovation and bold thinking. A place where individuals can work on small teams, feel valued, and directly impact the real estate industry. We believe our team members are the best in the business, and we will continue to recruit, retain, develop and reward our most important asset – our people!\nJob Description:\nJob Duties\nConducts research of data. Leverages all available resources such as existing databases, third party sources and/or public information on the internet.\nContacts clients/outside customers to clarify information. Utilizes tools to analyze, query and manipulate data according to defined business procedures. Extracts and enters appropriate data onto application, other form, or database.\nProcess payments which may require preparing, balancing, and submitting complex wire disbursements for mass manual payments.\nMay proofread documents for grammatical, mathematical, typographical and composition errors adhering to standards and guidelines. Offers suggestions to improve readability.\nAdhere to all required company and client driven Service Level Agreements\nPerforms duties such as maintaining all level of files, searching and investigating information contained in files, processing departmental documents requiring more specific knowledge of functional operations and entering report results into tracking system.\nMay track progress and provide status report to management on achievement of daily and weekly team goals.\nMay act as Subject Matter Expert on internal and client projects making recommendations to these processes.\nAble to develop and maintain business relationships with individuals representing other departments, and/or representing outside organizations.\nJob Qualifications:\nEducation, Experience, Knowledge and Skills\nCollege degree preferred, High School Diploma or equivalent required\n2+ years related experience in lieu of college degree\nExcellent verbal and written communication skills required for reporting, presentations, information sharing\nExcellent customer and listening skills - builds customer confidence through commitment and delivery of customer satisfaction\nIntermediate to advanced computer skills to retrieve, query, create, update and manipulate documents and spreadsheets containing formulas and formatting\nStrong attention to detail and organizational skills\nAbility to manage multiple tasks/projects simultaneously while meeting deadlines\nTenacity for solving detailed / complex issues\nStrong analytical skills\nAbility to train and provide feedback to others\nAbility to collaborate with peers, other departments and clients to improve processes and share best practices\nCoreLogic's Diversity Commitment:\nCoreLogic is fully committed to employing a diverse workforce and creating an inclusive work environment that embraces everyone’s unique contributions, experiences and values. We offer an empowered work environment that encourages creativity, initiative and professional growth and provides a competitive salary and benefits package. We are better together when we support and recognize our differences.\nEOE AA M/F/Veteran/Disability:\nCoreLogic is an Equal Opportunity/Affirmative Action employer committed to attracting and retaining the best-qualified people available, without regard to race, color, religion, national origin, gender, sexual orientation, gender identity, age, disability or status as a veteran of the Armed Forces, or any other basis protected by federal, state or local law. CoreLogic maintains a Drug-Free Workplace.\nPlease apply on our website for consideration.\nPrivacy Policy - http://www.corelogic.com/privacy.aspx\nBy providing your telephone number, you agree to receive automated (SMS) text messages at that number from CoreLogic regarding all matters related to your application and, if you are hired, your employment and company business. Message & data rates may apply. You can opt out at any time by responding STOP or UNSUBSCRIBING and will automatically be opted out company-wide.\nConnect with us on social media! Click on the quicklinks below to find out more about our company and associates.", "url": "https://www.indeed.com/viewjob?jk=291f498251e5f2dc&from=serp&vjs=3"},
{"job_title": "Operations Coordinator (Remote or Los Angeles)", "summary": "2-3+ years of work experience.\nStart-up, agency, hospitality or retail experience is a plus.\nSolutions-focused; Excited to work internally and externally to…", "company": "Spiegel Design Group, Inc.", "location": "Remote in Los Angeles, CA", "job_description": "Build Anything.We're the engineering team trusted by the world's largest eCommerce and DTC brands. Our mission is to transform our clients’ businesses, drive growth, and build the highest-scaling and most complex experiences online today.Our team is composed of vibrant, resourceful, and entrepreneurial people in front-end, full-stack and technical operations roles. At SDG we focus on building a culture that allows everyone to create meaningful and impactful work for our team and our clients’ businesses. Our people are the most valuable assets to this culture. As such, we offer a flexible time off schedule, excellent benefits, a collaborative work environment (as well as permanent remote options), and plenty of opportunity for career growth.We believe in hiring people, not outsourcing and are committed to growing the best team in this space. We're a close knit crew that highly values strong teamwork, initiative, and quality.Background.We are looking for smart, organized, and motivated professionals to help manage our growing project and client portfolio. If you are an excellent communicator and organizer with a client services background and are confident handling multiple work streams in the digital production space, then we want to hear from you.Requirements.2-3+ years of work experience. Start-up, agency, hospitality or retail experience is a plus.Ability to multi-task and prioritize against the greatest and most urgent needs.Solutions-focused; Excited to work internally and externally to identify problems and solve.Must have excellent organizational and problem-solving skills, be solution-focused, be professional, collaborative, reliable, and provide excellent customer service.Experience maintaining strict confidentiality of data and information.Comfort in speaking to and managing expectations.Exceptional written and verbal communication skills.Technical and/or engineering experience is a plus.DetailsFully Paid Medical, Dental & Vision.401k Retirement Plan.Work From Home/Anywhere.Salary is competitive and commensurate with experience.This is a full-time position.We are a fully remote team and deeply respect and value work-life balance.This position is open to candidates in the United States and Canada only.Job Type: Full-time", "url": "https://www.indeed.com/viewjob?cmp=SDG&t=Operation+Coordinator&jk=eb2cf51e466e551a&vjs=3"},
{"job_title": "newData and Operations Assistant", "summary": "Must have prior operations or advanced administrative experience.\nOrganizational Tutors (OT) is one of the premier Executive Function Tutoring organizations in…", "company": "Organizational Tutors", "location": "Remote in Brooklyn, NY", "job_description": "Organizational Tutors (OT) is one of the premier Executive Function Tutoring organizations in the United States. Based in NYC, OT provides specialized and individualized tutoring and coaching to strengthen students’ executive functioning capacities, effectively manage complex neuropsychological profiles, and overcome social/emotional obstacles to learning. OT has grown exponentially over the past decade due to the dedication and efforts of its tight-knit team.OT is looking for a highly-organized, extremely fastidious, and efficient Data and Operations Assistant to work closely with our Administrative Team. As a small team, working remotely, we are looking for someone who communicates clearly, is self-directed, independent, and is comfortable asking questions. Though the majority of work can be done remotely, preference is given for candidates who are available for occasional in-person meetings and training sessions in the NYC area. Interest and/or experience in psychology and education is a plus.ResponsibilitiesWe expect the Data and Operations Assistant to be a core member and idea contributor to the Administrative Team. The responsibilities of this role involve not only supporting the organization’s overall operations, but also leading the next step in the future of our data systems and conversations surrounding analysis of company metrics. Specifically, this role will directly support the Operations Director in tasks related to client billing and customer service and will provide team-wide support with data entry and data analysis related to our matchmaking process, client services, and marketing efforts.Tasks include but are not limited to:Entering tutor and client data into proprietary matching and billing systemsTracking and reporting data related to client conversion and retention on a monthly, quarterly, and annual basisCompiling and analyzing data related to tutor caseloads and referral sourcesQuality checking current data for errors and performing routine quarterly maintenance of client and tutor data for accuracyProviding recommendations for improving the efficiency and accuracy of data systemsAnalyzing company metrics, trends, and providing recommendationsAssisting with monthly client billing, supporting tutors and clients, and providing troubleshooting and customer supportUpdating and maintaining audience lists and tags in Mailchimp and tracking Mailchimp metricsPerforming research relating to new partnerships, expansion opportunities, services, etc., and preparing summariesKeeping apprised and the team informed of relevant professional development opportunitiesPreparing Excel files, Powerpoint slides, and other presentation materialsCoordinating and attending company meetings, preparing agendas, taking notes, assigning, and following up on action itemsCommunicating with vendors and service providersManaging calendarsConducting research and summarizing findingsProviding other types of general professional administrative support to the CEO, Program Director, and Operations DirectorDirecting questions and inquiries to appropriate parties and handling sensitive information with professionalism and discretionQualificationsBachelor's degree is required; graduate degree completed or in progress is preferred. Coursework involving statistical/data analysis or comparable certification required.Must have prior operations or advanced administrative experienceMust have advanced level comfort with Excel: charts, pivot tables, graphs, etc. Experience with Google Workspace/Microsoft Office Suite, databases, Mailchimp, and Zoom also required.Dependable self-starter who can take direction but work independentlyDemonstrated professionalism, sound judgment, trustworthiness, and follow throughExcellent written and verbal communication skillsExceptional attention to detail and organizational skillsAbility to stay on task and keep up with weekly goals in a virtual work environment (the OT team works remotely.)Availability for occasional in-person meetings in NYCSound judgment regarding privacy, confidentiality, and acceptable contentDemonstrated understanding of responsible internet safety best practicesCommitment to an environment of respect, inclusion, diversity, and fairnessCompensationThis is a full-time W-2 employee position. Compensation is competitive and commensurate with experience.ApplicationPlease submit your résumé and a cover letter outlining your interest, any relevant experience, and qualifications. In your letter, please address when you are available to begin this position and over what period you will be available. Please also have prepared the names and contact information for two or three references.Organizational Tutors is a woman-owned and family-friendly company.To learn more, please visit Organizationaltutors.com.Job Type: Full-timePay: From $30.00 per hourBenefits:Flexible schedulePaid time offSchedule:Monday to FridayEducation:Bachelor's (Required)Experience:Microsoft Excel: 1 year (Required)Administrative: 1 year (Required)Work Location: One location", "url": "https://www.indeed.com/viewjob?cmp=Organizational-Tutors&t=Data+Operation+Assistant&jk=d803c96931741c94&vjs=3"},
{"job_title": "newSupervisory IT Specialist (PLCYPLN)", "summary": "Duties This position is primarily aligned to the following NICE Cybersecurity Workforce Framework work roles: NCWF Code 422 - Data Analyst For more…", "company": "US Immediate Office of the Assistant Secretary for...", "location": "Salt Lake City, UT", "job_description": "Duties\nThis position is primarily aligned to the following NICE Cybersecurity Workforce Framework work roles:\n\nNCWF Code 422 - Data Analyst\n\n\nFor more information about these work roles, where they fit within the larger Cyber Workforce, and how they can support your unique career journey, please visit the Cyber Career Pathways tool on the National Initiative for Cybersecurity Careers and Studies website: https://niccs.us-cert.gov/workforce-development/cyber-career-pathways\n\n\nThis announcement is non-bargaining.\n\n\nWork Schedule: Monday - Friday, 8:00am - 4:30pm\nCompressed/Flexible Schedule: Available\nTelework: Available\nDuty Location Status: Will work remotely from home.\nPosition Description Title/PD#: Supervisory IT Specialist (PLCYPLN)/ PD193940\nRelocation/Recruitment Incentives: Not Authorized\nFinancial Disclosure Report: Not Required\nPhysical Demands: The work is sedentary and does not require any special physical effort. Duties may require\nlifting and carrying computer equipment such as monitors and printers. Supervisory Probationary Period: Applicants selected for this position may be required to serve a one-year supervisory probationary period. Failure to successfully complete the supervisory probationary period will result in the employee being reassigned to a position in the agency of no lower grade and pay than the one the employee left to accept the supervisory or managerial position.\n\nMajor Duties:\nDefines and implements the Technology Business Management (TBM) strategy in collaboration with internal and external stakeholders, including facilitation of working sessions of medium to large sized groups across all levels of the organization.\nFormulates plans and proper courses of action to implement TBM program objectives on a timely and accurate basis and ensures proper coordination with the necessary officials.\nParticipates in government-wide TBM implementation groups and provides expert TBM technical advice to other IT Specialists and/or personnel.\nServes as an agency expert on TBM and represents the organization in meetings with representatives of industry, other agencies, public organizations, etc., to resolve problems, develop joint policies/standards and exchanges information regarding Technology Business.\n\nRequirements\nConditions of Employment\nYou must be a U.S. citizen to apply for this job.\nSelectees are subject to a background/suitability investigation.\nDesignated and/or random drug testing may be required\nSelectees may be required to serve a probationary period.\nSelective Service Registration is required for males born after 12/31/1959.\nA complete application package, i.e., Resume, Transcripts, etc., as required by the job announcement.\nSelected applicants will be required to complete an online onboarding process.\nParticipation in the Seasonal Influenza Prevention Program for VHA Health Care Personnel (HCP) is a requirement for all Department of Veterans Affairs HCP.\nAll applicants tentatively selected for VA employment in a testing designated position are subject to urinalysis to screen for illegal drug use prior to appointment. Applicants who refuse to be tested will be denied employment with VA.\nMust be proficient in written and spoken English.\nQualifications\nTo qualify for this position, applicants must meet all requirements by the closing date of this announcement, 02/14/2022.\n\nYou may qualify based on your experience as described below.\n\nExperience - Experience must be IT related; the experience may be demonstrated by paid or unpaid experience and/or completion of specific, intensive training (for example, IT certification), as appropriate.\n\nFor all positions individuals must have IT-related experience demonstrating each of the four competencies listed below. The employing agency is responsible for identifying the specific level of proficiency required for each competency at each grade level based on the requirements of the position being filled.\nAttention to Detail - Is thorough when performing work and conscientious about attending to detail.\nCustomer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services.\nOral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately.\nProblem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations.\nAND\n\nSpecialized Experience: You must have one year of specialized experience equivalent to at least the next lower grade (GS-13) in the normal line of progression for the occupation in the organization. Specialized experience is defined as overseeing and managing work necessary to design, implement, maintain, and/or modify Technology Business Management (TBM) data and reports to facilitate usage of the data to make decisions; providing support for IT investments and initiatives; participating in the coordination of enterprise architecture, IT capital planning and portfolio management, IT strategy and performance management, and IT governance.\n\nSuch experience is typically gained in the IT field or through the performance of work where the primary concern is IT.\n\nExperience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religions; spiritual; community; student; social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.\n\nNote: A full year of work is considered to be 35-40 hours of work per week. Part-time experience will be credited on the basis of time actually spent in appropriate activities. Applicants wishing to receive credit for such experience must indicate clearly the nature of their duties and responsibilities in each position and the number of hours a week spent in such employment. For more information on these qualification standards, please visit OPM's web site at http://www.opm.gov/qualifications/standards/indexes/alph-ndx.asp.\nEducation\nThere is no education substitution at the GS- 14 grade level.\n\nNOTE: Participation in the seasonal influenza program is a condition of employment and a requirement for all Department of Veterans Affairs Health Care Personnel (HCP). It is a requirement that all HCP to receive annual seasonal influenza vaccination or obtain an exemption for medical or religious reasons. Wearing a face mask is required when an exemption to the influenza vaccination has been granted. HCP in violation of this directive may face disciplinary action up to and including removal from federal service. HCP are individuals who, during the influenza season, work in VHA locations or who come into contact with VA patients or other HCP as part of their duties. VHA locations include, but are not limited to, VA hospitals and associated clinics, community living centers (CLCs), community-based outpatient clinics (CBOCs), domiciliary units, Vet centers and VA-leased medical facilities. HCP include all VA licensed and unlicensed, clinical and administrative, remote and onsite, paid and without compensation, full- and part-time employees, intermittent employees, fee basis employees, VA contractors, researchers, volunteers and health professions trainees (HPTs) who are expected to perform any or all of their work at these facilities. HPTs may be paid or unpaid and include residents, interns, fellows and students. HCP also includes VHA personnel providing home-based care to Veterans and drivers and other personnel whose duties put them in contact with patients outside VA medical facilities.\n\nAdditional Information: Per Office of Personnel Management policy, federal employees are assumed to have gained experience by performing duties and responsibilities appropriate for their official series and grade level as described in their position description. Experience that would not usually be part of the employee's position is creditable; however, the experience is considered creditable when documented by satisfactory evidence, such as a signed memorandum from the employee's supervisor or an SF-50 or SF-52 documenting an official detail or other official assignments. The documentation must indicate whether the employee performed the duties full time or, if part-time, the percentage of times the employee performed the additional duties. The employee should be able to locate this documentation in their official personnel record. To receive credit for experience in your resume that is not within the official series and grade level of your official position, you must provide a copy of the appropriate and official documentation of such experience as indicated above.\nAdditional information\nCOVID-19 Pandemic Expanded Telework Program - Due to COVID-19, VA is currently in an expanded telework posture. If selected, you may be expected to temporarily telework, even if your home is located outside the local commuting area. Once employees are permitted to return to the office, you will be expected to report to the duty station listed on this announcement. Management officials will provide information about returning to the official, pre-pandemic worksite, when applicable. At that time, you may be eligible to request to continue to telework depending upon the terms of your organization's telework policy and the duties of the position.VA supports the use of telework as a way to help attract and retain talented individuals in public service, increase worker productivity, and better prepare the agency to operate during emergencies. This position may be authorized for telework. Telework eligibility will be discussed during the interview process.\n\nThe Interagency Career Transition Assistance Plan (ICTAP) and Career Transition Assistance Plan (CTAP) provide eligible displaced VA competitive service employees with selection priority over other candidates for competitive service vacancies. To be well-qualified, applicants must possess experience that exceeds the minimum qualifications of the position including all selective factors if applicable, and must be proficient in most of the requirements of the job. Information about ICTAP and CTAP eligibility is on OPM's Career Transition Resources website which can be found at https://www.opm.gov/.\n\nReceiving Service Credit for Earning Annual (Vacation) Leave: Federal Employees earn annual leave at a rate (4, 6 or 8 hours per pay period) which is based on the number of years they have served as a Federal employee. VA may offer newly-appointed Federal employee's credit for their job-related non-federal experience or active duty uniformed military service. This credited service can be used in determining the rate at which they earn annual leave. Such credit must be requested and approved prior to the appointment date and is not guaranteed.\n\nThis job opportunity announcement may be used to fill additional vacancies.\nIf you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application.\n\n\nBenefits\n\nA career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\nReview our benefits\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\nHow You Will Be Evaluated\nYou will be evaluated for this job based on how well you meet the qualifications above.\nIN DESCRIBING YOUR EXPERIENCE, PLEASE BE CLEAR AND SPECIFIC. WE WILL NOT MAKE ASSUMPTIONS REGARDING YOUR EXPERIENCE. Applicants will be referred in the order in which they were received.\nBenefits\n\nA career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\nReview our benefits\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\nRequired Documents\nAs a new or existing federal employee, you and your family may have access to a range of benefits. Your benefits depend on the type of position you have - whether you're a permanent, part-time, temporary or an intermittent employee. You may be eligible for the following benefits, however, check with your agency to make sure you're eligible under their policies.\nDocuments Accepted:\n\nPerformance Appraisal\nResume\nSeparation Notice (RIF)\nSF-50/ Notification of Personnel Action\nDocuments Required:\nResume\nPlease review the above list(s) to ensure you have included all necessary documents required for your application.Not every applicant will require the same documents, therefore it is the applicants responsibility to ensure that their application package includes all necessary documents to determine qualifications and eligibility for appointment, such as a copy of your SF-50, transcript, ICTAP/CTAP documentation (for displaced Federal employees).You will not be contacted for additional information. Applicants will be deemed ineligible if supporting documentation is not submitted.\n\nVeterans' Preference: Since the Direct-Hire Recruitment Authority is being used, traditional Veterans' Preference rules do not apply. Qualified veterans will, however, be given full consideration for this position.\n\nApplications are accepted online. Applying online will allow you to review and track the status of your application.\nHow to Apply\nAll applicants are encouraged to apply online.\n\nTo apply for this position, you must complete the occupational questionnaire and submit the documentation specified in the Required Documents section. The complete application package must be submitted by 11:59 PM (EST) on 02/14/2022 to receive consideration. To preview the questionnaire click https://apply.usastaffing.gov/ViewQuestionnaire/11381526.\n\n1. To begin, click Apply Online to create a USAJOBS account or log in to your existing account. Follow the prompts to select your USAJOBS resume and/or other supporting documents and complete the occupational questionnaire.\n\n2. Click Submit My Answers to submit your application package.\n\nNOTE: It is your responsibility to ensure your responses and appropriate documentation is submitted prior to the closing date. To verify your application is complete, log into your USAJOBS account, https://my.usajobs.gov/Account/Login, select the Application Status link and then select the More Information link for this position. The Details page will display the status of your application, the documentation received and processed, and any correspondence the agency has sent related to this application. Your uploaded documents may take several hours to clear the virus scan process.\n\nTo return to an incomplete application, log into your USAJOBS account and click Update Application in the vacancy announcement. You must re-select your resume and/or other documents from your USAJOBS account or your application will be incomplete.\nAgency contact information\nVHA National Recruitment Center\nPhone\n(844)456-5208\nEmail\nVHANationalRecruitmentCenter@va.gov\nAddress\nOAS Information and Technology - 103\n810 Vermont Avenue NW\nWashington, DC 20420\nUS\n\nNext steps\nAfter the vacancy announcement closes, applicants are evaluated to ensure qualification and eligibility requirements are met. After the review is complete, a referral certificate(s) is issued and applicants will be notified of their status by email.\nFair and Transparent\nThe Federal hiring process is setup to be fair and transparent. Please read the following guidance.\nEqual Employment Opportunity (EEO) Policy\nReasonable accommodation policy\nFinancial suitability\nSelective Service\nNew employee probationary period\nSignature and false statements\nPrivacy Act\nSocial security number request\n\nRequired Documents\nDocuments Accepted:\n\nPerformance Appraisal\nResume\nSeparation Notice (RIF)\nSF-50/ Notification of Personnel Action\nDocuments Required:\nResume\nPlease review the above list(s) to ensure you have included all necessary documents required for your application.Not every applicant will require the same documents, therefore it is the applicants responsibility to ensure that their application package includes all necessary documents to determine qualifications and eligibility for appointment, such as a copy of your SF-50, transcript, ICTAP/CTAP documentation (for displaced Federal employees).You will not be contacted for additional information. Applicants will be deemed ineligible if supporting documentation is not submitted.\n\nVeterans' Preference: Since the Direct-Hire Recruitment Authority is being used, traditional Veterans' Preference rules do not apply. Qualified veterans will, however, be given full consideration for this position.\n\nApplications are accepted online. Applying online will allow you to review and track the status of your application.\nHelp\nThis job is open to\nCareer transition (CTAP, ICTAP, RPL)\nFederal employees who meet the definition of a \"surplus\" or \"displaced\" employee.\nThe public\nU.S. Citizens, Nationals or those who owe allegiance to the U.S.\nClarification from the agency\nALL US CITIZENS. DIRECT HIRE AUTHORITY: This position is being filled using Direct-Hire Authority (5 CFR 337.205) for this occupation.", "url": "https://www.indeed.com/viewjob?jk=5466e0133b056228&from=serp&vjs=3"},
{"job_title": "newVoIP Technician", "summary": "Conduct testing and disaster recovery plans to detect faults, minimize malfunctions, and backup systems.\nAbility to operate tools, components, peripherals, and…", "company": "Montgomery County Pennsylvania", "location": "Remote in Norristown, PA", "job_description": "POSITION DESCRIPTION: VoIP Technician\nREMOTE WORK ELIGIBLE: Yes\nEXEMPT: No\nDEPARTMENT: Information and Technology Solutions\nPOSITION REPORTING: Deputy Chief Information Officer\nSUMMARY: The VoIP Technician’s role is to coordinate strategies for defining, deploying, and maintaining the County’s IP telephony voice communication architecture and its associated network connections and component hardware. This includes assisting with all engineering projects for VoIP initiatives, and configuring and optimizing all VoIP/IP-PBX telephone systems and services, both internally and those integrated with Internet-based services. Also, the VoIP Technician’s mandate will be to maintain SLAs for all organizational IP telephony applications.\nESSENTIAL DUTIES AND RESPONSIBILITIES\nStrategy & Planning\nSupport VoIP infrastructure and its associated software, including IP-PBXs, call management systems, voice mail, and interactive voice response;\nWhere necessary, assist in plan for management or phasing out of legacy telephony systems and other switch-based technologies;\nSelect, deploy, and utilize appropriate tools for reporting and routing of IP telephony traffic on the network.\nAcquisition & Deployment\nCollaborate with systems engineers/architects for upgrades to operating systems, hardware, etc.;\nRemain current on new transport protocols, products, and standards in support of VoIP systems development and equipment procurement.\nOperational Management\nIntegrate IP telephony systems with enterprise LANs, WANs, wireless LANs, and other Internet-based services and protocols;\nCollaborate with help desk to resolve trouble tickets and mitigate end-user issues with VoIP hardware and/or applications;\nAssist with the installation planning and maintenance of network cabling, including MDF and IDF closets;\nPerform telephony audits as necessary;\nMonitor and identify capacity and performance issues for VoIP traffic to ensure continued, uninterrupted operation of telephony systems;\nCollaborate with network engineers or administrators to ensure that VoIP traffic does not interfere with or hinder network data traffic;\nConduct testing and disaster recovery plans to detect faults, minimize malfunctions, and backup systems.\nQUALIFICATION REQUIREMENTS:\nFormal Education & Certification\nCollege diploma or university degree in the field of telecommunications or computer science and/or 10 years equivalent work experience;\nCertifications in administrating VoIP systems is a plus.\nKnowledge & Experience\nWorking technical knowledge of VoIP/IP telephony systems, software, and hardware, including voicemail systems, boarder control session devices, switches, routers, call handler devices and handsets;\nStrong hands-on knowledge of the configuration and optimization of VoIP equipment, including voicemail systems, boarder control session devices, switches, routers, call handler devices and handsets;\nStrong hands-on knowledge of SIP, H.323, TCP/IP, and other protocols;\nStrong understanding VoIP QoS issues and mitigation strategies;\nWorking technical knowledge of the VoIP operating systems (Cisco and Avaya);\nDirect experience with Avaya and Cisco switches and routers;\nFamiliar with network topologies such as Frame Relay, ATM, ISDN, etc.;\nKnowledge of cabling and wiring systems, design, and installation;\nAbility to operate tools, components, peripherals, and testing accessories.\nPersonal Attributes\nAble to prioritize and execute tasks in a high-pressure environment;\nAbility to read and interpret technical documents and procedure manuals;\nStrong interpersonal skills, oral communication skills, and proven analytical and problem-solving abilities;\nStrong understanding of the organization’s goals and objectives;\nAbility to conduct research into IP telephony issues and products;\nStrong customer service orientation;\nHelp desk experience;\nExperience working in a team-oriented, collaborative environment.\nWork Conditions\nOn-call availability;\nSitting for extended periods of time;\nDexterity of hands and fingers to operate a computer keyboard, mouse, power tools, and to handle other communications/computer components;\nOccasional inspection of cables and wiring in floors and ceilings;\nLifting and transporting of moderately heavy objects, such as telephony equipment and peripherals.", "url": "https://www.indeed.com/viewjob?jk=1d0e894cb59d93f0&from=serp&vjs=3"},
{"job_title": "Technician, Line", "summary": "Performs and ensures that efficient production is maintained throughout the plant.\nTroubleshoots problems and corrects deficiencies to ensure successful…", "company": "Ball Corporation", "location": "Kapolei, HI 96707 (Makakilo-Kapolei area)", "job_description": "Do you want to work for a world-leading manufacturer who strives to build a better future through sustainability and innovation? Are you looking for a new challenge in a stable, fast-growing sector?\nJoin us, and build your career by helping us build the future.\nWe are a global leader in sustainable products with more than 21,000 team members worldwide. From infinitely recyclable aluminum cans, cups, and aerosol bottles, to aerospace solutions that enable our customers to have a deeper understanding of our planet and the universe. We produce all these incredible things with one unique purpose: crafting a better community, a better society, a better world.\nMoreover, each of us has a deep commitment to diversity and inclusion which is the foundation of our culture of belonging. And everyone at Ball is an everyday champion, making a difference by doing what we love.\nWe lead with our heads and our hearts and combine innovative thinking with a spirit of resiliency that keeps us moving forward in a relentless pursuit of new ways to make life, and the world, better. Whether we’re developing packaging that’s infinitely recyclable or aerospace innovations. Because what we create may change, but what we will always make is a difference.\nPrimary purpose of the position:\nPerforms and ensures that efficient production is maintained throughout the plant. Troubleshoots problems and corrects deficiencies to ensure successful production.\nEssential Responsible Areas:\nYou will perform repairs and maintenance on equipment, to include preventative maintenance for building and grounds\nTroubleshoot, repair, install, erect, move and/or dismantle all types of machinery and auxiliary\nproduction equipment.\nYou will Inspect job site and equipment to be dismantled, erected or moved; analyzes blueprints and\nschematics; estimates weight of loads to be handled, lifted, clearances and recommends support\nequipment needed\nAccepts and rejects parts for the department; recommends qualities, dimensions, and the priorities\nand disposition of parts; repairs and installs equipment as necessary.\nReceives instructions, prints and work orders. Makes drawings or sketches of parts to be made or\nrepaired.\nPerform layout work\nYou will fabricate sheet metal and structural units as needed: guarding, steps, stairs, conveyors, elevators,\nand platforms, sets in place.\nWillingness to learn how to drive a forklift or aero lift.\nFollow job safety practices, policies, and procedures for safe performance of assignments\nMust wear appropriate safety glasses, hearing protection, clothing, and footwear in\nappropriate areas and follow safety practices\nWork a 12 hour rotating shift, it is expected to be 3 on / 3 off. Shifts will rotate from days to nights every 2 weeks.\nPosition Requirement & competencies:\nHigh school Diploma or equivalent required\nMinimum of 1 year job related experience\nPreferred Qualifications:\nWorking knowledge of the following areas: hand and power tools, precision measuring instruments, perform basic mathematical calculations, aptitude for mechanics, operate and use a computer\nDecision Quality. Makes good decisions (without considering how much time it takes) based upon a\nmixture of analysis, wisdom, experience, and judgment; most of his/her solutions and suggestions\nturn out to be correct and accurate when judged over time; sought out by others for advice and\nsolutions\nFollow EHS procedures including maintaining compliance to certification requirements and use appropriate PPE for each assigned task; make recommendations to improve ergonomics, health and safety of work.\nCompensation & Benefits\nHiring Pay Rate: $28.76 (Salary to be determined by the applicant’s education, experience, knowledge, skills, and abilities, as well as internal equity and alignment with market data.)\nOther Compensation: This role will be eligible to participate in the annual incentive compensation plan.\nRegular Full-Time Salaried and Hourly positions: Ball includes a comprehensive benefits structure, Go to our career site and click \"Total Rewards\" to learn more.\n Ball Corporation has been made aware of reports involving fraudulent job offers. These often appear legitimate, but Ball does not make job offers until after a candidate has submitted a job application and has participated in a face-to-face interview (In person or via WebEx). All email correspondence from Ball Corporation ends in “@ball.com.” Please also be advised that Ball will never request payment or require candidates to deposit a check during the recruitment and onboarding processes. If you have questions about any open positions at Ball, please visit our careers website at https://jobs.ball.com/.\nIf you have applied to a position and have been asked for personal information through LinkedIn, please notify LinkedIn directly.\nEqual Opportunity Employer\nMinority, Female, Disabled, Lesbian, Gay, Bi-sexual, Transgender and Veterans", "url": "https://www.indeed.com/viewjob?jk=d03ebf873aad0c6a&tk=1frep97i4p11n802&from=serp&vjs=3&advn=7722200469195474&adid=370312629&ad=-6NYlbfkN0CSeKvAxfjdQGmn7SPrTLoVVoxm5foIlKyMLLDoJnvOIjr93ttXF0xlN-DqDslksf_JhIPEQUWHCf09dFVlFdhv0opmj8Q8ctmmfU05j0TUCwL3DRkyJ54K00JTgWUUlESkrhniYr1L8MbUbo6j0NetpXTYesPpThyNs9HnFRZMqQabbeCvWlARH8CVScy-tM8u4vl-XorIFYEqJaVKBQ52rISA2BLiPmV794EPpeCHFrYk0ebER531bJabg5poCI5FVBPLt0k1N_RVRXKxirIdjHP4Xjtt7LLa0uAOHQvGdsyMYlrPs-Kqaw6YoGTV73b0D03Xy-k_1viZUr8bJIYcK-exKP8RzvM=&sjdu=4Dqa7CA3WUh7GZ22MnuwuKPtgbUokJoTQ4v_NgQQZQACAyFe5zQ0ykDJjxrxQHqkxBLP23ans8k5U7DqVmUG5BcX1FCZp6h5g7QAQNBepcQpyf-1l38gXo-3JGiT-J2v-cmMCYkq7i3JQTyH8hzl47Axs8wTx265EJrCPkqZXXEc2nZqt4NGdidaJ-hw0fp8Q_LBTZDNbVhJg_Rv5wlUR9Fy09Txv1hQCrfSJB8DfYQ"},
{"job_title": "Operations Coordinator-2 (100% Remote)", "summary": "Responsible for providing work order management support, program administration and reporting; and other activities as assigned.", "company": "JLL", "location": "Remote in Hartford, CT+4 locations", "job_description": "About JLL –\nWe’re JLL—a leading professional services and investment management firm specializing in real estate. We have operations in over 80 countries and a workforce of over 91,000 individuals around the world who help real estate owners, occupiers and investors achieve their business ambitions. As a global Fortune 500 company, we also have an inherent responsibility to drive sustainability and corporate social responsibility. That’s why we’re committed to our purpose to shape the future of real estate for a better world. We’re using the most advanced technology to create rewarding opportunities, amazing spaces and sustainable real estate solutions for our clients, our people and our communities.\nOur core values of teamwork, ethics and excellence are also fundamental to everything we do and we’re honored to be recognized with awards for our success by organizations both globally and locally.\nCreating a diverse and inclusive culture where we all feel welcomed, valued and empowered to achieve our full potential is important to who we are today and where we’re headed in the future. And we know that unique backgrounds, experiences and perspectives help us think bigger, spark innovation and succeed together.\nIf this job description resonates with you, we encourage you to apply even if you don’t meet all of the requirements below. We’re interested in getting to know you and what you bring to the table!\nResponsible for providing work order management support, program administration and reporting; and other activities as assigned\nReceives and coordinates maintenance repair calls: scheduling, follow-up, quote preparation, problem resolution, and post-service activities. Completes repair service work orders/projects\nWorks with Operations Managers, Account Managers and Category Managers for resolution of problems\nManages complex client projects from beginning to successful completion\nFollows up with client home office contact to make sure service delivery, work orders, and special projects are completed in a timely and satisfactory manner\nCompletes special projects as needed\nCommunicate with clients daily to maintain a first-class relationship using phone, email, reports, internal, client, and 3rd-party systems\nReview and prioritize open work for follow-up and attention based on age, status, or other factors; perform appropriate follow-up\nWork with internal groups (Sourcing Team, Operations Team, Category Management, Billing) to communicate customer requirements and to resolve any challenges, issues, or new opportunities\nWork with client and service provider personnel to set up systems, maintain access and usability, provide training, and coordinate any IT or other projects\nProvide required reporting, data, and dispatch updates for assigned units of business\n\nConduct periodic weekly calls to run through any updates, check-ups, and basic information sharing\nAnalyse weekly trades with high volume of calls and provide solutions to decrease volume\nPerform other duties, activities, or projects as assigned\nRequires participating in afterhours call rotation for dispatching and following up on afterhours emergencies\n\nWhat you can expect from us\nWe succeed together and believe the best inspire the best, so we invest in supporting each other, learning together and celebrating our success.\nOur Total Rewards program reflects our commitment to helping you achieve your career ambitions, recognizing your contributions, investing in your well-being and providing competitive benefits and pay.\nWe can’t wait to see where your ambitions take you at JLL. Apply today!", "url": "https://www.indeed.com/viewjob?jk=48f053ec83e28ea4&from=serp&vjs=3"},
{"job_title": "Administrative Assistant/Data Entry", "summary": "Responsible for performing a variety of administrative, office, and clerical functions.\nMakes arrangements and assists with executive management meetings,…", "company": "MBI Health Services, LLC", "location": "Washington, DC 20020 (Anacostia area)", "job_description": "SUMMARY OF FUNCTIONSResponsible for performing a variety of administrative, office, and clerical functions.ESSENTIAL DUTIES AND RESPONSIBILITIESProvides administrative assistance to the Program supervisor and other company officers as required or as requested including word processing, transcription, information research, filing, taking, and directing telephone messages. Drafts memos, financial and other reports as appropriate. Makes arrangements and assists with executive management meetings, conferences and board of directors meetings.Schedules and performs word processing and spreadsheet activities; formats, revises, and prints out final copies of complex documents for other employees.Maintains and manages computer network and ensures appropriate back-up and storage of computer files. Trains employees and assists with questions or problems related to computer hardware/software. Coordinates with outside computer programmers, consultants, and contractors.Responsible for operating and maintaining office equipment; arranges for repairs when necessary. Makes recommendations for new or additional office equipment as appropriate. Supervises receptionist and performs duties in receptionist's absence.Responsible for developing, implementing, and updating office policies and procedures including scheduling appointments, processing mail, answering phones, and ordering supplies.Coordinates all travel arrangements for the company; researches and makes flight, hotel, and rental car reservations in accordance with company policies and to obtain the most economical and efficient travel. Creates travel itinerary and schedules in accordance with authorized travel requests.Performs other administrative or office duties or projects as required or as assigned.ORGANIZATIONAL RELATIONSHIPSReports directly to Program Supervisor. Assists and coordinates activities with the President and other managers in the company. Supervises Receptionist.QUALIFICATIONSA high school diploma is required. Good communication skills and the ability to work well with people is essential.PHYSICAL DEMANDSAbility to communicate orally with customers, vendors, management, and coworkers. Regular use of the telephone and e-mail for communication is essential.Sitting for extended periods is common. Hearing, vision, and speaking within normal ranges is essential for normal conversations, to receive ordinary information, and to prepare or inspect documents.No heavy lifting is expected. Exertion of up to 10 lbs. of force occasionally may be required. Good manual dexterity for the use of common office equipment such as computer terminals, calculator, copiers, and FAX machines.Good reasoning ability is important. Able to understand and utilize management reports, memos and other documents to conduct business.WORK ENVIRONMENTThe job is performed indoors in a traditional office setting. Activities include extended periods of sitting occasional fast paced events and extensive work at a computer monitor and/or calculator.Job Types: Full-time, Part-timePay: $37,000.00 - $41,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceDisability insuranceHealth insuranceLife insurancePaid time offVision insuranceSchedule:8 hour shiftEducation:High school or equivalent (Preferred)Experience:Customer service: 2 years (Preferred)Work Location: One location", "url": "https://www.indeed.com/viewjob?jk=2be013d24ba0ac0d&q=Administrative&l=USA&from=web&advn=5892994428449667&adid=382045331&ad=-6NYlbfkN0A6LvjKwjEG97v7PgEGuGeJnFwJSAE9kAkWNNOtOS-3KE1X_fPxV2Pa_SwPkuH-W2QVLUx4pCdlOeXmMUN9Q6sZNQ6po_ZMN9IzFQsPEZPH_a6cVjpF9Un7DGOSXTVbc5eYsNTGdKlMNciOrB72lEsj85aQfKvqstN1lF3lVRvHDqZ8gHhZezfkwm0OXt-lp6rbhebTTFnFtE3A1rBX-YqCOETUpWmfYghMFblZ3p01FNg_o8ZwDkS-PURrYZtuCITTk4MkKWGeUiHRxp9eqSlsOs7JRhjxvRdpvzyXCaokJkk8iIm-TOCmzemAIpzJJJMSbSEUA9Jnag2d-kpnRmZigKtzZPFjf4CpETyVXuUWxPstayXyiuD2&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "new2022 Virtual Summer Associate - Operations, ACPNY", "summary": "In collaboration with cross functional groups, (strategy, clinical, nursing, human resources, and IT) the operations group plans, implements and evaluates…", "company": "ConnectiCare", "location": "New York, NY", "job_description": "2022 Virtual Summer Associate Program – Operations, ACPNY\nEmblemHealth is a family of health and wellness companies that believes in our mission to create healthier futures for our customers, patients, and communities. Everything we do is guided by our core values:\n\nEmpower\nWe believe in acting as proactive self-starters and enabling our colleagues to succeed.\nDeliver\nWe believe in achieving our goals and taking accountability for our actions.\nDo It Together\nWe believe in caring for our customers, patients, and one another, while valuing diversity, equity, and inclusion.\nAs one of the nation’s largest not-for-profit health insurers, EmblemHealth serves more than three million people in the New York tristate area. We are anchored by our 80-year-old not-for-profit roots while remaining change agents fueled by innovation and excellence to create better health outcomes.\n\nOur family of companies also includes ConnectiCare, one of Connecticut’s leading health plans; AdvantageCare Physicians, a primary and specialty medical group; and WellSpark, a digital wellness company.\n\nWe are proud that our workforce is as diverse as the communities we serve, and we are intentional about our inclusive practices for our organization.\nIf you want to be a part of a bigger story, if you want to make a difference in people lives and the communities around you, if you think healthcare matters to every one of us – Join us!\nOperations\nThe Operations team is responsible for managing and leading the health care delivery processes in the medical offices across five regions including Manhattan, Staten Island, Brooklyn, Queens, and Long Island. Operations leaders drive change, solve complex problems, and create dynamic new approaches that will improve the value, quality, and cost of patient care. In collaboration with cross functional groups, (strategy, clinical, nursing, human resources, and IT) the operations group plans, implements and evaluates processes and workflows designed to optimize care delivery and create patient service excellence.\n\nSummer Associate Program\nThe Summer Associate Program provides opportunity for students to work alongside of senior leaders who are committed to growing, developing, and empowering the next generation of healthcare leaders. The Operations Summer Associate will work on special projects designed by the business and participate in the following career development activities:\nIntroduction to the Health Care IndustrySenior Leadership Networking LunchLearning & Development SeriesFinal Project Presentations\nProgram Details\n9-week paid program; Monday, June 6, 2022 to Friday, August 5, 2022Full-time; 40-hours per weekHourly rate of $30 per hourProject-driven\nWe are looking for candidates who are -\nPursing an undergraduate or graduate degree in the healthcare Industry; rising undergraduate juniors/seniors, and first-year graduate students strongly preferredStrong academic performance, minimum GPA of 3.0 or above preferredAnalytical, collaborative, and strong communication skillsProject management\nAdditional Information\nJob Type: Temporary Work\nSchedule: Full-time\nEmployee Status: Temporary", "url": "https://www.indeed.com/viewjob?jk=a39be2db265aa12e&from=serp&vjs=3"},
{"job_title": "Research Operation Specialist", "summary": "2+ years experience working in research operations or research program management.\nYour work in this role will have a direct and meaningful impact on improving…", "company": "DocuSign", "location": "Remote in California", "job_description": "Research Operation Specialist\nProduct Experience | San Francisco, CA or Seattle, WA or Remote - US\n\nThis position is not eligible for employment in the following states: Alaska, Hawaii, Maine, Mississippi, North Dakota, South Dakota, Vermont, West Virginia and Wyoming.\n\nOur agreement with employees\nDocuSign is committed to building trust and making the world more agreeable for our employees, customers and the communities in which we live and work. You can count on us to listen, be honest, and try our best to do what's right, every day. At DocuSign, everything is equal. We each have a responsibility to ensure every team member has an equal opportunity to succeed, to be heard, to exchange ideas openly, to build lasting relationships, and to do the work of their life. Best of all, you will be able to feel deep pride in the work you do, because your contribution helps us make the world better than we found it. And for that, you'll be loved by us, our customers, and the world in which we live.\n\nThe team\n\nOur Product Experience team - Design, Information, and Insights - focuses on our customers and their business needs. We contribute from the concept all the way to the building of world-class product experiences by partnering with Product Managers, Program Managers, Software Engineers and other cross-functional teams. Together, we are a team of craftspeople who aim to make the complex look easy. We employ insights, pixels, and words to solve big problems and make delightful experiences.\n\nThis position\nResearch Operation Specialists at DocuSign are responsible for orchestrating meaningful solutions that advance the impact of UX Research teams at scale. Your work in this role will have a direct and meaningful impact on improving the overall experiences of our products. This individual will help create streamlined processes and programs that ensure research value across our entire Produce Experience organization.\n\nSuccess in this role will require effective collaboration across several stakeholder groups to create alignment, efficient working agreements, and clear expectations. It will also depend on building strong relationships with researchers, establishing solid rapports and instilling trust throughout. Last, success in this role will be defined by exceptional organizational skills and a strong desire to not only create, but maintain mutually beneficial outcomes.\n\nOur Product Experience organization is growing fast. With that, this individual will need to have a growth mindset and an ability to address the operational needs of the organization in a tactically efficient manner.\n\nThis position is an individual contributor role reporting to Manager of Research Operations and is designated Flex.\n\nResponsibilities\n\nOwn and manage full-cycle recruiting efforts for multiple research teams and their initiatives\nIdentify processes, programs, or products that allow our team to capitalize on creative solutions which minimize effort and maximize value\nWork actively and effectively with stakeholders to advance research initiatives in a relevant and timely manner\nManage several moving parts to any particular project, remaining mindful of scope, constraints, dependencies, and roadblocks\nTrack, measure, and report work that is carried out by the team to identify strengths as well as areas for improvement\nBecome knowledgeable of UX Research practices to effectively create and maintain cohesion between ResOps and UX Research\nIdentify possible solutions that streamline existing processes, being mindful of integration and automation opportunities\nCultivate an expectation across our Product Experience organization that enables and empowers our researchers to conduct world-class UX Research\n\nBasic qualifications\n\nBA/BS or MS/MA degree or equivalent work experience\n2+ years experience working in a SaaS, PaaS, and/or IaaS technology company and/or industry\n2+ years experience working in research operations or research program management\n2+ years of experience creating, managing, or actively using participant management platforms\n\nPreferred qualifications\n\nProficiency using Google Suite / Workspace products\nFamiliarity with UX Research best practices\nCan tactically address bottlenecks, blockers, and holding patterns in a way that results in optimal project completion times\nExperience using other UX Research and ResOps platforms (e.g., Qualtrics, Ethnio, Respondent)\nCan communicate and collaborate comfortably with relevant stakeholder groups (e.g., legal, security, compliance, data science, product management)\nExperience in other domains of ResOps (e.g., knowledge management, advocacy, competency, governance, tool management) is a plus\nExperience working on teams that have transitioned from reactive to proactive operational states\n\nBased on Colorado law, the following details are for Colorado individuals only: Colorado base salary range: $84,900 - $102,100 and eligible for bonus, equity and benefits.\n\nVaccination requirement\nDocuSign may require all employees to be fully vaccinated against COVID-19 and provide proof of vaccination to visit a DocuSign office, to meet with potential or actual customers or business partners, or for other business-related purposes, in accordance with local law. Please note that DocuSign has contracts with different governments globally which may require compliance with local and federal laws.\n\nAbout us\nDocuSign helps organizations connect and automate how they prepare, sign, act on, and manage agreements. As part of the DocuSign Agreement Cloud, DocuSign offers eSignature: the world's #1 way to sign electronically on practically any device, from almost anywhere, at any time. Today, over a million customers and hundreds of millions of users in over 180 countries use DocuSign to accelerate the process of doing business and simplify people's lives. And we help save the world's forests and embrace environmental sustainability.\n\nIt's important to us that we build a talented team that is as diverse as our customers and where all employees feel a deep sense of belonging and thrive. We encourage great talent who bring a range of perspectives to apply for our open positions. DocuSign is an Equal Opportunity Employer and makes hiring decisions based on experience, skill, aptitude and a can-do approach. We will not discriminate based on race, ethnicity, color, age, sex, religion, national origin, ancestry, pregnancy, sexual orientation, gender identity, gender expression, genetic information, physical or mental disability, registered domestic partner status, caregiver status, marital status, veteran or military status, or any other legally protected category.\n\nAccommodations\nDocuSign provides reasonable accommodations for qualified individuals with disabilities in job application procedures, including if you have any difficulty using our online system. If you need such an accommodation, you may contact us at accommodations@docusign.com.\n\n#LI-Remote", "url": "https://www.indeed.com/viewjob?jk=19a89b91a1291fac&from=serp&vjs=3"},
{"job_title": "Associate Product Manager", "summary": "Manage the program calendar and day-to-day operations on engagements.\nThe APM runs the logistics, operations, and the execution of the various programs through…", "company": "OneValley", "location": "Hybrid remote in San Mateo, CA", "job_description": "Early career? Product focused? Hyper-motivated? Passionate about tech and start ups?If that sounds like you, then the OneValley Associate Product Manager (APM) role is an incredible opportunity to learn about technology and organizational innovation from the ground up. Be part of a rapidly scaling team, driven by our mission to empower the world’s startups and nonprofits to innovate, accelerate and scale.The APM RoleThe APM is responsible for supporting the development of features, focused content, learning modules, and best-practice templates for OneValley’s digital experience.The APM will coordinate with the Product and other teams to develop new features and deliver clear product specifications for technology teams to implement. The APM runs the logistics, operations, and the execution of the various programs through all stages of the product. Key stakeholders will likely work on multiple engagements at any given time and will have other responsibilities/objectives that benefit OneValley’s Product and the overall community of startups and innovators.This position will start ASAP and will work in person at our Innovation Center in San Mateo, in line with local guidance on COVID precautions (we are currently optional in-office, with a hybrid hybrid return to work expected from April 2022).At OneValley, we are committed to fighting systemic inequality through democratizing and decentralizing access to resources and support networks so that together we build an innovation community with diversity, love, and action at its core. We are committed to creating a diverse and inclusive environment and are proud to be an equal opportunity employer. We welcome and encourage all applicants without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.Key ResponsibilitiesImplement structured corporate innovation programs focused on new digital product development and engagement with the startup community.Work with Managers, Directors, and CPO to continuously improve program structure and resources via feedback from participants, mentors and the community.Manage the program calendar and day-to-day operations on engagementsManage 3rd party contractors and vendors being used for programsManage sourcing, research and analysis of startups on behalf of various partnersAssist in high-level strategic decision making.Assist in other strategic initiatives and develop meaningful relationships across the OneValley organizationSkills Knowledge and ExpertiseRequired1+ year of experience developing and executing successful programs/projects in fast paced, growth environmentsExperience creating and administering contentEntrepreneurial interest and passion for the startup spaceExcellent focus on attention to detail and quality of outputProven track record of getting things done with short timelines and in dynamic teams/environmentsStrong verbal and written communication skills and ability to manage communication cross functionally for the programExcited to work in a dynamic and fluid environmentComfortable with a minimal amount of direction but high expectationsWorks well in both team and self-directed work environmentsFits the OneValley culture (passionate, innovative, flexible, get-things-done attitude)Preferred3+ years experience developing and executing successful programs/projects in fast paced, growth environmentsBachelor’s degree from an accredited college or universityCompensation and BenefitsThe successful candidate will be based in our headquarters, the stunning Innovation Center co-working space in San Mateo which offers a wide range of amenities and free drinks and snacks. (NB: We are currently operating as optional in-office, with a hybrid return to work expected in the near future).Compensation for the role includes:Base salary range of $100,000 - $125,000, dependent on experience.10% bonus target (performance based)Employee optionsOneValley also offers the following employee benefits:Unlimited Vacation - We encourage all employees to take at least three weeks. Good colleagues don't let each other burn out!15 Company Holidays - We observe all federal holidays, plus three floating days for events of personal, cultural or religious importance - whether you want to use them for Eid Al Adha, Diwali, Yom Kippur, or your birthday!Employee Options - We're building something great together, and our employees deserve to share in our success.Stay Healthy Physically and Mentally - We cover 90% of your premiums for medical, vision and dental, and 80% for your dependents. We offer a Flexible Spending Account (FSA) Plan for any extra out of pocket costs. We also have an Employee Assistance Program with 24-hour free, confidential counseling and referral services for you and your family members, and our People Ops team host guided meditation sessions!Take Parental Leave - We give new parents (biological, adoptive, and foster) 12 weeks of paid time away.Save for Retirement - with our employee 401(k) PlanGrow yourself and your Career - All employees receive a personal learning and development budget in addition to standard trainings, lunch and learns, teambuilding and retreats.Space to Innovate and Ideate - As well as countless opportunities to interact with our thousands of inspiring startup members, you'll be able to participate in the internal Omnipreneurship Awards, \"a space for those with innovative ideas and solutions to contribute to building a more sustainable and prosperous world.\"We've got you covered for anything unexpected - All employees receive basic life insurance, AD&D and Disability InsuranceAbout OneValleyOneValley is a global entrepreneurship platform that supports entrepreneurs, accelerates startups, and empowers organizations across the world that foster innovation communities. OneValley directly supports over 58,000 members and indirectly another 200,000+ through our B2B partnerships and platforms, powered by our online platform Passport, the world’s most comprehensive innovation platform connecting Silicon Valley to the World, and the World to Silicon Valley.Our team is headquartered in our Innovation Center in San Mateo, which serves as a world-class coworking space for start ups. In July 2021 we launched our Pittsburgh Innovation Center inside the newly redeveloped Roundhouse at Hazelwood Green.Job Type: Full-timePay: $100,000.00 - $125,000.00 per yearBenefits:401(k)Dental insuranceFlexible spending accountHealth insuranceLife insurancePaid time offVision insuranceSchedule:Monday to FridayCOVID-19 considerations:All OneValley employees at our San Mateo location are currently allowed to work from home, with optional in office available for those who would like to work from our Innovation Center. We envision returning to a hybrid work arrangement in future.Work Location: One location", "url": "https://www.indeed.com/viewjob?cmp=OneValley&t=Associate+Product+Manager&jk=72b4538808e85c75&vjs=3"},
{"job_title": "newTransportation Security Specialist (Regional Operations Cent...", "summary": "In cities across the country, you would secure airports, seaports, railroads, highways, and/or public transit systems, thus protecting America's transportation…", "company": "TSA (Transportation Security Administration)", "location": "Honolulu, HI", "job_description": "Securing Travel, Protecting People - At the Transportation Security Administration, you will serve in a high-stakes environment to safeguard the American way of life. In cities across the country, you would secure airports, seaports, railroads, highways, and/or public transit systems, thus protecting America's transportation infrastructure and ensuring freedom of movement for people and commerce. For additional information about our agency please: Click Here\nRequirements\nConditions of Employment\nYou must complete a favorable Background Investigation (BI).\nYou must possess U.S. Citizenship or be a U.S. National.\nYou must have reached the minimum age (18) at the time of application.\nSelective Service registration is required.\nSee additional \"Conditions of Employment\" and \"Other Information\" section\nMust pass pre-employment drug screening AND random drug/alcohol testing.\nYou must be able to obtain and maintain a Secret Clearance.", "url": "https://www.indeed.com/viewjob?jk=fed20b28b62383ac&from=serp&vjs=3"},
{"job_title": "newOperation Manager", "summary": "Oversee pre-construction workflow and outcomes from Estimating, Design, and Selections.\nSupervise Superintendents and communicate regularly with Construction…", "company": "Green Square Design | Construct Inc.", "location": "Indianapolis, IN", "job_description": "Green Square DesignOperations ManagerHave you ever gotten out of bed in the middle of the night to write down a new idea?Do you find yourself constantly thinking about how to make something … better?Do you find value in being acknowledged as a professional in your field?Then we’d really like to have you apply for the open Operations Manager position here at Green Square, a successful custom builder and general contractor with amazing clients located in downtown Indianapolis. We are experiencing exponential growth and need someone detail-oriented to coordinate our information, departments, projects, and personnel full-time. If you are a collaborative and conscientious self-starter looking for great pay, job satisfaction, and a desire to work for a growing company with a great culture, then apply now!Here are the main things that you’ll be responsible for: Oversee pre-construction workflow and outcomes from Estimating, Design, and SelectionsSupervise Superintendents and communicate regularly with Construction ManagersVendor, Subcontractor, and Supplier relationshipsMaintain project progress and adherence to schedule and budgetWarranty itemsFacilitate weekly leadership team meetings and attend hand-off meetingsAssist with change orders, subcontractor coordination, material deliveries, invoices, purchase ordersWe prefer that you are: Experienced as a leader or manager of a comparable organization (7-9 years)Experienced in using project management software (scheduling, estimating, budgeting, etc.)Educated in Business, Finance, Construction Management or related field (Degree preferred)Proficient in computer and mobile device use including email and typical office softwareAnd it will help a lot if you are: A Team oriented player who strives to make everyone around him/her betterAble to accurately assess a situation and creatively solve problems in a manner that balances client needs, current schedules and project/company profitabilityAble to communicate with clarity and respect with clients, subcontractors, vendors and colleaguesAble to understand architectural drawings and specifications and communicate them to othersKnowledgeable in the Traction/EOS systemsBase Pay plus Performance bonuses are estimated at $80,000.00 - $100,000.00 per year with Paid Time Off, Company phone, Retirement Plan, holiday pay & more.Job Type: Full-timePay: $85,000.00 - $100,000.00 per yearBenefits:Paid time offRetirement planWork Location: Multiple Locations", "url": "https://www.indeed.com/viewjob?cmp=Green-Square-Design-%7C-Construct-Inc.&t=Operation+Manager&jk=946dbd7e4e664f90&vjs=3"},
{"job_title": "newHuman Resources Associate (8 hour shift)", "summary": "High school or equivalent (Preferred).\nHigh school or equivalent (Preferred).\nAdvanced Outlook and Excel skills.\nIdentifying issues and addressing accordingly.", "company": "Forrest Solutions Group", "location": "Remote in Angels City, CA", "job_description": "Requirements: Advanced Outlook and Excel skills.Able to manage high volumes of emails and requests.Troubleshooting forms in Excel.Identifying issues and addressing accordingly.Organization skills, with an ability to stay focused on assigned tasks.Responsibilities: Assist HR with all employee movement (onboarding, offboarding, promotions, etc.)Retrieve information from hiring managers to properly process the EUN (Employee Update Notification) forms.Fill out the Excel form and submit to a distribution list, following a specific formatting protocol.Process urgent EUN requests and follow up with the direct managers on updates.Compile, verify accuracy and sort information according to prioritiesReview data for deficiencies or errors, correct any incompatibilities and check revisions.Manage expectations with hiring managers and HR.Speak with IT to coordinate equipment shipping for new hires and equipment retrieval for terminated employees.Coordinate with Facilities Operations for new hires starting on-site for office access and seat assignments.Store files and confirmations for audit purposes.Comply with data integrity and security policies.Keep information confidential.Additional details: The position will have a dual reporting structure with Forrest and the client.The position offers flexibility to work remote after required trainings are completed in officeJob Type: Full-timePay: $22.00 per hourSchedule:8 hour shiftMonday to FridayApplication Question(s):Are you able to work at a site that requires vaccination against Covid 19?Education:High school or equivalent (Preferred)Experience:Leadership: 1 year (Preferred)Shift availability:Day Shift (Required)Work Location: One locationJob Type: Full-timePay: $25.00 - $31.00 per hourBenefits:401(k)Dental insuranceHealth insurancePaid time offVision insuranceSchedule:8 hour shiftDay shiftMonday to FridaySupplemental Pay:Bonus payEducation:High school or equivalent (Preferred)Experience:Human Resources Occupations: 1 year (Preferred)Leadership: 1 year (Preferred)Work Location: One location", "url": "https://www.indeed.com/viewjob?cmp=Forrest-Solutions-Group&t=Human+Resource+Associate&jk=eb523d53ede62ea9&vjs=3"},
{"job_title": "newLISKE Clerical Assistant - PART TIME", "summary": "The successful candidate will be involved remotely in all areas of the day-to-day operations, and report remotely to the Operations Manager.", "company": "LISKE Accident & Injury Experts", "location": "Remote", "job_description": "*This position can be performed remotely. However, you will be required to do minor mailing/tasks in Buffalo. You may receive your company training via Zoom/Teams meetings (or similar) and Remote Desktop training modules.The successful candidate will be involved remotely in all areas of the day-to-day operations, and report remotely to the Operations Manager.Details: Starting entry-level position; part-time. Starting Compensation: $20/hour.LISKE Clerical Assistant General Duties:Adhering to LISKE-trained standard operating procedures [SOPs] for all matters.Being the first point of contact for the customer and LISKE Expert on all LISKE files. This includes daily email and phone communication.Scheduling examinations, telecoms, meetings between LISKE Team Experts and the customers. Tracking accordingly. Scheduling next steps on all files and tasks.Receiving file material, and indexing and tracking it for the LISKE Team Expert.Responding to new file inquiries, and opening files in the office.Document review and editing (spelling, grammar, etc.).Preparing mail as necessary.Minor mailing/tasks in Buffalo.Copying and scanning documents.Supporting Business Development.Internet searches.The successful candidate must demonstrate the following:Candidate must share the LISKE Team Core Values [Integrity, Compliance, Humble, Respect, Value Creation].Strong computer skills.Microsoft (MS) Office knowledge and competency – Microsoft Exchange (email), Outlook, Word, PowerPoint and Excel, Microsoft 365.Ability to multi-task and adapt to changing priorities.Proper phone and email etiquette when communicating with customers.Exceptional written and verbal communication.Task and detail orientated.Strong interpersonal skills.Outstanding organization skills.Positive attitude/the ability to solve problems with common sense/critical thinking.Demonstrated commitment to privacy and professionalism.To apply, please follow the instructions on our website: https://www.liskeforensics.com/jobs-and-careersJob Type: Part-timeSalary: Up to $20.00 per hourSchedule:Day shiftWork Location: Remote", "url": "https://www.indeed.com/viewjob?cmp=LISKE-Accident-%26-Injury-Experts&t=Liske+Clerical+Assistant&jk=067cb8e4deffaca5&vjs=3"},
{"job_title": "newPeople Operations Associate", "summary": "Coordinating all new hire logistics.\nScheduling the new hire onboarding experience.\nAssisting with the logistics of team events and offsites.", "company": "Jebbit", "location": "Remote in Boston, MA", "job_description": "At Jebbit, we know our teammates are our most valuable asset. We are hiring a* People Operations Associate* to help us create the superb employee experience they deserve. This is your entry level opportunity to break into a SaaS startup during a pivotal growth chapter. You will learn how to guide every element of the employee journey, from onboarding through employee departures. Reporting into Jebbit's People Operations Manager, you'll manage many processes that are key to our employees having a seamless experience and will be a key resource for all employees. You will need to be highly adaptive, as this is a true generalist role providing hands-on support in an ever changing workplace. This role will be a blend of in-office and remote work.What you will be responsible for: Coordinating all new hire logisticsScheduling the new hire onboarding experienceCoordinating employee offboardingAssisting with the logistics of team events and offsitesManaging the effectiveness of our physical office spaceManaging the company event calendar & associated tasksServing as an ambassador of Jebbit's culture with prospective hires and current teammates alikeLeaning into other opportunities for growth within the organization that most excite you!Your qualifications: You're a recent college graduate looking to launch a career in People Operations (or an established professional looking to pivot into a new industry at the entry level).You're resident of the Boston areaYou're open to a blended format of in-office and remote workPeople describe you as…An avid learner who takes initiativeA strong team player, who can also be successful working autonomouslyEmotionally intelligent and a natural relationship builderHighly coachable and comfortable receiving and giving constructive feedbackA strong written and verbal communicatorWildly dependable with note-worthy followthroughA talented project manager who loves working in realms both operational and strategicSalary & Benefits: EquityMedical, dental, and vision insuranceFlexible vacation policyTwo quarterly mental health daysWellness stipend12 weeks paid parental leaveJebbit is all about Culture Add, not Culture Fit. We know our success depends on us involving as many different perspectives in our problem solving process as we can. Our team is made stronger by what makes you unique, so we hope you'll bring your whole self to the job.Jebbit is an equal opportunity employer and values diversity amongst our team. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.No Recruiters pleaseJob Type: Full-time", "url": "https://www.indeed.com/viewjob?cmp=Jebbit&t=People+Operation+Associate&jk=defd3d769c4a3d32&vjs=3"},
{"job_title": "Picking Associate", "summary": "This position is responsible for picking orders per customer request.\nFull-time *1st shift* positions are available.\nImmediate: Eligible for Paid holidays.", "company": "Cash-Wa Distributing", "location": "New York, NY", "job_description": "If you want a job that keeps you busy and moving, then this is it! This position is responsible for picking orders per customer request. These positions are perfect for someone who pays attention to detail and can move quickly through each order. Full-time 1st shift positions are available.Cash-Wa Distributing is a strong, stable and financially smart company. As one of the largest privately-owned food service distributors in the Midwest our family owned company has a history of building strong relationships. If you are interested in joining an innovative, supportive, values driven company, we invite you to consider a career with Cash-Wa Distributing!Cold Storage WarehouseDay shift starts at 7am, starting wage is $18 for job rated heavy level.Job consists of repetitive lifting of 80-90% of the shift.Heavy lifting jobs generally lift 10-50 lbs, on rare occasions lifting up to 100 lbs.Benefits:Immediate: Eligible for Paid holidays30 days: Discounted product ratesJob Type: Full-timePay: $18.00 - $20.00 per hourBenefits:401(k)Dental insuranceHealth insurancePaid time offVision insuranceSchedule:8 hour shiftMonday to FridaySupplemental Pay:Bonus payLanguage:English (Preferred)Shift availability:Day Shift (Preferred)Work Location: One location", "url": "https://www.indeed.com/viewjob?cmp=Cash--Wa-Distributing&t=Picking+Associate&jk=03e6577e18372901&vjs=3"},
{"job_title": "Global CSR, Social Impact Associate, Americas", "summary": "Implement Social Impact partnerships or programs across Americas (approximately 80% of your time) and provide expertise for key Global initiatives across…", "company": "TikTok", "location": "Los Angeles, CA+2 locations", "job_description": "TikTok is the leading destination for short-form mobile video. Our mission is to inspire creativity and bring joy. TikTok has global offices including Los Angeles, New York, London, Paris, Berlin, Dubai, Singapore, Jakarta, Seoul and Tokyo.\n\nAbout the Team:\nThe Social Impact Associate, Americas will be an integral member of the Global Corporate Social Responsibility (CSR) team at TikTok. This organization designs and implements the global sustainability and social impact strategy, working collaboratively across disciplines to bring the right resources, expertise, and experience to each aspect of Environmental Social Governance (ESG). Our team is growing and is seeking experienced, bright professionals to join us. In this role, you will be driving our Social Impact strategy and programs in Americas, in addition to supporting key Global Social Impact programs over time. The following describes the responsibilities and requirements.\n\nResponsibilities:\n\nImplement Social Impact partnerships or programs across Americas (approximately 80% of your time) and provide expertise for key Global initiatives across sustainability & social impact (approximately 20% of your time);\nSupport organizational vetting, partnerships design, and outcome measurement, ensuring all local and regional efforts roll up into our global goals;\nEngage with key external stakeholders including non-governmental organizations (NGOs) and community based organizations (CBOs) that support the company's social impact goals;\nWork cross-functionally with Global Public Policy, Operations, Product Teams, Communications, and Marketing, to prepare, deliver, and amplify key partnerships and programs.\nSupport regional or global \"TikTokforGood\" in-app social content campaigns, connecting these efforts to our overall sustainability & social impact and goals;\nServe as CSR resource for emergency/disaster response within region as needed, based on internal plan and processes, with pre-vetted NGO and CBO response partner organizations;\nRepresent CSR as an internal consultant and resource for other teams regarding our CSR strategy, initiatives, compliance and external reporting requirements, and guidance on NGO vetting and selection.\nBachelor’s degree or equivalent.\n5+ years experience in Social Responsibility programs.\nExperience designing programs for a global company and workforce.\nKnowledge of NGOs, the SDGs, social impact and corporate sustainability industry best practices.\nStrong analytical skills with a high degree of attention to detail.\nDemonstrated ability to develop effective internal and external stakeholder networks.\nSelf-motivated individual that excels in a fast-paced environment.\n\nTikTok is committed to creating an inclusive space where employees are valued for their skills, experiences, and unique perspectives. Our platform connects people from across the globe and so does our workplace. At TikTok, our mission is to inspire creativity and bring joy. To achieve that goal, we are committed to celebrating our diverse voices and to creating an environment that reflects the many communities we reach. We believe individuals shouldn't be disadvantaged because of their background or identity, but instead should be considered based on their strengths and experience. We are passionate about this and hope you are too.", "url": "https://www.indeed.com/viewjob?jk=ff6d7a6906ff6afa&from=serp&vjs=3"},
{"job_title": "newIT Compliance Analyst", "summary": "We are a drug free workplace and we comply with Federal Drug Free Workplace Act and Department of Transportation regulations.\nUp to 21 Vacation Sick Time Days.", "company": "NW Natural", "location": "Portland, OR", "job_description": "Non-Union Position\nIS Security & Analytics; Portland , Oregon (US-OR)\nRegular FT\nPosting # 3672\n\nThe Role:\nYou’ll be a member of the IT&S Compliance Team and will work closely with IT&S Security and other technical, non-technical teams as well as internal or external auditors. The primary purpose of this position is to ensure Information Technology & Services (IT&S) department is in compliance with state and federal regulations by creating, monitoring, evaluating, and reporting on the effectiveness of operational controls within Information Technology (IT) and Industrial Control System (ICS) environments. Day to Day:\n\nEnsure company complies with all local, state and federal requirements (SOX, TSA pipeline security directives, etc.)\nDevelop and periodically review Operational controls related to compliance with federal and state pipeline security regulations.\nDevelop, maintain, and collaborate on compliance documentation. This requires coordination with other departments and contractors for the collection of compliance information.\nPrepare for and assist with internal and external audits, periodically test operational controls, and document audit findings.\nReview internal and external audit findings and prepare responses and recommendations to internal procedures and/or operational controls.\nImplement the recommendations upon management approval.\nCommunicate best practices and lessons learned to Operations and Contractors.\nCoordinate with various departments, and if necessary internal and external auditors, to ensure that requirements are met, and appropriate changes are made as needed. Come on your first day with:\n\nMinimum of two years' IT, industrial control systems, or information security experience, additional years’ experience required for levels 2 or 3.\nBachelor's degree or equivalent additional work experience\nITIL Foundations certified or successful completion within 90 days of starting\n\nTechnical Competency\nUnderstanding of IT or ICS systems, applications, networks and databases.\nKnowledge of Operational Controls.\nUnderstanding of assessing and designing internal and security controls.\nExperience in developing and submitting audit and compliance reports to governing bodies, legal entities, and/or external authorities.\nKnowledge of risk management practices and security governance programs.\nExcellent communication skills (both written and oral).\n\nOccupational Personality\nYou’ll interact with NW Natural's personnel at various levels and across business units to understand regulatory requirements.\nStrong communication and facilitation skills will be key to your success. Excellent written and verbal communication skills will help you succeed, as will your ability to take raw data and generate compliance report for various levels of management.\nLeadership abilities with the capability to direct other technical staff on security initiatives and guide team members\nYou’ll get to work with minimal supervision. Strong analytical skills to analyze compliance requirements and relate them to appropriate operational controls.\nYour ability to manage expectations appropriately will help and build long-term relationships.\nYou’ll remain current with industry compliance best practices.\n\nWhat we offer:\nWork life balance\nUp to 21 Vacation Sick Time Days\n11 paid holiday which includes 3 floating holidays.\nFlexible work arrangements\n3 weeks paid parental leave\n1500 Sq foot exercise facility, onsite yoga classes, massage, and secure bike room.\nFinancial\nMeaningful Annual Incentive Bonus Opportunity in addition to base salary\nGenerous 401K company contribution and match.\n15% Discount on ESPP\nUp to $5250 a year in tuition reimbursement\nDiscounts\n20% off natural gas service\nUp to 30% discount at NW Natural Appliance Center\nTRI Met Pass for all HQ employees\nGenerous discounts with Verizon & AT&T Wireless\n\nBase salary range: $65,600.00 - $90,800.00 , Level 2 $77,900.00 to $107,850.00 or Level 3 $84,950.00 to $117,600.00 per year, depending on qualifications\n\nhttps://www.nwnatural.com/about-us/the-company/careers\n\nDeadline: 2/15/2022\n\nAll applications must be submitted through NW Natural’s Electronic Application System. Resumes submitted via email, fax or mail will not be accepted in lieu of an electronic application.\n\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, sexual orientation, gender identity, veteran status, disability or any federal, state or locally protected class.\n\nWe are a drug free workplace and we comply with Federal Drug Free Workplace Act and Department of Transportation regulations. Pre-employment drug tests are part of the hiring process and apply to all positions.\n\nNW Natural does not accept unsolicited submissions or assistance from search firms for posted positions. Resumes submitted by search firms working under a valid and current written contract with NW Natural valid written Statement of Work in place for this position from NW Natural HR/Employment will be deemed the sole property of NW Natural. No fee will be paid in the event the candidate is hired by NW Natural as a result of the referral or through other means.", "url": "https://www.indeed.com/viewjob?jk=2f838dd2452966e1&from=serp&vjs=3"}