[
{"job_title": "new2022 Virtual Summer Associate - Operations, ACPNY", "summary": "In collaboration with cross functional groups, (strategy, clinical, nursing, human resources, and IT) the operations group plans, implements and evaluates…", "company": "EmblemHealth", "location": "New York, NY", "job_description": "2022 Virtual Summer Associate Program – Operations, ACPNY\nEmblemHealth is a family of health and wellness companies that believes in our mission to create healthier futures for our customers, patients, and communities. Everything we do is guided by our core values:\n\nEmpower\nWe believe in acting as proactive self-starters and enabling our colleagues to succeed.\nDeliver\nWe believe in achieving our goals and taking accountability for our actions.\nDo It Together\nWe believe in caring for our customers, patients, and one another, while valuing diversity, equity, and inclusion.\nAs one of the nation’s largest not-for-profit health insurers, EmblemHealth serves more than three million people in the New York tristate area. We are anchored by our 80-year-old not-for-profit roots while remaining change agents fueled by innovation and excellence to create better health outcomes.\n\nOur family of companies also includes ConnectiCare, one of Connecticut’s leading health plans; AdvantageCare Physicians, a primary and specialty medical group; and WellSpark, a digital wellness company.\n\nWe are proud that our workforce is as diverse as the communities we serve, and we are intentional about our inclusive practices for our organization.\nIf you want to be a part of a bigger story, if you want to make a difference in people lives and the communities around you, if you think healthcare matters to every one of us – Join us!\nOperations\nThe Operations team is responsible for managing and leading the health care delivery processes in the medical offices across five regions including Manhattan, Staten Island, Brooklyn, Queens, and Long Island. Operations leaders drive change, solve complex problems, and create dynamic new approaches that will improve the value, quality, and cost of patient care. In collaboration with cross functional groups, (strategy, clinical, nursing, human resources, and IT) the operations group plans, implements and evaluates processes and workflows designed to optimize care delivery and create patient service excellence.\n\nSummer Associate Program\nThe Summer Associate Program provides opportunity for students to work alongside of senior leaders who are committed to growing, developing, and empowering the next generation of healthcare leaders. The Operations Summer Associate will work on special projects designed by the business and participate in the following career development activities:\nIntroduction to the Health Care IndustrySenior Leadership Networking LunchLearning & Development SeriesFinal Project Presentations\nProgram Details\n9-week paid program; Monday, June 6, 2022 to Friday, August 5, 2022Full-time; 40-hours per weekHourly rate of $30 per hourProject-driven\nWe are looking for candidates who are -\nPursing an undergraduate or graduate degree in the healthcare Industry; rising undergraduate juniors/seniors, and first-year graduate students strongly preferredStrong academic performance, minimum GPA of 3.0 or above preferredAnalytical, collaborative, and strong communication skillsProject management", "url": "https://www.indeed.com/viewjob?jk=d1d971809132aa8c&from=serp&vjs=3"},
{"job_title": "newExecutive Assistant, CEO", "summary": "Oversee daily operations through collaboration with CEO and senior management, performing an array of administrative tasks from handling schedules, attending…", "company": "Tinder", "location": "Hybrid remote in New York, NY", "job_description": "Tinder started on a college campus in 2012 and broke down the barriers - geographic, historic, cultural - that limit who we meet. We went from 1 swipe to 1 billion swipes a day, in 2 years! No technology grows that fast unless it fills a powerful, unmet human need. Today, Tinder is the world’s most popular app for meeting new people. The app is available in 190 countries, and 40+ languages, it’s been downloaded more than 450 million times and led to 60 billion matches, and is the highest-grossing non-gaming app globally. There’s never been a more exciting time to be at Tinder. We are on a course to redefine the way young people meet and connect today, if you would like to be a part of that, keep reading.\nThe Role:\nWe’re looking for an Executive Assistant to join our team! Reporting to our CEO, you will provide outstanding daily administrative support and get energized by working in a fast-paced environment. This is a perfect role for someone who takes initiative, is intuitive, and thinks strategically. Although this position may offer some remote work flexibility, this role will be based in our New York office and will require travel to our San Francisco and Los Angeles offices as needed.\nIn addition to managing the CEO’s complex calendar and schedule, you will work with cross-functional global leaders and provide high caliber administrative support that will help us execute company projects and goals. Your creativity, passion, and organizational skills will be critical in supporting the CEO team meetings and special events. We are looking for someone to help build and lead organizational culture in hybrid and remote working environments across the US and globally.\nAdministrative Support\nOversee daily operations through collaboration with CEO and senior management, performing an array of administrative tasks from handling schedules, attending meetings and calls, maintaining team communications, and ensure execution of action items and follow-ups\nBuild presentations, create meeting agendas, maintain meeting notes, and optimize meetings for different time zones to support our distributed international team\nServe as liaison between staff, executives, and senior leaders, regarding company climate, employee well-being, project updates, proposals, and planning\nArrange domestic and international travel and provide ongoing support as needed\nAssist the HR department with new hires, collect documentation, help facilitate onboarding, and collaborate to address and resolve all employee concerns\nPrioritize, multi-task, and operate in a continuously evolving environment\nHandle projects and communication by providing status updates and ensuring that cross-functional partners are included in meetings and communications\nBuild and run an organized department library of resources and documentation and identify any gaps with team members\nCollaborate with workplace experience for team space planning & strategy\nTeam Morale, Events and Celebrations\nPartner with cross functional teams to plan and execute meetings and offsites\nIdentify the team’s learning and training opportunities, and partner with our Talent Development team to work on resources or communicate training needs\nWork closely with the workplace experience and HR teams to coordinate birthdays and landmark celebrations\nManage team swag\nComplete other duties as assigned\nWhat we’re looking for:\n3+ years of work experience supporting at the senior executive level\nExperience supporting hybrid and global teams\nFlexibility beyond standard office hours\nExperience with Google-Suite (Gmail, Calendar, Docs, Slides, etc.)\nAbility to adapt to changing priorities with excellent time management skills\nPositive relationship management skills and the ability to effectively collaborate with a diverse set of partners\nDemonstrate discretion and integrity when working on confidential business and organizational issues\nStrong verbal and written communication skills\nDemonstrated presentation skills, with an ability to express high-level concepts efficiently and effectively to a wide range of audiences\nStrong project management skills\nBased on Tinder’s vaccination policy and considering this position is a crucial in-office support function, the successful candidate is required to be fully-vaccinated against Covid-19 with one of the United States FDA-approved vaccine options. If an exemption and/or accommodation to our vaccination policy is requested, a member of the human resources department will be available to begin the interactive accommodation process.\n\nAt Tinder, we don’t just accept difference — we celebrate it, we support it, and we thrive on it for the benefit of our employees, our product, and our community. We strive to make our workplace an inclusive and diverse environment, giving people from all walks of life the opportunity to have a voice. We champion and encourage those who bring different perspectives, ideas, and creativity to join our team dedicated to bringing people together across the globe. Tinder is proud to be an equal opportunity workplace where we welcome all people regardless of sex, gender identity, race, ethnicity, disability, or other lived experience.", "url": "https://www.indeed.com/viewjob?jk=fd56deba91342b10&from=serp&vjs=3"},
{"job_title": "Web Order Processor", "summary": "Under immediate guidance, an *Web Order Processor* will help to process and finalize orders that were placed independently by customers online.", "company": "Discount Tire", "location": "Remote in Phoenix, AZ", "job_description": "Here at Discount Tire, we celebrate the spirit of our people with extraordinary pride and enthusiasm. Our business has been growing for more than 60 years and now is the best time in our history to join us. We are opening more locations every year and we are always looking for qualified individuals to join us in our growth. We are a company that promotes from within, both in our retail and corporate operations.Under immediate guidance, an Web Order Processor will help to process and finalize orders that were placed independently by customers online. Our contact center, located in North Phoenix, facilitates interactions with customers through both inbound calls, e-mails, and web orders. If you are a hardworking and self-motivated individual that values relationships, this is the career for you! Discount Tire Direct combines outstanding earning potential and great benefits with a fun and exciting workplace.NO AUTOMOTIVE EXPERIENCE REQUIRED! WE PAY YOU WHILE WE TRAIN YOU!Essential Duties and Responsibilities: Reviews orders for product requirements such as sizing, fitment, and safety standards. Also, ensures product orders align with industry and company safety standards.Identifies and marks orders that cannot be filled due to fitment, fraud, inventory, and any other issue preventing the order from being completed. Informs customer electronically and escalates order exceptions to eBusiness Team for follow up and resolution.Verifies product inventory status such as product availability, stock level, location, and stock replenishment schedule.Support the Discount Tire Direct Sales team by assisting with drop ship orders, special orders, and processing orders.Finalizes orders with proper distribution center and determines best method of product delivery for the customer, including, but not limited to, special orders, split shipments, and drop shipments.Processes credit card, PayPal, and Synchrony Bank Discount Tire Credit Card payments for online orders. Notifies customers electronically if payment is declined and/or escalates to eBusiness Apprentice for resolution.Qualifications: Customer service skills, including the ability to manage and respond to different customer situations while maintaining a positive and friendly attitude are essential.Basic level computer experience, including skills in Microsoft Word and Excel, are necessary.The ability to work successfully both independently and within a team is necessary.The ability to work efficiently under pressure, accurately, meet deadlines, present a professional demeanor and work well independently is essential.In addition, organizational and problem-solving skills, a can-do attitude, and the ability to adjust to changing requirements are essential.Maintaining confidentiality, treating others with respect, and upholding company values are key attributes.Educational Requirements: This position requires a high school diploma or GED equivalent.Work RemotelyYesJob Type: Part-timePay: From $14.70 per hourSchedule:Day shiftMonday to FridayWork Location: One location", "url": "https://www.indeed.com/viewjob?cmp=Discount-Tire&t=Web+Order+Processor&jk=942862067683aa41&vjs=3"},
{"job_title": "Packaging Technician (1st shift) - $20-$25.50/hour – $1,500...", "summary": "Working knowledge of mechanical packaging equipment, a plus.\nOur packaging technicians apply a disciplined packaging and barcoding service to specific…", "company": "Safecor Health, LLC", "location": "Woburn, MA 01801+3 locations", "job_description": "$1,500 SIGN-ON BONUSES OFFERED!\nPAY RATE: $20-$25.50/hour based on experience with the opportunity to be promoted from within\nSHIFT: Full-time first shift (8am-4:30pm) Monday through Friday\nAbout Safecor Health\nSafecor Health is an industry leader and essential employer committed to helping hospitals ensure quality and patient safety. We do this by providing unit-dose medication packaging services for hospital and health system pharmacies, pharmaceutical manufacturers, and digital pharmacy companies. By taking away the challenging and time-consuming tasks of repackaging, Safecor Health allows hospital pharmacy staff to refocus their attention back to what really matters: our loved ones.\nThe role of the Packaging Technician\nOur packaging technicians apply a disciplined packaging and barcoding service to specific medications in our production facilities. This important work we do helps our hospital customers deliver safe, high-quality medication and care to their patients.\nYou will be responsible for repackaging all unit-dose medications as required. This includes operating our packaging equipment to repackage oral solids into unit-dose, and filling cups, vials, and syringes as specified. The packaging technician position is also responsible for maintaining the packaging equipment for daily use, including cleaning and general equipment troubleshooting.\nWhat you bring to the table:\nIf you're looking for stability and longevity with the opportunity to grow your career, you could be a great fit for our diverse team of packaging technicians.\nStrong attention to detail with a focus on quality\nWorking knowledge of computer hardware (PC Windows)\nWorking knowledge of mechanical packaging equipment, a plus\nGood organizational skills - accurate, reliable, and efficient\nHigh school diploma or equivalent required\nPrevious experience in hospital pharmacy or health care industry preferred\nPharmacy Technician Certification a plus\nWhat your day-to-day will look like:\nSafecor Health is a fast-paced, high-energy workplace with ample opportunities to learn new skills each day.\nPerform all unit-dose medication packaging and complete daily orders as needed.\nMaintain supplies needed in the workstation to fulfill services.\nPerform daily preventative maintenance and necessary routine adjustments on the packaging equipment.\nGenerate accurate packaging labels according to requirements regarding verification procedures as specified in our standard operating procedures.\nFollow standard operating procedures in accordance with current Good Manufacturing Practices (cGMP) and other regulatory standards.\nHow we take care of you and your family:\nThe meaningful work you do helps our customers support their patients, so we'll work hard to support you.\n$1,500 sign-on bonus!\nClean and safe work environment\nMedical, dental, and vision insurance\nCompany-paid life insurance\nPaid time off (PTO)\nEarned sick time (EST)\nHoliday pay\nWeekly pay\n401k\nOpportunities for internal promotion\nMonthly employee appreciation meals", "url": "https://www.indeed.com/viewjob?jk=0d4f611ef94ccf54&q=Technician&l=USA&from=web&advn=6359985025828115&adid=311338277&ad=-6NYlbfkN0CSc9FKj-X37TyRYNM2ms2h__eQS6H9NU5BV_0Fq7BFfqOqw_M_yy-MLPCViFhwCVw6aOSoYw2wDZydkX4iO7jXA4pzj-7FZXtH40RGwxxdh9Pt0KaJScDyhVDdFwbXebZ_YeQ-OxDQZxj_vzF16rLBdvvrlSNfPhsKBBLdMIpNO7YPb9GUlhQL4pfVg0QZ2wKVMTQSlJw8ESmPNqVat5-gLg1IofR_jd83a-Zx1gfgAJMXxCmC1JeYLraZgNJ7Dmn19CcZnHTQ1-SO1FZsVhCg0KCPx3_blSckyP5Krg4_toYCLCnYPWVIZFlbE_F0UcLoExljSMJQ5uGA9qAoFTEkotJRMBL_aMokeaXbLDTUXVmjc-DdoQ5lMO9t32R338I%3D&sjdu=3j2yV1Cyo1TUbNt3be92UkyflQrHHfeJU98511-PjyrhSc9brRpZZGHzwmbsaQRwmt1diJerBLFrqRTD6u1XJoc4PFSiHNwX9R9B_QlLbPo&acatk=1frep1ltat4ap800&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "Strategy and Operations Lead", "summary": "2 years of experience in business administration, quantitative analysis, and operations.\nExperience in management consulting, corporate development, finance…", "company": "Google", "location": "Hybrid remote in New York, NY+27 locations", "job_description": "Note: Google’s hybrid workplace includes remote and in-office roles. By applying to this position you will have an opportunity to share your preferred working location from the following:\n\nIn-office locations: Sunnyvale, CA, USA; New York, NY, USA.\nRemote location(s): United States.\nMinimum qualifications:\n\n2 years of experience in business administration, quantitative analysis, and operations\nExperience in SQL and other reporting tools and techniques\nExperience in statistics and executive-level dashboarding of data, and in process improvement\nExperience with building solutions for enterprise-level processes (e.g., finance, planning and budgeting, business intelligence, operations, etc.)\nPreferred qualifications:\n\nExperience in management consulting, corporate development, finance/investment banking, or operations\nExperience leading complex operational and strategic initiatives across various organizations\nExperience with executive-level communication and influencing successfully across levels and organizational boundaries\nDistinctive problem solving and analysis skills, combined with impeccable business judgment\nExceptional at converting unshaped issues into crisp, concrete challenges to be solved\nAbout the job\nGoogle Cloud enables digital transformations for organizations of all sizes, operating in all industries and geographies. The Chief of Staff organization within Business Platform and Cloud Operations (BP&CO) supports Google Cloud growth, working with Google Cloud business leaders to identify strategic priorities and design and implement business processes to support them.\nIn this role, you will lead the strategy and execution of operational projects such as designing and implementing a headcount management process, executing the organization’s talent strategy, executive and project reporting, and strategic planning. You'll focus on data collection, draw insights from analysis, and then develop compelling, synthesized recommendations. You will be comfortable with structuring complicated issues and finding creative solutions to business challenges. You'll work in a rapidly changing environment and demonstrate problem-solving leadership with limited oversight.\nYou will be highly strategic, comfortable with ambiguity, and an exceptional communicator with a bias for action and results. You'll be an agile and creative problem solver, and an outstanding cross-functional and executive-level relationship builder.\nGoogle Cloud provides organizations with leading infrastructure, platform capabilities and industry solutions. We deliver enterprise-grade cloud solutions that leverage Google’s cutting-edge technology to help companies operate more efficiently and adapt to changing needs, giving customers a foundation for the future. Customers in more than 150 countries turn to Google Cloud as their trusted partner to solve their most critical business problems.\nAdditional Information\n\n(Colorado only*) Minimum salary of $124,000 + bonus + equity + benefits.\n\nNote: Disclosure as required by sb19-085 (8-5-20) of the minimum salary compensation for this role when being hired into our offices in Colorado.\nResponsibilities\nCreate and execute on operational processes and practices that drive efficiencies for the organization.\nGather and analyze large amounts of information and turn it into compelling, insightful recommendations.\nBuild consensus among cross-functional teams and influence decision making with executive-level audiences. Lead execution against recommendations quickly and accurately.\nIdentify opportunities to develop strategic recommendations, execution plans, and key performance indicators to improve the operations of the BP&CO organization.\nFoster a culture of high organizational performance through internal and cross-group initiatives.\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form.", "url": "https://www.indeed.com/viewjob?jk=38df1958116944e1&from=serp&vjs=3"},
{"job_title": "newPeople Operations Coordinator", "summary": "As the operations coordinator you will be our day to day superhero for all things ops.\nWe encourage our people to travel and connect in person either through…", "company": "PeopleOps Jobs", "location": "+2 locationsRemote", "job_description": "At ConsenSys we have a vision of a world where data sovereignty and financial well-being is accessible to every person and organization. We believe Ethereum and decentralized protocol technology is a more trustworthy and equitable foundation for how we create and share value across the web. On this trusted, open source foundation, we can accelerate the world’s transition to a universally accessible network of distributed participants where transparency, security and freedom are fundamental.Our product suite, composed of Truffle, Infura, Quorum, Codefi, MetaMask, and Diligence, serves millions of users, supports billions of blockchain-based queries for our clients, and has handled billions of dollars in digital assets. As the leading Ethereum software company, ConsenSys enables developers, enterprises, and people worldwide to build next-generation applications, launch modern financial infrastructure, and access the decentralized web. To learn more about ConsenSys, and explore our products and solutions, visit http://consensys.net/.Why join ConsenSys?Remote first. You’ll be joining a team based all over the world. Providing the unique opportunity to work with people from across 6 continents. We encourage our people to travel and connect in person either through retreats, conferences, or just for fun!Flexible working arrangements. You can create the work week that works for you with flexible hours and locations. We believe everyone has the right to individual sovereignty. We empower and support you to make your own schedule and own your own time.Continuous learning and opportunities. As a destination employer, ConsenSys is committed to your growth and development. We provide continuous on the job learning and opportunities, as well as offering the comprehensive ConsenSys Advance Program which includes full access to Coursera training courses, bespoke training programmes, technical learning sessions and our world class blockchain and Ethereum Academy.Unlimited vacation/holidays. We value downtime to recharge and reset, ensuring everyone at ConsenSys has work/life balance. Company-wide we participate in “zero productivity” days to take a break from work, shut down, and sit back and relax.One of the most recognized tech companies in the blockchain ecosystem globally. Work experience at ConsenSys is a tremendous reference for your future career. You’ll join a network of entrepreneurs and technologists that reaches the edge of our ecosystem.About People & TalentPeople and Talent support the entire ConsenSys community. We strive to be the destination employer of choice for our ecosystem. That goal is embedded in all the work we do to attract, retain and support our amazing talent. By joining our team you’ll be working with a diverse group of incredible individuals who put ‘people first’ and are designing and building the workplace of the future.What you’ll doAs the operations coordinator you will be our day to day superhero for all things ops. You will be managing many of our internal systems to ensure our business runs smoothly and all deadlines are met. You’ll be working closely with the entire People & Talent function feeding key information to the Ops team.Your role will be split over multiple different projects ensuring consistency across all systems and data integrity while also being our 3rd party voice for day-to-day tasks, systems and additional projects. One of the projects you’ll be working on will be onboarding new hires through assisting with data implementation, supporting any needs of new hires, liaising with People Partners & Leads, organizing any onboarding orientations, learning sessions, and new hire check-ins across the organization, and co-managing equipment procurement.You will also be responsible for the day to day maintenance of our HR software tool Namely reviewing data, flagging any updates, building out current systems, running reports, managing training and sending weekly reports. For our additional HR platforms, TriNet and Velocity PEO, you will be serving as the admin for these tools ensuring all new hires are added to relevant platforms, verifying documentation, submitting payroll, connecting with platform reps, managing the operational piece of terminations, and communicating to the wider team on any compliance issues globally.As well as your operational skills we’re looking for an individual who has a passion for helping others and building out systems that do that. You’ll be the doer for any operational requests that come through ZenDesk and ensure we have an active voice in our ecosystem. There will also be many opportunities to bring your unique skill set to a project you are passionate about in supporting our key goals as an operational team for the larger ConsenSys community.Would be great if you brought this to the roleThe ability to work across multiple different systems and platforms with easeA clear understanding and comfortability with tools and technology systems for HRConfident in managing the full lifecycle of new hires onboarding experienceA data expert who can manage insights from numerous tools while ensuring data integrity across all systemsExcellent verbal and written communication skillsStrong organizational, time management skills and the ability to self-organizeGeneral knowledge of customer service tools and workflowsCan-do attitude and a willingness to step into new processes, or areas of work, outside your field of expertiseDon't meet all the requirements? Don't sweat it. We’re passionate about building a diverse team of humans and as such, if you think you've got what it takes for our chaotic-but-fun, remote-friendly, start-up environment—apply anyway. While we have a pretty good idea of what we need, we're ready for you to challenge our thinking on who needs to be in this role.ConsenSys is an equal opportunity employer. We encourage people from all backgrounds to apply. We are committed to ensuring that our technology is made available and accessible to everyone. All employment decisions are made without regard to race, color, national origin, ancestry, sex, gender, gender identity or expression, sexual orientation, age, genetic information, religion, disability, medical condition, pregnancy, marital status, family status, veteran status, or any other characteristic protected by law.Job Type: Full-timePay: $30,206.00 - $73,056.00 per yearBenefits:Flexible schedulePaid time offProfessional development assistanceSchedule:8 hour shiftWork Location: Remote", "url": "https://www.indeed.com/viewjob?cmp=SelectSoftware-Reviews&t=People+Operation+Coordinator&jk=a0d9b8a24a4897e4&vjs=3"},
{"job_title": "Truck and Bus Technician", "summary": "All Aspects of Repair and preventative maintenance on Late model truck and bus fleet.\nDiesel engine repair: 1 year (Preferred).", "company": "VOIGT'S BUS", "location": "Minneapolis, MN 55432", "job_description": "All Aspects of Repair and preventative maintenance on Late model truck and bus fleet. Opportunities for advancement in near future if desired and qualified. Be part of a team that solves problems and improves our organization to serve our customers and employees.Job Type: Full-timePay: $26.00 - $35.00 per hourBenefits:Dental insuranceFlexible scheduleHealth insurancePaid time offReferral programVision insuranceSchedule:8 hour shiftSupplemental Pay:Bonus payExperience:Diesel engine repair: 1 year (Preferred)Mechanical knowledge: 1 year (Preferred)Work Location: One location", "url": "https://www.indeed.com/viewjob?jk=17f9cebea75922ff&q=Technician&l=USA&from=web&advn=5078298083181233&adid=382287292&ad=-6NYlbfkN0BiFWglDtXxlI5uFN60L5bLZVRBpqnCE7N29TWbqNv_95AakcvZya4lnpRgA8GeOduVsavyaIdms5bSAu5lCdjyf4eAlkZyS-btMaz24XF0caJzoLJLYYjacMgNc3o9BZGj-CXKQ5Sw1TuG8UvnSjoCGrUyDbpip98hbStzGjwQP6MgZnjvCFoY3fCuxuT5BN7sjOLnR1tyc1a64zWsXnHZtGmKkgrqY3Dfx0u7q5Eg--bm44fa7A7tCCWEw41gkv84vQoNpsV_bcCVxGpggNJ3b-Qe1aDo063uc040KpVdblXPk8HIedMYb6Bh4HaWokQaojZKinqyx8SdMa1SVw85kxCtRZ0rEBsqvYDOxBHdWZfTob6YzI1az8ZFQhnJtaY%3D&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "newSrAssc, Operation Svcs", "summary": "Performs duties such as maintaining all level of files, searching and investigating information contained in files, processing departmental documents requiring…", "company": "CoreLogic", "location": "Irving, TX 75063 (Freeport/Hackberry area)", "job_description": "Job Summary:\nJoin our team of over 5,000 employees globally, who provide the insights through data and next generation technology that help millions of people find, buy and protect the homes they love. From the beginning, CoreLogic has been driven by a single purpose – to innovate and create solutions that solve our clients’ toughest challenges in the housing market. CoreLogic is the trusted source for property intelligence, with deep knowledge of powerful economic, social, and environmental forces that promote healthy housing markets and thriving communities.\nWe apply that same dedication to creating a diverse and inclusive work culture that inspires innovation and bold thinking. A place where individuals can work on small teams, feel valued, and directly impact the real estate industry. We believe our team members are the best in the business, and we will continue to recruit, retain, develop and reward our most important asset – our people!\nJob Description:\nJob Duties\nConducts research of data. Leverages all available resources such as existing databases, third party sources and/or public information on the internet.\nContacts clients/outside customers to clarify information. Utilizes tools to analyze, query and manipulate data according to defined business procedures. Extracts and enters appropriate data onto application, other form, or database.\nProcess payments which may require preparing, balancing, and submitting complex wire disbursements for mass manual payments.\nMay proofread documents for grammatical, mathematical, typographical and composition errors adhering to standards and guidelines. Offers suggestions to improve readability.\nAdhere to all required company and client driven Service Level Agreements\nPerforms duties such as maintaining all level of files, searching and investigating information contained in files, processing departmental documents requiring more specific knowledge of functional operations and entering report results into tracking system.\nMay track progress and provide status report to management on achievement of daily and weekly team goals.\nMay act as Subject Matter Expert on internal and client projects making recommendations to these processes.\nAble to develop and maintain business relationships with individuals representing other departments, and/or representing outside organizations.\nJob Qualifications:\nEducation, Experience, Knowledge and Skills\nCollege degree preferred, High School Diploma or equivalent required\n2+ years related experience in lieu of college degree\nExcellent verbal and written communication skills required for reporting, presentations, information sharing\nExcellent customer and listening skills - builds customer confidence through commitment and delivery of customer satisfaction\nIntermediate to advanced computer skills to retrieve, query, create, update and manipulate documents and spreadsheets containing formulas and formatting\nStrong attention to detail and organizational skills\nAbility to manage multiple tasks/projects simultaneously while meeting deadlines\nTenacity for solving detailed / complex issues\nStrong analytical skills\nAbility to train and provide feedback to others\nAbility to collaborate with peers, other departments and clients to improve processes and share best practices\nCoreLogic's Diversity Commitment:\nCoreLogic is fully committed to employing a diverse workforce and creating an inclusive work environment that embraces everyone’s unique contributions, experiences and values. We offer an empowered work environment that encourages creativity, initiative and professional growth and provides a competitive salary and benefits package. We are better together when we support and recognize our differences.\nEOE AA M/F/Veteran/Disability:\nCoreLogic is an Equal Opportunity/Affirmative Action employer committed to attracting and retaining the best-qualified people available, without regard to race, color, religion, national origin, gender, sexual orientation, gender identity, age, disability or status as a veteran of the Armed Forces, or any other basis protected by federal, state or local law. CoreLogic maintains a Drug-Free Workplace.\nPlease apply on our website for consideration.\nPrivacy Policy - http://www.corelogic.com/privacy.aspx\nBy providing your telephone number, you agree to receive automated (SMS) text messages at that number from CoreLogic regarding all matters related to your application and, if you are hired, your employment and company business. Message & data rates may apply. You can opt out at any time by responding STOP or UNSUBSCRIBING and will automatically be opted out company-wide.\nConnect with us on social media! Click on the quicklinks below to find out more about our company and associates.", "url": "https://www.indeed.com/viewjob?jk=291f498251e5f2dc&from=serp&vjs=3"},
{"job_title": "Operations Coordinator (Remote or Los Angeles)", "summary": "2-3+ years of work experience.\nStart-up, agency, hospitality or retail experience is a plus.\nSolutions-focused; Excited to work internally and externally to…", "company": "Spiegel Design Group, Inc.", "location": "Remote in Los Angeles, CA", "job_description": "Build Anything.We're the engineering team trusted by the world's largest eCommerce and DTC brands. Our mission is to transform our clients’ businesses, drive growth, and build the highest-scaling and most complex experiences online today.Our team is composed of vibrant, resourceful, and entrepreneurial people in front-end, full-stack and technical operations roles. At SDG we focus on building a culture that allows everyone to create meaningful and impactful work for our team and our clients’ businesses. Our people are the most valuable assets to this culture. As such, we offer a flexible time off schedule, excellent benefits, a collaborative work environment (as well as permanent remote options), and plenty of opportunity for career growth.We believe in hiring people, not outsourcing and are committed to growing the best team in this space. We're a close knit crew that highly values strong teamwork, initiative, and quality.Background.We are looking for smart, organized, and motivated professionals to help manage our growing project and client portfolio. If you are an excellent communicator and organizer with a client services background and are confident handling multiple work streams in the digital production space, then we want to hear from you.Requirements.2-3+ years of work experience. Start-up, agency, hospitality or retail experience is a plus.Ability to multi-task and prioritize against the greatest and most urgent needs.Solutions-focused; Excited to work internally and externally to identify problems and solve.Must have excellent organizational and problem-solving skills, be solution-focused, be professional, collaborative, reliable, and provide excellent customer service.Experience maintaining strict confidentiality of data and information.Comfort in speaking to and managing expectations.Exceptional written and verbal communication skills.Technical and/or engineering experience is a plus.DetailsFully Paid Medical, Dental & Vision.401k Retirement Plan.Work From Home/Anywhere.Salary is competitive and commensurate with experience.This is a full-time position.We are a fully remote team and deeply respect and value work-life balance.This position is open to candidates in the United States and Canada only.Job Type: Full-time", "url": "https://www.indeed.com/viewjob?cmp=SDG&t=Operation+Coordinator&jk=eb2cf51e466e551a&vjs=3"},
{"job_title": "newData and Operations Assistant", "summary": "Must have prior operations or advanced administrative experience.\nOrganizational Tutors (OT) is one of the premier Executive Function Tutoring organizations in…", "company": "Organizational Tutors", "location": "Remote in Brooklyn, NY", "job_description": "Organizational Tutors (OT) is one of the premier Executive Function Tutoring organizations in the United States. Based in NYC, OT provides specialized and individualized tutoring and coaching to strengthen students’ executive functioning capacities, effectively manage complex neuropsychological profiles, and overcome social/emotional obstacles to learning. OT has grown exponentially over the past decade due to the dedication and efforts of its tight-knit team.OT is looking for a highly-organized, extremely fastidious, and efficient Data and Operations Assistant to work closely with our Administrative Team. As a small team, working remotely, we are looking for someone who communicates clearly, is self-directed, independent, and is comfortable asking questions. Though the majority of work can be done remotely, preference is given for candidates who are available for occasional in-person meetings and training sessions in the NYC area. Interest and/or experience in psychology and education is a plus.ResponsibilitiesWe expect the Data and Operations Assistant to be a core member and idea contributor to the Administrative Team. The responsibilities of this role involve not only supporting the organization’s overall operations, but also leading the next step in the future of our data systems and conversations surrounding analysis of company metrics. Specifically, this role will directly support the Operations Director in tasks related to client billing and customer service and will provide team-wide support with data entry and data analysis related to our matchmaking process, client services, and marketing efforts.Tasks include but are not limited to:Entering tutor and client data into proprietary matching and billing systemsTracking and reporting data related to client conversion and retention on a monthly, quarterly, and annual basisCompiling and analyzing data related to tutor caseloads and referral sourcesQuality checking current data for errors and performing routine quarterly maintenance of client and tutor data for accuracyProviding recommendations for improving the efficiency and accuracy of data systemsAnalyzing company metrics, trends, and providing recommendationsAssisting with monthly client billing, supporting tutors and clients, and providing troubleshooting and customer supportUpdating and maintaining audience lists and tags in Mailchimp and tracking Mailchimp metricsPerforming research relating to new partnerships, expansion opportunities, services, etc., and preparing summariesKeeping apprised and the team informed of relevant professional development opportunitiesPreparing Excel files, Powerpoint slides, and other presentation materialsCoordinating and attending company meetings, preparing agendas, taking notes, assigning, and following up on action itemsCommunicating with vendors and service providersManaging calendarsConducting research and summarizing findingsProviding other types of general professional administrative support to the CEO, Program Director, and Operations DirectorDirecting questions and inquiries to appropriate parties and handling sensitive information with professionalism and discretionQualificationsBachelor's degree is required; graduate degree completed or in progress is preferred. Coursework involving statistical/data analysis or comparable certification required.Must have prior operations or advanced administrative experienceMust have advanced level comfort with Excel: charts, pivot tables, graphs, etc. Experience with Google Workspace/Microsoft Office Suite, databases, Mailchimp, and Zoom also required.Dependable self-starter who can take direction but work independentlyDemonstrated professionalism, sound judgment, trustworthiness, and follow throughExcellent written and verbal communication skillsExceptional attention to detail and organizational skillsAbility to stay on task and keep up with weekly goals in a virtual work environment (the OT team works remotely.)Availability for occasional in-person meetings in NYCSound judgment regarding privacy, confidentiality, and acceptable contentDemonstrated understanding of responsible internet safety best practicesCommitment to an environment of respect, inclusion, diversity, and fairnessCompensationThis is a full-time W-2 employee position. Compensation is competitive and commensurate with experience.ApplicationPlease submit your résumé and a cover letter outlining your interest, any relevant experience, and qualifications. In your letter, please address when you are available to begin this position and over what period you will be available. Please also have prepared the names and contact information for two or three references.Organizational Tutors is a woman-owned and family-friendly company.To learn more, please visit Organizationaltutors.com.Job Type: Full-timePay: From $30.00 per hourBenefits:Flexible schedulePaid time offSchedule:Monday to FridayEducation:Bachelor's (Required)Experience:Microsoft Excel: 1 year (Required)Administrative: 1 year (Required)Work Location: One location", "url": "https://www.indeed.com/viewjob?cmp=Organizational-Tutors&t=Data+Operation+Assistant&jk=d803c96931741c94&vjs=3"}