[
{"job_title": "newHigh School Visual Arts Teacher (2022-2023)", "summary": "We operate high-performing urban public charter schools and a unique graduate school of education that trains teachers for high-poverty schools.", "company": "Match Education", "location": "Boston, MA 02215 (Allston area)+1 location", "job_description": "Position: High School Visual Arts Teacher (2022-2023 Opportunity)Location: Boston, MA (Brighton Campus)Start date: August, 2022 ABOUT THE MATCH CHARTER PUBLIC SCHOOLMatch Charter Public School is a free, high-performing charter public school in Boston. We are a PreK-12 school serving 1,250 students. Our mission is to prepare students for success in college and careers in order to achieve economic security and mobility. Students gain acceptance to our schools via an annual blind public lottery open to all Boston residents.Our families bring amazing racial and cultural diversity to the school community - they represent over 20 different countries of origin with over 20 different languages spoken at home.\n\n94% of our students are people of color. Our students bring a diversity of needs to our school, and we are prepared to serve them. 21% of our students qualify for special education services; 18% of our student body are English Language Learners.We know that the largest driver of our success is the people who work in our schools every day. Match teachers and staff have an immediate impact on our ability of reaching our mission and changing the lives of our students.\n\nWe strive to attract, develop, and retain a team that is diverse by race, ethnicity, culture, income background, gender, sexual identity, and a variety of other factors. See our statement on diversity here. OVERVIEW OF ROLE AND RESPONSIBILITIESWe are looking for a full-time Visual Arts Teacher who can help continue to build the arts program at our high school. The position is based at our high school campus on 1001 Commonwealth Ave.\n\nin Brighton and entails designing and delivering a curriculum for high school students who will have Visual Arts classes during the regular school day.We would like the Visual Arts teacher to offer a mix of classes in visual media. There is a budget available for equipment and supplies. The Visual Arts teacher will: -Design curriculum and teach Visual Arts classes-Teach classes at multiple grade levels-Assist with duties to uphold a positive and safe school culture-Participate in regular professional development, coaching sessions, and faculty meetings-Performs other duties assigned as a member of the school faculty QUALIFICATIONSResearch has shown that people of color and women are less likely to apply for jobs if they dont believe they meet every one of the qualifications described in a job description. Our highest priority is finding the best candidate for the job.\n\nWe encourage you to apply, even if you don't believe you meet every one of our qualifications described or you have a less traditional background. We are looking for applicants who the following qualifications: -Have at least 1-3 years prior experience as an Visual Arts teacher, ideally with high school students-Hold a valid and appropriate license issued by the Massachusetts Department of Elementary and Secondary Education, or obtain the licensure within a year of date of hire-Articulate a clear vision for an high school Visual Arts curriculum-Demonstrate skill in designing and delivering lessons-Demonstrate skill in building effective relationships with students and colleagues-Hold a deep belief that all students can and will succeed-Possess a desire to continually improve their practice as an educator by taking and implementing feedback ABOUT MATCH EDUCATIONMatch Education (www.matcheducation.org) is the shared brand name of The Match Charter Public School, The Match School Foundation, Inc., and The Sposato Graduate School of Education. Match Education is an engine of discovery and applied innovation in education. We operate high-performing urban public charter schools and a unique graduate school of education that trains teachers for high-poverty schools.\n\nOut of this applied work, we refine, validate empirically, and eventually disseminate new ideas and practices on core questions in education reform. The Match Foundation, Inc., The Charles Sposato Graduate School of Education, Inc., and Match Charter Public School prohibit discrimination on the basis of race, color, sex, gender identity, sexual orientation, age, national origin, physical or mental disability, religion, veteran status, and any other class of individuals protected from discrimination under state or federal law in any aspect of the access to, admission, or treatment of students in its programs and activities, or in employment and application for employment.", "url": "https://www.indeed.com/viewjob?jk=13134c4eedca7e87&from=serp&vjs=3"},
{"job_title": "newElection Logistics Worker", "summary": "The position is located in Pearl City on the Island of Oahu.\nAs a condition of employment with the State of Hawaii, all qualified external candidates who have…", "company": "State of Hawaii", "location": "Oahu Island, HI", "job_description": "Recruitment Information\n\nThis posting is for the State of Hawaii, Department of Accounting and General Services, Office of Elections.\n\nThe position is located in Pearl City on the Island of Oahu.\n\nSalary: $2,600 per month\n\nAs a condition of employment with the State of Hawaii, all qualified external candidates who have been given a conditional offer of employment must show proof of full COVID-19 vaccination and shall be fully vaccinated by his/her/their employment start date. A reasonable accommodation will be provided if requested by a candidate and it is determined through an interactive process that pregnancy, a qualifying disability, or a sincerely held religious belief prevents the candidate from receiving a COVID-19 vaccination.\n\nThe State Recruiting Office will refer all inquiries regarding this exempt position to the Department of Accounting and General Services, Office of Elections.\nDuties Summary\nThis position is responsible for providing manpower and logistical assistance in preparing and conducting the 2022 Elections. This position is also responsible for ensuring the operational readiness of facilities to be used for the election and will need to operate a motor vehicle to transport equipment, materials, and supplies. This is a temporary position that does not exceed December 2022.\nMinimum Qualification Requirements\nCitizenship Requirement: The State of Hawaii requires that all persons seeking employment with the government of the State shall be citizens, nationals, or permanent resident aliens of the United States, or eligible under federal law for unrestricted employment in the United States.\n\nKnowledge: Warehouse operations in handling equipment, materials, and supplies.\n\nSkills/Abilities: Understand oral and written instructions; knowledge of basic mathematics; operate a forklift; take physical inventories; foresee occupational hazards and take effective measures to eliminate them; deal courteously and effectively with others; lift and carry heavy equipment, materials, and supplies.\n\nEducation: Graduation from high school or its equivalent.\n\nExperience: One year experience working in a warehouse environment handling equipment, materials, and supplies; and operating a forklift. Hawaii Driver License is required.\nOther Information\nThis position is exempt from the civil service and considered temporary in nature. Therefore, if you are appointed to the position, your employment will be considered to be \"at will,\" which means that you may be discharged from your employment at the prerogative of your department head or designee at any time.\n\nSubmit resumes to:\nOffice of Elections\nAttn: Kristen Uyeda\n802 Lehua Avenue\nPearl City, Hawaii 96782\n\nResumes can also be faxed to (808) 453-6006 or emailed to elections@hawaii.gov\n\nDirect all inquiries regarding this position to:\nKristen Uyeda\nPhone: (808) 453-8683\nMonday - Friday, 7:45 a.m. - 4:30 p.m. (HST)\nEmail: elections@hawaii.gov\n\nNOTE: The State Recruiting Office will refer you to the Department of Accounting and General Services, Office of Elections regarding this exempt position.", "url": "https://www.indeed.com/viewjob?jk=cfc5331778526f14&from=serp&vjs=3"},
{"job_title": "newTrain Electrical Engineer", "summary": "Providing direct inputs to Electrical and Schematic Design engineers for the development of vehicle schematics, including schedule deadlines.", "company": "Segula Technologies", "location": "Naperville, IL+1 location", "job_description": "Job Description\nIn this role you are responsible for the Train Electrical engineering deliverables on projects such as overhauls. You functionally manage a team of electrical engineers and ensure that clear expectations in terms of technical deliverables, schedule and responsibility are defined. You report progress to the project team and the external customer.\n\nQualifications\n\nAccountable for the definition of all train electrical deliverables including schematics, primarily for overhaul projects\nProviding direct inputs to Electrical and Schematic Design engineers for the development of vehicle schematics, including schedule deadlines\nDefining electrical interfaces with Train Control and/or System engineers to ensure electrical functions and systems are adequately integrated\nSupporting the Mechanical Design team for cable routing and cable harness drawings development, as well as the Industrial Engineering team for manufacturing aspects\nEnsuring the train electrical design is compliant with applicable standards for reliability, safety, maintainability and customer requirements\nProviding support to the Production Line, Testing, Procurement and Quality teams\nTravel of up to 10% may be required to support business meetings, Production Line support, or validation and test activities.\nAdditional Information\nAll your information will be kept confidential according to EEO guidelines.", "url": "https://www.indeed.com/viewjob?jk=6b22b5e773efdddb&from=serp&vjs=3"},
{"job_title": "Tree Worker", "summary": "Tree Foreperson Tree Trimmer with a Commercial Driver’s License – Starting pay $40.37.\nTree Foreperson Tree Trimmer with a Class C License – Starting Pay $38.57…", "company": "Mountain F Enterprises", "location": "California", "job_description": "In 1984, Mountain F. Enterprises, Inc. (MFE) was established in Lotus, California, and has blossomed into a full spectrum vegetation management company that specializes in providing services to a variety ofcustomers including federal, state, local agencies, and utility companies. MFE prides itself with employees who are highly skilled, professional and have a work ethic unprecedented in the industry while utilizing top of the line equipment.The MFE team is currently recruiting for a wide range of full-time positions. We are looking for those individuals with experience as well as those that have no prior tree experience but have a passion to learn and want to begin a career in the utility tree industry.Tree Foreperson Tree Trimmer with a Commercial Driver’s License – Starting pay $40.37Tree Foreperson Tree Trimmer with a Class C License – Starting Pay $38.57Specialized Tree Equipment Operator $32.44 - $38.57Tree Climber (2 years minimum experience) – Starting Pay $36.05Apprentice Tree Climber 1-6 months exp– Starting Pay – $25.23Apprentice Tree Climber 6 -12 Months exp – $28.84Apprentice Tree Climber after 12 months - $32.44Ground Person 0-6 months experience - $22.01Ground Person 6+ months experience - $23.43Traffic Control (Flagger) - $22.01$50.00 per day for Per Diem for Apprentices Climbers & Foreperson$25.00 per day for Ground Person and FlaggersTo apply and submit an application, please visit our website at www.mtfent.com/careersMFE offers a competitive benefits package which includes:Medical/Dental/VisionVacationFull Union Pension/Retirement PackageMountain F. Enterprises, Inc. is a drug-free workplace. You must pass a pre-employment drug screen, physical, background check, and have a valid US Driver’s License.for employmentJob Type: Full-timePay: From $22.01 per hourBenefits:401(k)401(k) matchingDental insuranceHealth insuranceVision insuranceSchedule:10 hour shift12 hour shift8 hour shiftDay shiftMonday to FridayOvertimeWeekend availabilityWork Location: Multiple Locations", "url": "https://www.indeed.com/viewjob?jk=2a9c66f4c53e7afb&q=Worker&l=USA&from=web&advn=5558136261453681&adid=379206656&ad=-6NYlbfkN0Bj6kKvXj-goe1pDAgv29bc0negiy65Ek_imM3bA2IhbLzOUQUZJz7fQnYVTdTcgy1sudfYcA5vATKtjBbBt6z1X7ErK8mqPRMWOMZo8Aj1rHpnv3qg-et6B2ACR-pBaP3QgUk0c0_ymj-g7SJpT-H2J_fV0Ta_BCwMtl2YHfLqwPuem2qUgpmF2pRwNrPihwS2sibVZiVPu7z9lhWEe5LFfjWNFveM3avq22VAI-OwpOdVP75L9UgxBC0kD1HKuT9zeUKNyDNm10zoGbJMDDuAqL2giD90jJIn-j-bKsG1FDF8oJJbvxC-OR9cBZqFyngm0adNV4MppcAj0QOxqjAjW2wysZHHG3AjraRm_j8Dyz-Ih0WtLFa6&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "newDesign Engineer", "summary": "Responsibilities include assisting in component design for Honda's high performance race vehicle/powertrain.\nThis includes design concept preparation, component…", "company": "Honda Performance Development", "location": "Santa Clarita, CA 91355 (Valencia area)", "job_description": "Design Engineer(Job Number: HPD00007K)\n\nHonda Performance Development\n\nDescription\nResponsibilities include assisting in component design for Honda's high performance race vehicle/powertrain. This includes design concept preparation, component and assembly modeling, design evaluation and analysis, drawing preparation and release, part manufacturing coordination and other related administrative duties.\n\nQualifications\nBS Degree in Electrical/Mechanical Engineering preferred or equivalent experience. 1-3 years of experience in 2 and 3-dimensional software modelling in automotive industry, preferably in design of electrical, powertrain or vehicle components. Extensive hands on experience with internal combustion race engines, race vehicles and related electronic and mechanical systems. Proficient with PC workstation hardware and CATIA Software.", "url": "https://www.indeed.com/viewjob?jk=8d45659b8b4fa093&from=serp&vjs=3"},
{"job_title": "newParking Enforcement Officer", "summary": "Full Time / Part Time Available*.\nWe have morning, evening, and overnight positions available.\nSince we operate 24/7, our scheduling is very flexible.", "company": "Empire Parking Services", "location": "Atlanta, GA", "job_description": "Overnight Parking Enforcement Officer Overnight Parking Enforcement Officer Full Time / Part Time AvailableWe have morning, evening, and overnight positions available. Since we operate 24/7, our scheduling is very flexible. You inform us of your availability, and we plug you into our schedule, simple as that. Come join the elite squad of parking enforcement professionals and make great money booting vehicles in the Atlanta area. Empire Parking Services is a professional parking enforcement company that enforces parking regulations on private property. We immobilize (boot) vehicles that park illegally on private property and charge the vehicle owner a fee to remove the immobilization device.Military Veterans or Active Military, Law Enforcement, Correctional Officer, Vehicle Towing , Security Guards, Parking Enforcement Officer experience is a plus.Receive complete training, uniform, and all equipmentFlexible Hours - allows you to be in control of the amount of money you make.MUST HAVE:Valid Driver’s LicenseReliable TransportationMust be able to handle stressful situations in a professional mannerCannot be a convicted felon or charged with a felony.What is the Booting Process? A vehicle immobilization device, also known as a “boot”, is a wheel clamp that can be easily applied and removed only by a parking enforcement technician.When a vehicle is booted, the technician will also apply an orange sticker on the driver side window to alert the vehicle’s owner that it has been immobilized. The Empire Parking 24-hour call center phone number is located on the orange sticker. When the parking violator calls the number, our call service operator will dispatch a technician to the location to remove the boot for the designated fee. Once the boot is removed, the parking violator leaves the premises and has learned a valuable lesson without emptying their wallet. Other potential parking violators also notice the boot and orange sticker and this acts as a visual deterrent to notify them not to park and leave the property.Job Types: Full-time, Part-timePay: Up to $60.00 per hourBenefits:Flexible scheduleSchedule:8 hour shiftMonday to FridayNight shiftOvertimeWeekend availabilitySupplemental Pay:Commission payExperience:Military: 1 year (Preferred)Security: 1 year (Preferred)License/Certification:Driver's License (Required)Work Location: Multiple Locations", "url": "https://www.indeed.com/viewjob?cmp=Empire-Parking-Services&t=Parking+Enforcement+Officer&jk=f07f37bfb49e2b05&vjs=3"},
{"job_title": "newR&D Engineer", "summary": "Responsible for performing engineering tasks to research and develop EndoVenous medical devices from conception to market release, including designing,…", "company": "Medtronic", "location": "Plymouth, MN 55430+13 locations", "job_description": "R&D Engineer for Covidien, LP (a Medtronic company) located in Plymouth MN. Responsible for performing engineering tasks to research and develop EndoVenous medical devices from conception to market release, including designing, developing, analyzing, troubleshooting, providing technical skills, and translating research discoveries into usable and marketable products; develop medical devices, including developing device specifications and making recommendations for design improvements, proposing of device materials and parts, and translating into manufacturing / supplier requirements and processes; develop and validate equipment, test fixtures, and test methods utilized for in-vitro clinical simulation testing of device performance and plan, execute and analyze results for device performance testing; develop and validate test fixtures and test methods utilized for quantitative and qualitative materials properties analysis (e.g. Dynamic Mechanical Analysis, tensile, fatigue, compression) for polymers and metals; plan, lead and analyze results for material characterization (e.g. imaging thru microscopy and SEM, physical testing, and chemical testing thru DSC and spectroscopy); apply Design, Reliability, Manufacturability (DRM) methodology to drive product performance and manufacturing process improvements and DOE (Design of Experiment) and statistical techniques in testing and analysis; review risk assessment for patient hazard designations and Design Failure Mode and Effect Analysis (DFMEA); consult on the development and validation of manufacturing processes to include development of Process Controls and Installation, Operational and Performance Qualification (IQ, OQ, PQ); and navigate the complexity of various government and industry regulations/standards to include FDA QSR, CFR 820, ISO10993, ISO13485, EHS global conformity assessment, and EU MDR Hazardous Material Concerns.\n\nBasic Qualifications:\nMasters’ degree in Bioengineering, Biomedical Engineering, Materials Science and Engineering, or Mechanical Engineering and 6 months of engineering experience in the medical device industry.\nMust possess a minimum of 6 months experience with each of the following: developing medical device specifications and making recommendations for design improvements, proposing of device materials and parts, and translating into manufacturing / supplier requirements and processes; developing and validating equipment, test fixtures, and test methods utilized for in-vitro clinical simulation testing of device performance; planning, executing and analyzing results for device performance testing; developing and validating test fixtures and test methods utilized for materials properties analysis to include Dynamic Mechanical Analysis, tensile, fatigue, and compression for polymers and metals; planning and analyzing results for material characterization to include imaging thru microscopy and SEM, physical testing, and chemical testing thru DSC and spectroscopy; applying Design, Reliability, Manufacturability (DRM) methodology and Design of Experiments (DOE) and statistical techniques in testing and analysis; reviewing risk assessment Design Failure Mode and Effect Analysis (DFMEA); consulting on the development and validation of manufacturing processes to include development of Process Controls and Installation, Operational and Performance Qualification (IQ, OQ, PQ); and FDA QSR, CFR 820, ISO10993, ISO13485, EHS global conformity assessment, and EU MDR Hazardous Material Concerns.", "url": "https://www.indeed.com/viewjob?jk=59490ce4dd548806&from=serp&vjs=3"},
{"job_title": "Human Resources Assistant", "summary": "The Human Resouces Assistant will provide administrative support to the HR Corporate Groups and DEI teams out of our New York City offices to ensure on-site…", "company": "Tiffany & Co", "location": "New York, NY", "job_description": "The Human Resouces Assistant will provide administrative support to the HR Corporate Groups and DEI teams out of our New York City offices to ensure on-site collaboration.", "url": "https://www.indeed.com/viewjob?jk=4778de1ea3808558&from=serp&vjs=3"},
{"job_title": "Engineer in Training", "summary": "The preferred candidate will gain knowledge of design criteria, policies, and procedures and standards on an as-needed basis.\nA valid Driver's License.", "company": "Sustainable Design Solutions, LLC", "location": "Baton Rouge, LA", "job_description": "Engineer In Training Job DescriptionThe selected candidate will work on projects that may include water, sewer, general civil, or drainage components.The preferred candidate will gain knowledge of design criteria, policies, and procedures and standards on an as-needed basis. The preferred candidate will prepare plans, cost estimates, exhibits, and reports for projects under the direction of a Project Engineer.The following education and/or experience are the minimum standards which provide the required knowledge, skills and abilities for this position: A Bachelor's Degree from an accredited college or university in civil engineering or related field.Registration as an Engineer Intern or Engineer In Training.A valid Driver's License.Preference may be given for additional education, knowledge, experience and/or certification as it relates to the position including: Microsoft OfficeEfficient in AutoCAD and MicroStationThe ideal candidate will also: Possess enthusiasm to learnBe a team playerBe self-motivatedDemonstrate strong interpersonal skillsBe able to interact with consultants, contractors, stakeholders, and citizensBe results focusedBe able to prioritize, pay attention to detailHave excellent communications skillsBe a good problem solverJob Type: Full-timePay: $57,000.00 - $82,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceFlexible scheduleFlexible spending accountHealth insuranceLife insurancePaid time offVision insuranceSchedule:8 hour shiftSupplemental Pay:Bonus payEducation:Bachelor's (Required)License/Certification:Engineer Intern Certificate (Required)Work Location: Multiple Locations", "url": "https://www.indeed.com/viewjob?jk=035796bf4c32c0cd&q=Engineer&l=USA&from=web&advn=4893836486483264&adid=382829584&ad=-6NYlbfkN0C29hvXBsqPXhhx7JNMmYbw4YwtYqnydFXWi5Ki7qnQ4q0dW_8z6jSynlXIO1kmY6Iqyb-cfoH1xbGq4yZcPOTvZDRvjF737CzaUaVv99c9RiHR18w5mGlcdHQF2ziAJH13dc14ybt2k7z2nXIfwHKdxILClbnbYVcGZLEsBK1JcyoLkcPyI2BmgSlFjx2Vbip2hU9BNjEJywghPuJKTLrM3ccZAQZcjiQI2z3lP7x8trt7l-LwnxiWniVIF1KCvFAWZTXlzh9_oyHG1ZbP-o3--LYu1MHRZrPslQfN41evMZmsblEvfOso3y9XinySfggl6Kg3_T_B5CxbM5ZmrLPBTCkxI1Ha3ke3ZKBEq8knpRamwGkGRq3g&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "Desktop Support Supervisor", "summary": "Ability to listen, build rapport, and credibility as a partner vertically within the business unit, as well as with leadership and functional team.", "company": "Set Solutions", "location": "Remote in Los Angeles, CA", "job_description": "Set Solutions is working exclusively for a client in need of a full time (direct hire) Desktop Support Supervisor with a background in managing field service operations. The client is working on a three-year technology modernization effort and company-wide End User Support transformation.This is a very innovative environment with a huge amount of growth potential and opportunity to make an impact.The role can be done almost entirely REMOTELY but since it’s in management the position needs to be based out of the LA area so that you can get to the local office(s) occasionally.Job Description:Manage local and remote desktop technicians and infrastructure administration teamsManages daily IT activities of field service technicians, ensuring the level of technology support meets the needs of the organizationLead end user computing acquisition integrations into enterprise (Microsoft Configuration Manager, Microsoft security patching, antivirus solution and enterprise standards)Manage the production of employees through clear cut expectations and metrics.Foster a culture of accountabilityEnsures adherence to policies, procedures and technical standardsEnsure project and initiative progress, including consistent and effective communicationManage escalations as it relates to providing technology service supportLead, mentor change and motivate teammates to deliver exceptional customer service.Actively pursues operational improvements to enhance quality, improve productivity and reduce expenseRequirements:Must have freedom to and willingness to work extended hours and on-call to support production when neededAbility to listen, build rapport, and credibility as a partner vertically within the business unit, as well as with leadership and functional teamWorking knowledge with Microsoft operating systems and software to include, but not limited to Microsoft OfficeStrong problem-solving skills to identify and resolve problems in a timely mannerAbility to manage personnelExcellent organizational and planning skills in order to prioritize and plan work efficientlyExcellent interpersonal and communication skillsBasic understanding of virtual desktops and CitrixJob Type: Full-timePay: $85,000.00 - $110,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceHealth insurancePaid time offTuition reimbursementVision insuranceSchedule:Monday to FridayWork Location: Multiple Locations", "url": "https://www.indeed.com/viewjob?cmp=Set-Solutions&t=Desktop+Support+Supervisor&jk=97b3db5d5f6c4d33&vjs=3"},
{"job_title": "newPackaging Engineer", "summary": "GRAMMER is a leading North American full service automotive supplier of highly engineered thermoplastic components and assemblies for interiors and air and…", "company": "Grammer Americas", "location": "Toledo, OH 43612 (Whitmer - Trilby area)+1 location", "job_description": "Supply Chain/Packaging EngineerGRAMMER Americas Toledo, Ohio Metropolitan AreaCompany DescriptionGRAMMER is specialized in developing and manufacturing components and systems for car interiors as well as driver and passenger seats for off-road vehicles, trucks, buses, and trains.As a global partner to the vehicle manufacturing industry we are represented around the world by our two divisions, Automotive and Commercial Vehicles. Our employees are constantly engaged in developing and producing innovative, flexible solutions to meet challenges in today’s competitive global market. GRAMMER can be found on four continents with more than 50 production, distribution and logistics sites in 20 countries.GRAMMER is a leading North American full service automotive supplier of highly engineered thermoplastic components and assemblies for interiors and air and fluid management systems.Culture: Here at GRAMMER, we foster a culture that embraces our Grammer CODE: Collaborate in an inclusive environment, Openness in communication and ideas, Drive for results with energy and Empower yourself and others by taking ownership of decisions and actions.What we are looking for: Grammer is looking for a Supply Chain/Packaging Engineer to join our MP&L team at our Americas headquarters in Toledo, OH. The ideal candidate will enjoy working in a team environment. This individual will have an opportunity to make lasting and positive changes in our regional operations and within the MP&L Organization!What you will be doing: · Support Americas Region on product packaging (internally and externally)· Work with external vendors to develop packaging concepts for both new and existing programs· Support business development in quotation process as it relates to packaging and transportation· Work with Americas’ plants to identify packaging concerns (RCA) and provide improvements to ensure quality specs are met· Identify packaging improvements that support plant operations while reducing cost· Assist Americas’ plants with lean material flow concept implementation· Support development of PFEP within the Region· Other tasks as directed by managementWhat you will bring along: · Degree in packaging or supply chain (or related experience)· Previous experience in packaging concepts and standards· Knowledge of transportation (both domestically and internationally) as it relates to packaging· Experience with quoting new business and system day calculationsDesired Skills· Organized and detail oriented with ability to meet deadlines and ensure accuracy of deliverables· Strong analytical, problem solving and leadership skills· Attentive, ability to work independently and prioritize tasks· Excellent written and verbal communication skills· Proficient in Microsoft Excel, Powerpoint, and Word· Experience with reading blue prints· CAD or other design software experience a plus· Must have strong work ethic and be a team player· Knowledge of AS400 and SAP software applications is preferredWhat we can provide you: · Medical, Dental, and Vision coverage· Tuition reimbursement programs· 401(k) match· Robust EAP services· Developmental opportunities· Much more!Job Type: Full-timePay: $80,000.00 - $105,674.00 per yearBenefits:401(k)401(k) matchingDental insuranceFlexible scheduleHealth insurancePaid time offVision insuranceSchedule:8 hour shiftEducation:Bachelor's (Required)Work Location: One location", "url": "https://www.indeed.com/viewjob?jk=cd8d2d63f720a589&q=Engineer&l=USA&from=web&advn=6796221994580834&adid=13884087&ad=-6NYlbfkN0AHUV_VHuf5EnLCrT0NA0MYler8H02BRyL792hg8vlVH7OytMkCLxASzBJpTkxhLjfYdUsUxIUlHY7zH7e2d4fi1LokEQ3sVuDD_uKFCWxSIi90W4I0cWQsPwiwX-NXUKDK67yrS2pAQbjp7wh9U_ZS7aLBIJ16auzlpv38Q7Q265SV2yGi6wpIh8ndf0XbC15459quTQrYV1n2GXTEtYiAuzrg1Idj-0-JYrL8dtVBrYes9JHvP4I3FnbuRBoz6cmyftR4L5gQ-tzC2YTBr_Bjc4T7_c-nqIMtmAO4YqG8AV9UKuvV7UvGbVuHjVl-mdYNuTOX66tbyq-YioJxxtn30D99VgX4qClVeF0ZgnImJ8-1-4DKHLGR&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "Lateral Partners & Counsel", "summary": "We work with law firm partners, counsel, and senior associates with a book of business to evaluate their platform and identify opportunities to leverage their…", "company": "Pollack Badawi Group", "location": "Washington, DC 20037 (Foggy Bottom area)", "job_description": "We work with law firm partners, counsel, and senior associates with a book of business to evaluate their platform and identify opportunities to leverage their practice at the platform that is best for them. Whether it’s a smaller, regional firm or an international, AmLaw 200 firm, our team is has the network and insights into the DC market that allow us to identify the opportunities that work best for each candidate. Contact us for more information.", "url": "https://www.indeed.com/viewjob?jk=c2e5168c513ffc56&from=serp&vjs=3"},
{"job_title": "newQuality and Engineer", "summary": "Position Overview: *The Quality and Engineer's responsibilities include designing quality standards, inspecting materials, equipment, processes, and products,…", "company": "NRP Jones LLC", "location": "Nephi, UT 84648", "job_description": "Position Overview: The Quality and Engineer's responsibilities include designing quality standards, inspecting materials, equipment, processes, and products, developing quality control systems, and determining corrective actions. You will also work with managers and supervisors to implement quality measures.Essential Job FunctionsSet detailed guidelines on what needs to be checked and what the quality standards are.Update our Quality Management System (QMS) with incidents, fixes and improvements.Audit our systems based on ISO 9001:2015 and API Q1 requirementsDetermine quality metrics for all manufacturing proceduresMonitor the production cycle and perform regular tests to identify potential malfunctions as early as possibleInspect product materials for defects and durabilityIdentify the root cause of technical issues and recommend fixesPrepare reports on malfunctions and corrective actionsReview current blueprints and quality documentationSet and track quality assurance goalsCoordinate with external quality assurance auditors and technicians to ensure legal complianceWork with internal teams to increase customer satisfaction by improving the quality of the productsProvide Engineering 3D Design Support and Engineering DrawingsOther duties as assignedQualificationsPrevious work experience as a Quality Engineer or similar roleHands-on experience with Quality Management Systems (QMS) and testing methodologiesIn-depth understanding of technical documentationFamiliarity with statistical analysisGreat attention to detail and problem-solving abilitiesProficient in 3D CAD Modeling and the creation of Engineering DrawingsMinimum Bachelor’s Degree in Engineering or Related FieldProficient in technical writingThe above job description is not intended to describe, in detail, the multitude of tasks that may be assigned but rather to give the associate a general sense of the responsibilities and expectations of his/her position. As the nature of business demands change so, too, may the essential functions of this position..­­Job Type: Full-timePay: $80,000.00 - $100,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceFlexible scheduleHealth insuranceLife insurancePaid time offVision insuranceSchedule:10 hour shiftMonday to FridayWeekend availabilitySupplemental Pay:Bonus payAbility to commute/relocate:Nephi, UT 84648: Reliably commute or planning to relocate before starting work (Preferred)Experience:ISO 9001: 1 year (Preferred)Work Location: One location", "url": "https://www.indeed.com/viewjob?cmp=NRP-Jones-LLC&t=Quality+Engineer&jk=d6d14037efde6255&vjs=3"},
{"job_title": "Guidance Clerk", "summary": "Prepares records for new students, secures I.D. number, sends student to appropriate counselor for schedule, requests records and/or transcripts from previous…", "company": "Florence School District 1", "location": "Florence, SC 29506", "job_description": "TITLE: High School Guidance Secretary\nQUALIFICATIONS:\n 1. High school diploma.\n 2. Some specialized training in secretarial skills.\n 3. Prodicient in use of computer for word processing, spreadsheet, etc.\n 4. At least two years of generqal office experience.\n 5. Excellent communication and interpersonal skills.\n 6. Demonstrated aptitude for successful completion of the performance responsibilities listed below.\nREPORTS TO: Principal\nJOB GOAL: To assist and manage clerical tasks for guidance counselors so that maximum time may be devoted to guidance and counseling.\nPERFORMANCE RESPONSIBILITIES:\n 1. Acts as receptionist for guidance office, answering telephones, greeting guests, etc.\n 2. Prepares records for new students, secures I.D. number, sends student to appropriate counselor for schedule, requests records and/or transcripts from previous school.\n 3. Assists with college testing information and collection of fees for these tests.\n 4. Sends transcripts for students transferring or to college as requested.\n 5.Updates permanent records on students who have dropped out or transferred and sends to the District Office.\n 6. Assists seniors with college applications, scholarship applications, transcripts, etc.\n 7. Prepares reports for the counselors such as College-Freshman, progress reports, etc.\n 8. Assists counselors in calculating GPRs and ranks.\n 9. Sets up parent/counselor conferences.\n 10.Closes out graduate files and send to the District Office according to policy.\n 11.Other duties as requested.\nTERMS OF EMPLOYMENT: 200 day work agreement. SC30 Salary scale. Salary and work year to be established by the district.\nEVALUATION: Performance of this job will be evaluated in accordance with provisions of the Board's policy on evaluation of classified personnel.", "url": "https://www.indeed.com/viewjob?jk=3aa975db306c0edb&from=serp&vjs=3"},
{"job_title": "Energy Associate (Junior to Midlevel)", "summary": "Our lawyers and legislative advisors serve domestic and international clients in all areas of corporate and business law, complex litigation, intellectual…", "company": "Venable LLP", "location": "Washington, DC", "job_description": "Venable LLP’s Energy Group seeks a junior to midlevel associate with a minimum of three years of experience to join the practice in the Washington, D.C. office.\n\nThe qualified candidate has experience litigating before the Federal Energy Regulatory Commission (FERC) including enforcement defense. Experience counseling clients in the oil and natural gas industry preferred. The successful candidate has excellent oral and written communication skills, and outstanding academic credentials. Candidates must hold a juris doctorate degree from an accredited law school and be admitted to and in good standing with the D.C. Bar. Please include law school transcripts with submissions.\nVenable LLP is an American Lawyer Global 100 law firm headquartered in Washington, D.C., with offices in California, Delaware, Illinois, Maryland, New York, and Virginia. Our lawyers and legislative advisors serve domestic and international clients in all areas of corporate and business law, complex litigation, intellectual property, regulatory matters, and government affairs. Additional information can be found at Venable.com.\n\nVenable LLP is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, age, protected Veteran status and any other protected basis under applicable law.\n\nContact:\nVictoria Sievers\nSenior Manager of Associate Recruiting\nVKSievers@venable.com", "url": "https://www.indeed.com/viewjob?jk=75860c2448f6e4c9&from=serp&vjs=3"},
{"job_title": "newManufacturing Engineer", "summary": "The Manufacturing Engineer (contract/outsourced manufacturing) identifies and implements manufacturing processes, procedures, and projects focused on minimizing…", "company": "Hunter Industries", "location": "San Marcos, CA 92078", "job_description": "We are a global leader in the irrigation, outdoor lighting, dispensing technology, and custom manufacturing industries. Driving our continued success is the combined energy and talents of the nearly 3,000 people on our team. Together, we create a diverse array of products that can be seen all over the world, from residential landscapes to national landmarks, stadiums, parks, hotels, and municipal buildings. Although we’re global, we’re family owned, and our casual, fun, and caring company culture is what makes this a special place to work. As we grow, we are dedicated to preserving our unique culture that makes our employees proud to work here. Whether you’re pursuing a career at our headquarters in Southern California, or an opportunity at one of our state-of-the-art manufacturing facilities, or something somewhere in between, we look forward to welcoming you to Hunter Industries and our Family of Companies.About This Role: The Manufacturing Engineer (contract/outsourced manufacturing) identifies and implements manufacturing processes, procedures, and projects focused on minimizing product cost, improving product quality, and maintaining product availability for assigned product lines with our contract manufacturers. S/he works on projects across multiple departments that are aligned with the organization’s strategic objectives.Demonstrates behavior that is consistent with the company’s values of Customer Satisfaction, Innovation, Family, and Social Responsibility.Essential Job Functions/Tasks: Responsible for the resolution of manufacturing issues of assigned product lines that affect product quality and/or availability. Develops and coordinates the necessary processes and sustaining engineering protocols to ensure manufacturing operational efficiencies. Maintains manufacturing-related documentation and production reports that define key metrics and outline current activities.Uses lean manufacturing practices and Six Sigma methodology to evaluate and improve assembly line performance per established key performance indicators. Implements improvement processes to ensure that projects are justifiable, on schedule and within budget.Manages progress of new and modified molds and assembly equipment for assigned product lines throughout qualification process. Ensures that the mold/assembly equipment meets established manufacturing capacity and utilization requirements.Provides manufacturing engineering support for complete integration of new products into full production per the organization’s New Product Development and Introduction (NPDI) process. Provides focus on delivering a repeatable process with high quality yield. Supports the concurrent engineering effort on behalf of manufacturing as a member of the product development team.Maintains updated capacity models for both injection molds and assembly equipment for assigned product lines. Submits capital requests as required to ensure timely completion of equipment to meet forecasted production. Provides capital requirements for annual budgeting process.Leads or supports cost reduction projects including qualification of new vendors for materials or parts. Participates in test plan development and execution.Education/Training Required and Preferred: Bachelor’s degree in related engineering discipline.Experience Required and Preferred: Minimum 3 years of engineering experience within a manufacturing organization.Knowledge of the practical application of engineering science and technology. Knowledge of LEAN Manufacturing & Six-Sigma methodology techniques and how to apply them in the manufacturing environment.Ability to speak and write effectively as appropriate for the needs of the audience. Excellent written and verbal communication skills in the English language, with strong report-writing and presentation skills.Excellent computer knowledge, including strong proficiency in Microsoft Office programs.Strong logic and reasoning skills to identify the strengths and weaknesses within processes.Excellent organizational and time management skills, and the ability to work within time lines.Excellent judgment and decision-making skills, with the ability to consider the relative costs and benefits of potential actions to choose the most appropriate one.Must be able to travel domestically and internationally, and work flexible hours to visit supplier facilities worldwide. Ability to obtain a valid passport if necessary.Knowledge of assembly of electronics and injection molded plastic components preferred.Knowledge of SPC, FMEA, DOE and process capability studies preferred.Experience with irrigation products or industry preferred.Follow us on LinkedIn, check out our rave reviews on Glassdoor, and learn more about our company culture on our career site: http://corporate.hunterindustries.com/careersHunter Industries and its Family of Companies is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, disability, gender, gender identity or expression, military and veteran status, national origin, race, religion, sexual orientation, or any other applicable legally protected status or characteristic.Job Type: Full-timePay: $85,000.00 - $100,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceFlexible spending accountHealth insuranceLife insurancePaid time offTuition reimbursementVision insuranceSchedule:Monday to FridaySupplemental Pay:Bonus payAbility to commute/relocate:San Marcos, CA 92078: Reliably commute or planning to relocate before starting work (Preferred)Education:Bachelor's (Required)Work Location: One location", "url": "https://www.indeed.com/viewjob?jk=35f694d3a706cc3b&q=Engineer&l=USA&from=web&advn=7837815445639312&adid=383558694&ad=-6NYlbfkN0BzxEHwB1wmEMmaBJocLQ_6hiEl7jq38z19_yNzAtn1xMoj6ylLS53L4SYBNILqvtMh-CiB2bVpAmPrJRUXe-yGER-OwWrnsZQtjZYKB_BpWMoGHqknlIPEa4Gn9ULokZdIOl07AujIpLMiFYWsijGbjlhKSxK7MmW181SQsfGUKBJusl7hp4p8CsPftXHgi-qTOiZkrgnJslB1YzeeQSRTuYqv68UvdanswJ5F-kFfFCxX3Fl9aNBQqOtQXi_mfnJj9QEIXkkBKcik0aN8kczqZbxCLKda750WW43FsqL1QxcU9CJ9G2ztRCLwH8q1XAwVhrhdEwHVxD35It1c6LiOxe3zLhxCjAWaPpJnFQgYveXnh-_Uofhx&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "newCashier", "summary": "These programs include: - Competitive pay - Sick time plan that you can use to support you or your immediate families health - Opportunities for career growth -…", "company": "Sprouts Farmers Market", "location": "Clovis, CA 93612+126 locations", "job_description": "Job Introduction:\nDo you enjoy meeting and talking to new people? Does being the face of a company excite you? Do you have a passion for delivering an extraordinary customer service experience while working in a fast paced and friendly environment? If the thought of helping people make healthy choices in one of the fastest growing retailers is up your alley – then we need YOU to join our winning team at Sprouts Farmers Market as a Cashier!\nOverview of Responsibilities:\n\nAs a Cashier at Sprouts Farmers Market, you are the face of the company while you process each customer’s order quickly, accurately, and efficiently while ensuring complete customer satisfaction through prompt and friendly service. As a Cashier, Sprouts Farmers Market looks to you to accurately handle customer cash, credit/debit payments, and change, and assist customers by providing information and resolving their complaints. Following all front end procedures, assisting with stocking shelves, facing and dusting as needed are all a part of the day for a Sprouts Farmers Market Cashier. A Cashier maintains knowledge of weekly ad items, gives customers direction of product location throughout the store, is familiar with events and seminars going on or coming up, and maintains excellent communication with front end manager and Head Cashier at all times. A Cashier is expected to ensure that checkout areas are properly maintained in a clean and orderly condition at all times, and execute all other related duties as assigned.\n#li-dni\nQualifications:\n\nTo be a Cashier at Sprouts Farmers Market you must:\nBe at least 18 years of age and have a high school diploma or equivalent, and 1-2 years of recent cashiering experience.\nHave and show an outgoing and friendly behavior, a positive attitude and the ability to interact with our customers.\nAbility to operate front end equipment; register, calculator, scanner.\nBe dependable and reliable having the ability to work a flexible schedule that changes as the business changes; including nights, weekends and holidays.\nHave good communication skills; the ability to take direction/constructive criticism and participate in a team environment\nBe able to perform repetitious activities, and have the ability to multi-task, prioritize and stay organized.\nMust lift/carry product horizontally/vertically weighing up to 30 lbs., from 36” to 24”, for a distance up to 3 feet for up to 50 hours without mechanical assistance.\nMust use both hands to move grocery carts horizontally requiring a force up to 35 lbs., for a distance up to 4 feet for up to 50 hours.\nRequires strong attention to detail and proficiency with numbers; proficient in cash handling and mathematical skills; ability to read, write and count.\nBenefits: In addition to a rewarding career, Sprouts offers a comprehensive program to help support you and your family. These programs include: - Competitive pay - Sick time plan that you can use to support you or your immediate families health - Opportunities for career growth - 15% discount for you and one other family member in your household on all purchases made at Sprouts - Flexible schedules - Employee Assistance Program (EAP) Eligibility requirements may apply for the following benefits: - 401(K) Retirement savings plan with a generous company match - Affordable benefit coverage, including medical, dental vision - Paid parental leave for both mothers and fathers - Pre-tax Flexible Spending Accounts for healthcare and dependent care - Company paid life insurance and short-term disability coverage Why Sprouts:\n\nGrow with us!\nIf you have a passion for inspiring people and a flair for fresh food, consider applying for a job at Sprouts! With a focus on customer service, our neighborhood grocery stores offer high-quality, farm fresh produce, natural meats, plenty of scoop-your-own bulk goods and much more in a fun, friendly, old-fashioned farmer’s market setting. Come grow your career in healthy living with a fast-paced, rapidly growing company and teams that pride themselves on empowering others along their journey.\nThe above statements are intended to describe the general nature and level of the work being performed by people assigned to this work. This is not an exhaustive list of all duties, responsibilities, and requirements. Sprouts’ management reserves the right to amend and change duties, responsibilities, and requirements to meet business and organizational needs as necessary.\nCalifornia Residents: We collect information in accordance with California law, please see here for more information.", "url": "https://www.indeed.com/viewjob?jk=20b787b0dfee0254&from=serp&vjs=3"},
{"job_title": "newMaterial Science Engineer Staff", "summary": "Support manufacturing in evaluating material compatibility issues in manufacturing processes and work with engineers and scientists to troubleshoot and…", "company": "Roche", "location": "Tucson, AZ", "job_description": "Summary\nEmploy diversified knowledge of material science and engineering principles to study material and chemical interaction problems in complex systems involving hardware, chemicals and reagents. Assess material compatibility risks using analytical, instrumentation and simulation tools and work with engineers and scientists to mitigate material compatibility risks by deploying engineering and scientific solutions. Work with internal and external experts to perform and set up material compatibility testing with materials/chemicals of various hazards and toxicity levels. General responsibilities include material compatibility risk assessment, prediction of material compatibility issues, material testing to assess performance against specification, assessment of system interactions and participation in design reviews. Make independent decisions. Support manufacturing in evaluating material compatibility issues in manufacturing processes and work with engineers and scientists to troubleshoot and determine root causes.\nResponsibilities\nPractices, mentors and develops company concepts, policies and procedures, familiar with and follows standard practices\nApplies functional expertise at a level to make significant company contributions\nProject goals are broadly defined; defines project milestones; responsible for timely project completion\nMakes major contributions to strategic directions and projects through knowledge of technology and its creative applications\nDrives activities for publication and/or patent potential\nConceives, plans, and executes projects related to the strategic needs of the company\nDesigns and executes experiments to test hypothesis related project outcomes; extracts the full relevance of technical observations\nApplies advanced technical knowledge to multi-disciplinary projects\nAssures experimental quality through sound experimental design; utilizes DOE; assists in the design of experiments for others\nParticipates or leads cross functional technical teams\nDevelops and maintains internal and external contacts to maintain technical knowledge\nTrains others using a variety of methods on the theoretical and practical basis of techniques, processes and products\nParticipates or leads in project planning, process updates and contributes to experimental design\nPresents results of projects both internally and externally\nReviews and critiques presentation for others; presents complex technical data to large and diverse groups\nMonitors work to ensure quality, and continuously promote Quality First Time.\nQualifications\nEducation:\nBachelor's degree in Material Science / Engineering, Chemical Engineering or equivalent plus at least 12 years of relevant experience. Or Master of Science degree + 8 years, or PhD degree + 6 years.\nKnowledge, skills and abilities\nCommon and specialized materials, thermoplastics, metals, coatings, composites, elastomers, fluoropolymers, adhesives, etc., used within the industry for fluidics systems\nChemistry and Engineering knowledge of materials, as well as knowledge of classical mechanics (fluids, heat, mass, etc.)\nTissue engineering to support extractable & leachable evaluations\nISO/ASTM standard methods for evaluating materials and chemical compatibility, IEC & USP\nOperation of analytical instruments in lab environments and analyze data\nTechnical writing skills to produce test protocols, test reports and documents\nMicrosoft Office tools, statistical analysis (e.g., Minitab), Statistical Process Control (SPC), LabView\nCollaboration across complex projects with ambitious milestones in high pressure circumstances\nExcellent verbal and written communication.\nWho we are\nAt Roche, more than 100,000 people across 100 countries are pushing back the frontiers of healthcare. Working together, we’ve become one of the world’s leading research-focused healthcare groups. Our success is built on innovation, curiosity and diversity.\nVentana Medical Systems, Inc. (Ventana), a member of the Roche Group, innovates and manufactures instruments and reagents that automate tissue processing and slide staining for cancer diagnostics. Our integrated staining, workflow management and digital pathology solutions optimize laboratory efficiency to reduce errors and support diagnosis for pathology professionals. Together with Roche, Ventana is driving personalized healthcare through accelerated drug discovery and companion diagnostics.\nUnless entitled to a reasonable accommodation under applicable law, employees are required to be fully vaccinated against COVID -19 in accordance with customer requirements, the company’s health and safety obligations and/or applicable law or guidelines.\nRoche is an equal opportunity employer and strictly prohibits unlawful discrimination based upon an individual’s race, color, religion, gender, sexual orientation, gender identity/expression, national origin/ancestry, age, mental/physical disability, medical condition, marital status, veteran status, or any other characteristic protected by law.\nIf you have a disability and need an accommodation in connection with the on-line application process, please email us at US.Accommodation@roche.com .\nJob Level:\nIndividual contributor", "url": "https://www.indeed.com/viewjob?jk=485a2ded5a80d0ac&from=serp&vjs=3"},
{"job_title": "newTransportation Security Specialist", "summary": "In cities across the country, you would secure airports, seaports, railroads, highways, and/or public transit systems, thus protecting America's transportation…", "company": "TSA (Transportation Security Administration)", "location": "San Francisco, CA+4 locations", "job_description": "Securing Travel, Protecting People - At the Transportation Security Administration, you will serve in a high-stakes environment to safeguard the American way of life. In cities across the country, you would secure airports, seaports, railroads, highways, and/or public transit systems, thus protecting America's transportation infrastructure and ensuring freedom of movement for people and commerce. For additional information about our agency please: Click Here\nRequirements\nConditions of Employment\nYou must possess U.S. Citizenship or be a U.S. National.\nYou must be able to obtain and maintain a Secret Clearance.\nMust pass pre-employment drug screening AND random drug/alcohol testing.\nYou must submit a Bomb Disposal Graduation/Certification certificate.\nSelective Service registration is required.\nSee \"Conditions of Employment\" and \"Other Information\" sections.", "url": "https://www.indeed.com/viewjob?jk=ba2e8e92d51a3666&from=serp&vjs=3"},
{"job_title": "Manufacturing Engineer", "summary": "This is a Hands-On position focused on lean / continuous improvement initiatives covering Plastic Injection Molding, Clean Room Assembly, Pad Printing and…", "company": "Forum Plastics LLC", "location": "Waterbury, CT 06705", "job_description": "Forum Plastics LLC is seeking an energetic driven Manufacturing Engineer to lead our manufacturing floor Continuous Improvements. This is a Hands-On position focused on lean / continuous improvement initiatives covering Plastic Injection Molding, Clean Room Assembly, Pad Printing and Automation. The successful candidate will have the responsibility of analyzing the current manufacturing state and formulating action plans through known Lean techniques that drive faster changeovers, reduce errors, standardize processes, reduce down time and increase OEE. The ideal candidate will have a strong desire to learn, have a problem-solving mentality, continually look for the next challenge and be respectful to others. In this position, you will:Manage Continuous Improvement Projects, lead projects, provide status updates, completes action items, sets goals, establishes priorities, manages project resources, develops concepts and action plans.Project management programs as assignedLeverage Lean principles to assist in the design and execution of new manufacturing processes, methodologies and equipment layouts to improve overall equipment effectiveness.Evaluate where the plant is in relations to goals and adjust action plans accordingly.Possess a good understanding of Lean principles and tools and a working knowledge of the Manufacturing / Injection Molding floor.Analyze Process flow and value stream layouts and provide recommendations for improvement.Perform analyses of systems and business processes to identify, recommend and implement modifications that will improve efficiencies and overall plant performance.Improve & Optimize manufacturing processes and equipment.Problem solves product non-conformance including investigating and eliminating root cause and effect.Understand process and equipment limitations and improve manufacturing efficiencies.Participate in developing and improving Technical Operating Instructions.Design and implement new manufacturing processes and equipment including documentation and training.Support new automation and provide lead support once launched into productionBeneficial Skills and ExperienceBachelor’s Degree in Engineering or Manufacturing field.3 to 5 years of actual manufacturing engineering experience in a manufacturing facility is required.Six sigma training and experienceOwnership and accountability for areas of responsibility is essential.Ability to communicate with all levels of the organization is essential.Ability to develop and manage project timelines and cost budgets is essentialExperience working with plastic injection moldingStrength and/or proven aptitude to acquire skills in use of software such as Excel, Word, PowerPoint, Project, Solidworks.Experience supporting automation projects, PLC programming is a plusJob Type: Full-timePay: From $75,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceDisability insuranceEmployee assistance programHealth insuranceLife insurancePaid time offProfessional development assistanceRetirement planVision insuranceSchedule:Monday to FridaySupplemental Pay:Bonus payCOVID-19 considerations:Employees and visitors wearing masks to help reduce the exposure.Installed plexiglass partitions around all cubicles and common areas.Hired additional cleaning staff.Entire facility sprayed weekly w/ hospital grade disinfectant.Education:Bachelor's (Required)Work Location:One locationWork Remotely:NoWork Location: One location", "url": "https://www.indeed.com/viewjob?jk=09453d78276c28d6&q=Engineer&l=USA&from=web&advn=7958816905710960&adid=374346631&ad=-6NYlbfkN0AsAJHops4nfw0SUMQFtbMufpQ2mN1HWl6iv2qPXHtBtLx_RnEyv39BlK9v4qDwvFlHmFQlZulgTays4fLKiucl2GDPzN9Xn72uIrsns_lTNpYYD3UiSdRzuQ5Bnmg8qyZZA2teOvd9RAqusCj26y96jRqIxyztL9hVjLTN33A4gsSj8lmzawaOe4-PmsUR6ogxkzze2yj7XZ4b3Bg6AnaAOkUJICgGlOuuaj8L4YeOGtNBT8g_x9_WgqYNjinyrS7NyeO0kev9g0Uv44jCBw-KvUxA04XvVlBTToePLiidgPyVWyw4S_JziNouFp-3lqe865qd9VerhGv5Il8x_MJvbCjU656cCWRPOulIdHBjAXHkQOCQ1BcKoRHB4f37iUY%3D&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "newShipping/Receiving Supervisor - Up to $68,000", "summary": "Basic salary of $62,000/year.\nPlus 10% profit share every year-end – estimated extra $6,000-$7,000/year.\nWe reward top performance with additional compensation…", "company": "Echelon Industrial", "location": "Columbus, OH 43217 (South Central Accord area)", "job_description": "SHIPPING/RECEIVING SUPERVISOR — Up to $68,000We are a Fortune 200 company distributing IT products, services, and solutions to customers worldwide.We have an exciting opportunity for a full-time Shipping and Receiving Supervisor to join our growing team of elite professionals.Come develop your skills with a company that truly cares about your development.If you’re interested in learning more, we want to meet you!Please apply today.COMPENSATION & BENEFITSBasic salary of $62,000/year.Plus 10% profit share every year-end – estimated extra $6,000-$7,000/year.Full medical benefits.We reward top performance with additional compensation and responsibility.OUR IDEAL CANDIDATEExperienced in warehousing or logistics.Possess strong leadership skills.Monday to Friday, 7AM-3PM.APPLY TODAY!This position will be filled quickly, so please apply today.A real human—not a computer program!— will read your application.Our hiring manager, Kiko San Pedro, will respond within 48 hours to tell you all about the hiring company and answer your questions so you can determine if this is a career you’d like to pursue.Even though we focus on military Veterans, this position is open to everyone.Job Type: Full-timePay: From $62,000.00 per yearSchedule:Monday to FridayWork Location: One location", "url": "https://www.indeed.com/viewjob?cmp=Echelon-Industrial&t=Shipping+Receiving+Supervisor&jk=bfc52431db68aee0&vjs=3"},
{"job_title": "newSocial Services Team Lead", "summary": "See MSPB Careers for information regarding this classifications.", "company": "Mississippi State Personnel Board", "location": "Jackson County, MS", "job_description": "Characteristics of Work\nSee MSPB Careers for information regarding this classifications", "url": "https://www.indeed.com/viewjob?jk=9fbd5edb967d0760&from=serp&vjs=3"},
{"job_title": "Studio Engineer", "summary": "Assist clients with podcast and vocal recording/editing and musical productions.\nAbility to record and edit vocals and visuals.", "company": "Executive Bre Productions", "location": "Atlanta, GA 30303 (Downtown area)", "job_description": "Assist clients with podcast and vocal recording/editing and musical productions.RequirementsPrevious Audio Engineering experiencePrevious Customer service experienceAbility to record and edit vocals and visualsAbility to learn and master recording softwareAbility to Mix and Master projectsMusical KnowledgeFlexible ScheduleJob Type: Full-timePay: $30.00 - $50.00 per hourSchedule:8 hour shiftOn callWeekend availabilityExperience:Audio Engineering: 1 year (Preferred)License/Certification:Professional Engineer (Preferred)Shift availability:Day Shift (Preferred)Night Shift (Preferred)Overnight Shift (Preferred)Work Location: One location", "url": "https://www.indeed.com/viewjob?cmp=Executive-Bre-Productions&t=Studio+Engineer&jk=4233ea4a6677f154&vjs=3"},
{"job_title": "COVID-19 Test Site Data Entry", "summary": "Ability to establish and maintain positive and effective work relations.\nBoynton conducts significant outreach efforts including student-led health promotion in…", "company": "University of Minnesota", "location": "Minneapolis, MN", "job_description": "Required Qualifications:\nDemonstrated commitment to promoting a culture that respects and advances diversity and inclusion.\nExcellent communication skills\nAbility to adapt in a fast paced environment\nPreferred Qualifications:\nOpen to communicating with individuals from a variety of cultures\nAbility to establish and maintain positive and effective work relations\nAbility to take initiative and work autonomously, as appropriate\nExperience working with individuals from diverse racial, ethnic, and socioeconomic backgrounds.\nPhysical and Environmental Conditions:\nMust be mobile, ability to sit, stand.\nAbility to read printed and electronic information.\nCommunicate effectively in English using oral, written, electronic and visual forms of interaction.\nGeneral Statement of Responsibilities:\nThe COVID-19 Testing Site Data Entry Specialist at Boynton Health works at the University of Minnesota campus wide testing site. As a COVID-19 Testing Site Data Entry Specialist, you will chart in an Electronic Health Record. You will handle lab specimens while wearing PPE. You are a key player on a team that is delivering high quality, multicultural health care to the University’s diverse population.\nDetailed Job Responsibilities:\nMaintain a respectful work environment.\nProvide quality, competent care in a customer friendly manner.\nEfficiently and accurately record Electronic Health Record information.\nHandle and label lab specimens\nParticipate in the daily set-up and tear down of the testing site.\nProvide necessary information to patients.\nAttend trainings as needed.\nPerform other duties as assigned\n**This description lists the major duties and requirements and is not all-inclusive. The employee may be expected to perform related duties and may be required to have specific job related knowledge and skills\nAbout Boynton Health, Nursing\nBoynton.umn.edu\nBoynton Health, a nationally recognized leader in college health, is transforming health and academic success for students. Our mission is to create a healthy community by working with students, faculty and staff to achieve physical, emotional and social well-being. Boynton provides comprehensive health care to students, faculty and staff. Boynton conducts significant outreach efforts including student-led health promotion in the areas of sexual health, nutrition and stress management. It conducts a comprehensive survey of college students to give postsecondary institutions a look at the health of their students. And it conducts community-based public health initiatives to support the health of everyone on campus.\nApplications must be submitted online. To be considered for this position, please click the Apply button and follow the instructions. You will be given the opportunity to complete an online application for the position and attach a cover letter and resume.\nAdditional documents may be attached after application by accessing your \"My Job Applications\" page and uploading documents in the \"My Cover Letters and Attachments\" section.\nTo request an accommodation during the application process, please e-mail employ@umn.edu or call (612) 624-UOHR (8647).\nThe University recognizes and values the importance of diversity and inclusion in enriching the employment experience of its employees and in supporting the academic mission. The University is committed to attracting and retaining employees with varying identities and backgrounds.\nThe University of Minnesota provides equal access to and opportunity in its programs, facilities, and employment without regard to race, color, creed, religion, national origin, gender, age, marital status, disability, public assistance status, veteran status, sexual orientation, gender identity, or gender expression. To learn more about diversity at the U: http://diversity.umn.edu.\nAny offer of employment is contingent upon the successful completion of a background check. Our presumption is that prospective employees are eligible to work here. Criminal convictions do not automatically disqualify finalists from employment.\nThe University of Minnesota, Twin Cities (UMTC)\nThe University of Minnesota, Twin Cities (UMTC), is among the largest public research universities in the country, offering undergraduate, graduate, and professional students a multitude of opportunities for study and research. Located at the heart of one of the nation's most vibrant, diverse metropolitan communities, students on the campuses in Minneapolis and St. Paul benefit from extensive partnerships with world-renowned health centers, international corporations, government agencies, and arts, nonprofit, and public service organizations.", "url": "https://www.indeed.com/viewjob?jk=68846d798e316ef0&from=serp&vjs=3"},
{"job_title": "Production Supervisor", "summary": "Provide supervision to the hourly workforce to ensure the safety, quality, cost and productivity goals are met.\nExecute the daily work schedule.", "company": "US Brick Holdings, LLC.", "location": "Columbia, SC+1 location", "job_description": "Position Overview: Provide supervision to the hourly workforce to ensure the safety, quality, cost and productivity goals are met. Coach, mentor and develop team members to meet current and future business requirements.Responsibilities: · Plan and manage the day to day allocation of resources (equipment, people, materials and systems) in order to efficiently, safely and cost effectively achieve performance targets. Execute the daily work schedule.· Champion and lead change initiatives and continuous improvement efforts, including the pursuit of continuous improvement· Review overall line effectiveness and recommend and drive measures to improve production methods, equipment performance, and quality of product.· Understand and adhere to internal and external regulations, procedures & policies. Ensure that a high quality of products, housekeeping and safety standards are maintained.· Operate within effective standard operating procedures (SOPs) to support employee safety, quality, asset effectiveness, and workplace organization.· Oversee department specific operations as necessary to promote and maintain a clean and safe environment.· Provide employee coaching, mentoring and training to ensure that employees are performing job responsibilities effectively. Provide leadership for assigned production personnel to achieve their specific goals and objectives via continuous process improvement.· Ensure employee engagement, training, and development to maximize safety, quality, and productivity and ensure all quality standards, specifications and policies are met or exceeded.· Evaluate subordinate performance, communicate with employees, and provide information for work performance improvement.· Create and maintain a safe and positive work environment for all employees. Maintain safe environment and safety practices in all business initiatives. Proactively participate in and promote safety initiatives in the plant.· Respond to employee concerns and / or issues in a timely manner.· Attend production and shift review meetings and complete daily paperwork· Ensure all daily manufacturing documents are completed and accurate.· Complete monthly training and Safety Activities.· Engagement in plant Continuous Improvement efforts. Identify improvement opportunities· Contributes to team effort by performing other assigned duties as needed.· Maintains cooperative relationship with coworkers and other leaders by communicating necessary information, responding to requests, building report; and participating in problem solving methods.Job Type: Full-timePay: From $70,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceHealth insuranceHealth savings accountLife insurancePaid time offReferral programVision insuranceSchedule:8 hour shiftEducation:High school or equivalent (Preferred)Work Location: One location", "url": "https://www.indeed.com/viewjob?cmp=US-Brick-Holdings,-LLC.&t=Production+Supervisor&jk=659b9d0fb5729c0e&vjs=3"},
{"job_title": "Operations Manager", "summary": "Must be able to lift up to 50lbs.\nYour shoes were likely made in China.\nHave you ever wondered how they got to your local retailer?", "company": "Maersk", "location": "South Gate, CA 90280+12 locations", "job_description": "Your shoes were likely made in China. Have you ever wondered how they got to your local retailer? Or what’s in that shipping container going down your local highway?\n\n\nAt Maersk Distribution and Warehouse Services, we know. In fact, we facilitate the distribution and movement of freight every single day.\n\n\nEach of our client’s supply chain is evaluated to optimize efficiency from factory production, all the way to end user delivery. The goal is not only to minimize lead times but also to minimize inventory levels and costs, thus making the client's business more flexible.\n\n\nOur warehouse network spans from East to West Coasts of the United States and in Canada. Our services include transloading and automated sortation, cross-docking, replenishment, drayage management, and inland transportation.\n\n\nWe are looking for an Operations Manager to join our North America Warehouse and Distribution team.\n\n\nThis position will be based in Santa Fe Springs, CA.\n\nWe offer\nWe offer you an exciting global career at the forefront of world trade.\n\nWorking with the best people in a global team culture with future growth opportunities in an industry that has a significant impact on the world economy…\n\nWe’re proud of our people who define our company’s industry leadership, global team culture and customer-centric focus every day.\n\nWhen you join our team you join a truly diverse, global organization in a fast-moving, values-based, work environment where you can grow on the job, create and shape our digital solutions, tap into industry-leading talent development initiatives, enjoy working with your colleagues and broaden your world view through our international job postings. We offer competitive compensation and benefits for full-time employees including health, dental and vision insurance, a 401k savings plan with an employer match and paid time-off – and our parental leave policy is recognized world-wide as one of the best in the industry.\n\n\nGlobal scope\n\nEvery company, every country wants access to a competitive shipping, logistics and port system – and our people have created one company that offers one, easy-to-use solution to all their shipping needs.\n\n\nMaersk is unique\nMaersk is uniquely positioned to play a significant role in global trade, creating opportunities that help countries, companies and people succeed. Our vision is simple: Maersk is the global integrator of container logistics, connecting and simplifying our customers’ global supply chains. We do this through the global scale of Maersk, the world’s largest shipping line; our Logistics and Services expertise that help customers manage their global supply chains; and through our port operator, APM Terminals, one of the largest container terminal operators in the world with the most strategic locations to serve global supply chains.\n\nKey responsibilities\nThe Operations Manager (OM) is responsible for operations within the facility. This includes being accountable for the business operations, establishment of production standards and operations/services provided within the facility. This position is also responsible for managing, evaluating and mentoring Assistant Managers, Supervisors and Associates. Accurate and timely tracking of internal and external reports including, but not limited to, safety, production, resource allocation, cost and load/unload accuracy is part of the required key performance indicators. The ability to solve problems and articulate issues with both senior managers and direct reports is essential.\nOversee and direct the facility operations to achieve the highest level of safety, productivity, and customer service with a focus constantly on cost and efficient use of laborUnderstand and uphold financial responsibility for the daily production and labor (P&L) and train direct reports on understanding the P&LCommunicate Company information, goals and objectives within the Operations teamEnsure safety policies and practices are being adhered to and are fundamental to the Company cultureEnsure work procedures and work schedules are being adhered to and that corrective action is being taken within the facility operationsPromote collaboration within facility teams to work to provide creative and innovative ideas to improve operational productivity while maintaining a safe work environmentParticipate and/or represent Maersk Warehouse and Distribution (WND) within various operations, safety, and labor related meetingsEnsure Foremen and Assistant Managers are submitting timely and accurate reports, billing and labor payroll\nResponsible for oversight of safe and efficient use of facility equipment, which are monitored daily by Foremen and Assistant ManagersEffectively communicate with other departments and managers to ensure the efficiency of the facility as a wholeHave constant dialog with the Assistant Managers and Supervisors on daily operational issues and events, in their absence report the same information to the Facility ManagerMeet customer and Company key performance metrics, goals and objectivesResponsible to cross train management staff as well as warehouse associatesFoster team environment within the facility and demonstrate strong leadership skillsManage, evaluate, develop, and mentor Assistant Managers and SupervisorsSupport the commitment to the Company’s Core ValuesCoordinate with Managers and Human Resources to ensure adherence to Company policies and proceduresPerform other job-related duties as required\n\nWe are looking for\nQualifications:\n\n5+ years logistics experience in a warehouse setting\n2+ years logistics supervisory experience in a warehouse setting\nHigh School Diploma or G.E.D. required. College degree preferred but not requiredMust be able to work 2nd shift.Intermediate-Advanced proficient with systems (i.e.: Microsoft products; warehouse management systems, etc)Must be able to lift up to 50lbs\nSoft Skills:\nStrong candidates are assertive, adaptable and resilient\nMust be a self-starter, resourceful, solution-orientedStrong multi-tasking and problem-solving abilities\nExcellent verbal and written communication skillsTeam player attitude\nPreferred Qualifications (nice to have)\n1+ years’ 3PL (Third party logistics) experience\n1+ years’ Sortation and Automation experienceExperience with transloading, cross-docking, replenishment, drayage management, and inland transportation.Experience with agile methodologies and/or continuous improvement\n\nYou must be authorized to work for any employer in the US.\n\n\nLocal candidates only; no relocation assistance is provided.\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, disability, protected veteran status, sexual orientation or any other characteristic protected by law.\n\nA.P. Moller - Maersk is an integrated container logistics company working to connect and simplify its customer's supply chains. As the global leader in shipping services, the company operates in 130 countries and employs roughly 70,000 people. With simple end-to-end offering of products and digital services, seamless customer engagement and a superior end-to-end delivery network, Maersk enables its customers to trade and grow by transporting goods anywhere - all over the world.\nUSA South Gate Local Supply Chain/Logistics Operations\nLast application date: 27/2/2022", "url": "https://www.indeed.com/viewjob?jk=2cc052192d26f686&from=serp&vjs=3"},
{"job_title": "newEngineer - Electrical", "summary": "To assist the Engineering/Maintenance Departments in start-up of new and troubleshooting of manufacturing equipment.\nFunction as a resource to hourly craftsmen.", "company": "Goodyear", "location": "Lawton, OK+2 locations", "job_description": "Location: US-OK-LAWTON-PLT-0153-2170\nGoodyear Talent Acquisition Representative: Heather Rodriguez\nSponsorship Available: No\nRelocation Assistance Available: Yes\n#LI-HR1\nPrimary Purpose of the Position:\nTo assist the Engineering/Maintenance Departments in start-up of new and troubleshooting of manufacturing equipment. Must be able to properly adjust, troubleshoot and repair all automatic, electronic, and electrical systems in a heavy manufacturing environment. Demonstrated ability to direct installation, programming PLC logic, AC and DC Drives installation, replacement and setup and all manner of upper level electrical devices for control.\nPrinciple Duties and Responsibilities:\nLearn and maintain a working knowledge of all equipment in the plant. Transfer that knowledge to hourly maintenance craftsmen to better enable them to repair/maintain plant equipment.Assist the Engineering Department in the start-up and troubleshooting of new and revised equipment. Function as a resource to hourly craftsmen. 20% Assist with revising, adapting, or redesigning components and/or systems that become obsolete. Assist with Installing, properly adjusting, troubleshooting and repairing all automatic, electronic and electrical systems.Implement processes & methods that meet internal & external customer requirements. Develop and implement machine technology upgrades to improve quality, productivity, and safety. Support the evaluation of products, processes, methods & obtain maximum results.\nEducation & Certifications:\nBachelors degree in Electrical Engineering\nExperience:\n(0-2 years) Training with PLC's, AC / DC Variable speed drives, Electronic Test Equipment, Mechanical Devices and Calibration of electronic devices. Functional knowledge of all voltages through 480v. required, with working knowledge through 4,600v. desired.\nKnowledge, Skills & Abilities:\nPC SkillsExcellent problem solving and troubleshooting skills.Self-motivated and willing to take initiatives with a positive attitude.Strong verbal and written communication skills and strong interpersonal skills.Ability to work in a team environment.Understanding of technical drawings & procedures (Auto CAD, Autodesk inventor).\nGoodyear is one of the world’s largest tire companies. It employs about 62,000 people and manufactures its products in 46 facilities in 21 countries around the world. Its two Innovation Centers in Akron, Ohio and Colmar-Berg, Luxembourg strive to develop state-of-the-art products and services that set the technology and performance standard for the industry. For more information about Goodyear and its products, go to www.goodyear.com/corporate.\nGoodyear is an Equal Employment Opportunity and Affirmative Action Employer. All qualified applicants will receive consideration for employment without regards to that individual's race, color, religion or creed, national origin or ancestry, sex (including pregnancy), sexual orientation, gender identity, age, physical or mental disability, veteran status, genetic information, ethnicity, citizenship, or any other characteristic protected by law.\nIf you need reasonable accommodation to complete the online application, or any other part of the employment process, please contact the Goodyear Candidate Care Line at 330.796.4500.\nClick here for more information about Equal Employment Opportunity laws, and here for additional supplementary information.", "url": "https://www.indeed.com/viewjob?jk=6cdfba53a0c7ab68&from=serp&vjs=3"},
{"job_title": "PRODUCTION SUPERVISOR - D SHIFT", "summary": "As the Production Supervisor, you would be responsible for coordinating and leading all aspects of the daily activities of your team.", "company": "Nike", "location": "Saint Charles, MO 63304", "job_description": "Become a Part of the NIKE, Inc. Team\nNIKE, Inc. does more than outfit the world’s best athletes. It is a place to explore potential, obliterate boundaries and push out the edges of what can be. The company looks for people who can grow, think, dream and create. Its culture thrives by embracing diversity and rewarding imagination. The brand seeks achievers, leaders and visionaries. At NIKE, Inc. it’s about each person bringing skills and passion to a challenging and constantly evolving game.\nAt Air Manufacturing Innovation (Air MI), we deliver on Nike’s most daring dream: giving every athlete the unparalleled sensation of walking on air. Since Nike introduced the Air sole in 1979, no technology has become more synonymous with Nike than Air. Our teams engineer, make and perfect Nike’s most advanced footwear components. Masters of teamwork, we challenge assumptions in order to get faster, drive efficiency and fine-tune technology to deliver quality performance plastic. At our state-of-the-art facilities located in Beaverton, Oregon and St. Charles, Missouri, Air MI is taking Air to places that we never thought possible. Learn more about Nike Air Manufacturing Innovation.\nWho we are looking for :\nAs the Production Supervisor, you would be responsible for coordinating and leading all aspects of the daily activities of your team.\nWhat you will be doing:\nYou would be responsible for maintaining a safe work environment and promoting a safe work culture. You would set priorities and coordinate the work activities to achieve operational goals and deadlines ensuring on time delivery of products to customers. You would be responsible for identifying, troubleshooting and resolving technical and operational issues. You would ensure departmental operational supply inventories are maintained. This role is responsible for supporting continuous improvements and promoting a lean manufacturing culture.\nSHIFT D: Friday- Sunday & every other Thursday 5:30pm-5:30am\n\n\nWhat you bring:\nBachelor’s degree or other manufacturing related degree with a minimum of 2-3 years’ experience in a leadership role or 2 additional years’ experience may be considered\nDemonstrated ability to make decisions and set direction\nExcellent Communication skills\nProven project management skills\nDemonstrated team building and leadership skills\nStrong technical expertise in a manufacturing environment\nExperience in LEAN Manufacturing or similar principles and practices\nAbility to work with stakeholders of all levels\n\nNIKE, Inc. is a growth company that looks for team members to grow with it. Nike offers a generous total rewards package, casual work environment, a diverse and inclusive culture, and an electric atmosphere for professional development. No matter the location, or the role, every Nike employee shares one galvanizing mission: To bring inspiration and innovation to every athlete* in the world.\nNIKE, Inc. is committed to employing a diverse workforce. Qualified applicants will receive consideration without regard to race, color, religion, sex, national origin, age, sexual orientation, gender identity, gender expression, veteran status, or disability.", "url": "https://www.indeed.com/viewjob?jk=e11445c5803725b8&from=serp&vjs=3"},
{"job_title": "Sales Associate/Cashier", "summary": "_We are currently looking for an outgoing, proficient, and detail-oriented Sales Associate and Cashiers to help assist us with customer accounts, transactions,…", "company": "NxtGen Acquisitions", "location": "Hallandale Beach, FL 33009", "job_description": "NxtGen Acquisitions is an advertising and consulting firm located in Halladale Beach, Florida. We aim to provide the best in customer service, planning and results for our clients. We are currently looking for an outgoing, proficient, and detail-oriented Sales Associate and Cashiers to help assist us with customer accounts, transactions, and customer relations.Sales Associate/Cashier Job Requirements: Must be personable, energetic, positive and enjoy working with people daily.Delivering sales, outstanding customer experience, and operational expectations.Work successfully in a team environment as well as independently.0-3 years of retail experience.Utilizing systems with points of sale and handling cash/credit transactions.Maintaining personal and productivity goalsProvide excellent Customer Service to clients and customers.Ability to learn and share expertise of products and trends to fit customer’s needs.Sales Associate/Cashier Qualifications/Requirements: Be able to work FULL TIME Hours (Monday-Friday).Thrive in dynamic and collaborative environment.Have reliable transportation to our office.At least 18 years of age.Previous experience in Retail or similar position (0-3 years required).We want to hear from you!Apply directly to this ad with a copy of your resume. If you are confident in your interpersonal skills and love working in a dynamic, fast paced environment.Job Types: Full-time, Part-timePay: $600.00 - $800.00 per weekSchedule:8 hour shiftMonday to FridayWork Location: One location", "url": "https://www.indeed.com/viewjob?cmp=NxtGen-Acquisitions&t=Sales+Associate+Cashier&jk=7d3b9cfcaab963db&vjs=3"},
{"job_title": "Cashier", "summary": "Provide excellent, consistent customer service.\nMaintain the Merchandising of Product Displays (different focus based on department).", "company": "Le District", "location": "New York, NY 10281 (Battery Park area)", "job_description": "Company Name: Le DistrictLocation: 225 Liberty Street Tower 2 New York, NY 10281Position: CashierJob Description: Seeking a few individuals to work at Le District’s Rotisserie departmentThe ideal candidates will have an outgoing personality, strong work ethic, and interested in interacting with customers.Job Duties:Provide excellent, consistent customer serviceMaintain the Merchandising of Product Displays (different focus based on department)Understand and maintain Le District's philosophy and aesthetic, including retail displays and signage; regularly check for qualityBe familiar with all equipment: POS systemMaintain cleanliness of work stationsPossess food handling skillsJob Requirements:Ability to stand for a minimum of 6 hoursFood Handling experience a plusOutgoing personalityBasic food prep knowledgePrevious experience as a Counter/Cashier/Retail requiredGood communication skillsGood organizational skills, and a sense of timingFlexible to work days, nights, weekends and holidaysTo Apply:Respond to this Job Posting with a resume in Word or PDF format.If chosen, you will be contacted by a Manager for an interview.Best of Luck,HRJob Types: Full-time, Part-timePay: From $17.00 per hourSchedule:Monday to FridayWeekend availabilityCOVID-19 considerations:All staff are required to be fully vaccinated per the NYC Mandate. This means you must have had 2 shots of a COVID vaccination.Education:High school or equivalent (Preferred)Experience:Cashiering: 1 year (Preferred)Work Location: One location", "url": "https://www.indeed.com/viewjob?cmp=Le-District&t=Cashier&jk=aaf1ab84cd06cd73&vjs=3"},
{"job_title": "Production Engineer", "summary": "Founded in 1950, Callon Petroleum Company is an independent oil and natural gas company focused on growing production and reserves from our oil-weighted, multi…", "company": "Callon Petroleum Operating Company", "location": "Hybrid remote in Midland, TX", "job_description": "Description:\n\nFounded in 1950, Callon Petroleum Company is an independent oil and natural gas company focused on growing production and reserves from our oil-weighted, multi-play, multi-pay assets in West and South Texas. Callon Petroleum is currently accepting resumes for a Production Engineer position based in the Midland, TX office. Callon Petroleum Company offers competitive pay, paid time off, paid holidays along with a benefits package including health, dental, vision, and life insurance.\nPosition Description:Create cost estimates and AFEs for workovers and well maintenance operations.Coordinate with Reservoir Engineers, Geologists, and Frac Specialists to optimize new well completions.Coordinate with Field Operations and Production Surveillance teams to optimize base production.Design, analyze and make recommendations to optimize artificial lift systems.Analyze well failures and make recommendations for optimization.Assist with chemical program remediation.Coordinate with Reservoir Engineers and Geologists in developing capital programs.Track and monitor capital spending to ensure compliance with capital budgets.Coordinate with Field Operations to develop LOE budget.Track and monitor LOE spending to ensure compliance with LOE budgets.Provide technical support to Field Operations, Drilling, Reservoir Engineering, and Geology.\n. Requirements:\nA minimum of a BS in EngineeringA minimum of 5 years industry experience, 7+ preferredAdvanced knowledge of gas lift, electric submersible pumps, rod pumping systems design and optimizationAdvanced knowledge of workover operationsStrong knowledge/and or experience with H2SStrong failure prevention skillsHorizontal and multiple stage completion experience preferredFamiliar with Industry Engineering software packages (i.e. Spotfire, Rodstar, etc.)Experience in Operations preferred – either as Engineer, Production Foreman or similarSelf-starter requiring minimal supervisionProven innovator, excellent collaborator and communicatorGood leadership skillsMust be able to work a partial remote schedule (3 days in the office and 2 days remotely) with the ability to transfer to an in-office schedule by 2022Meet and maintain eligibility requirements to drive a company vehicle.Must be able to work in the United States without the assistance of sponsorship.\nCallon Petroleum Company is an equal opportunity employer, and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity or expression, pregnancy, age, national origin, disability status, genetic information, protected veteran status, or any other characteristic protected by law.", "url": "https://www.indeed.com/viewjob?jk=8a1690fd3856ff86&from=serp&vjs=3"},
{"job_title": "newInside Sales Representative", "summary": "We offer a competitive salary and huge bonuses on sales.\nTop of the line sales tools, everything you need to succeed.\nAll of our Closers make 6 Figures and up.", "company": "River City Marketing", "location": "Remote", "job_description": "RCM is a Digital Marketing conglomerate that has been an industry leader for well over a decade. Our sales teams are well trained and well taken care of.Are you a seasoned Closer looking for your next big opportunity in Sales? Want to start making real money, working with real sales professionals?Come join the winning team, 10+ years of success and growth.Remote Position must have a proper home office or similar.Digital Marketing Agency seeks energetic and motivated Closers for full-time positions.We offer a competitive salary and huge bonuses on sales. All of our Closers make 6 Figures and up.What we are looking for:Someone who is highly money motivated, energetic, positive, and most of all coachable.Someone who can work full time 8am - 4pm PST, Monday - Friday.Someone who is tech savvy and knows how to use a computer well.An experienced Closer who is not afraid to ask for the close.Someone who can easily work remotely and has a remote workplace setup.Punctuality. Must be places when you say you are going to be there.Must be money motivated.This is a position with endless opportunities for growth! If you are highly motivated, energetic, and a team player then you will fit right in.Our Inside Sales Agents are responsible for educating potential clients on our services and signing them up for the right package. Being able to close a deal over the phone is a must, let us show you how!No Limit on Earnings or Commission - Aggressive Closers Make Huge Money Here.8am - 4pm PST Monday - Friday, No Weekends!We Offer:Full TrainingEasy to Use SoftwareTop of the line sales tools, everything you need to succeedScripts, Scripted Rebuttals, Tips and TricksGreat Hourly Pay and Huge BonusesA winning team atmosphereFriendly, collaborative atmosphere and cultureRCM is an Equal Opportunity Employer. We are committed to equal treatment of all employees without regard to race, national origin, religion, gender, age, sexual orientation, veteran status, physical or mental disability or other basis protected by law. This is a 1099 position.Job Type: Full-timePay: $60,000.00 - $210,000.00 per yearSchedule:8 hour shiftMonday to FridaySupplemental Pay:Bonus payEducation:High school or equivalent (Preferred)Experience:Sales Account Executives & Managers: 1 year (Preferred)Work Location: Remote", "url": "https://www.indeed.com/viewjob?cmp=River-City-Marketing&t=Inside+Sales+Representative&jk=7eba3df40182f2f6&vjs=3"},
