[
{"job_title": "Information Security Analyst - Remote", "summary": "Conduct annual/on-boarding information security and privacy training.\nModernize Litmus' library of information and documentation regarding Information Security,…", "company": "Litmus", "location": "Remote in Massachusetts+1 location", "job_description": "Who is Litmus?Litmus's email creation, testing, and analytics platform empowers marketers, designers, and agencies to confidently deliver quality, brand-aligned communications that delight and engage consumers. Over the last 10+ years, we've built a reputation as thought leaders and one of the most trusted solutions in the industry, and it shines through our customers – all 250,000 of them, representing the world's top brands in tech, banking & finance, retail, media, and more.And with our newest acquisition of Kickdynamic, an AI-driven content automation solution, we are now the leaders in email marketing personalization.How do we do this? It all starts with our people, and a core belief that the talent we seek should be a culture add rather than a \"culture fit\".What would I do at Litmus?This is an exciting opportunity to demonstrate knowledge gained and apply it in a dynamic, high-performing Information Security and IT team. In this role, you'll lead security efforts to maintain industry certifications, design and document solutions in support of company goals, and collaborate with internal teams regularly. In addition, you'll serve as a go-to resource for defining the implementation of technical compliance capabilities and lead efforts to provide transparency to customers, prospects, and other stakeholders.On any given day you might: Modernize Litmus' library of information and documentation regarding Information Security, Privacy, and TrustSupport Sales by responding to security questionnaires and meeting with customers as requiredOrganize, maintain, and update the internal Privacy Management System (SaaS asset inventory & risk assessments, Data Subject Requests)Effectively handle inbound information security questions via helpdesk, tickets, email, and SlackSupport projects and initiatives to improve security and privacy, including internal Information Security and Privacy auditsConduct annual/on-boarding information security and privacy trainingAssist in the development and execution of employee security awareness and training campaignsWork with IT to regularly audit user access and device controlsWhat is Litmus looking for in a candidate?A few years experience in Information Security or a related field; bonus if you have experience with SOC2 compliance and/or ISO certificationsKnowledge of GDPR, CCPA legislation and implementationHands-on experience in asset management software e.g. OneTrustOrganized and detail-oriented; important skills for maintaining records/evidence for auditsGreat communicator; you create clear and meaningful documentation just as well as you deliver security trainings across the organizationEager to collaborate with multiple teams including IT, Engineering, Site Reliability, and various non-technical departmentsIndustry knowledge of security and privacy frameworks and recommended controlsWhy should I choose Litmus?We offer everything you'd expect from a profitable company that's been going strong for 10+ years, including a great salary and stock options, comprehensive health care benefits, and a generous retirement plan matchYou'll receive 28 days of paid vacation—on top of team retreats and public holidaysA platform for good: Affinity Groups, a culture of Diversity, Equity & Inclusion, and volunteer days—creating belonging for all is in our DNA both inside and outside of work #bebeyondlitmusRemote-friendly culture. No matter where you are, you'll feel connected to the teamOver half of our employees work remotely in the U.S. and UK and your work experience is just as exciting, entertaining (!), and engagingWe take family seriously and offer flexible schedules and generous parental leave programsWe give you great tools and tech to do your best work: Hardware, software, and home- and office setupsNot sure if you meet all the requirements? Please apply! We know there is no job description that can measure a person's attitude, aptitude, or amplitude (the ability to turn it up a notch) and highly encourage you to apply.Our approach is shaped by a strong respect for each individual. This applies to every aspect of employment – from equitable wages, work-life balance, the freedom to be your whole self, to equal opportunities for growth and development at Litmus. We believe wholeheartedly the more inclusive we are, the better our work will be.Job Type: Full-time", "url": "https://www.indeed.com/viewjob?cmp=Litmus&t=Information+Security+Analyst&jk=fb65fee9e3db9983&vjs=3"},
{"job_title": "newResident Aid - Weekly Pay!", "summary": "$500 Sign On Bonus.\nLoyalty Pay extra $2 per hour!\nHealthcare Plans (Medical, Dental, Short Term Disability & Life Insurance).\nNEW Paid Time Off Program.", "company": "Balanced Home Care", "location": "Novi, MI 48377+1 location", "job_description": "Balanced Home Care is currently hiring Resident Aides for our Independent Living Facilities!*You Are Needed! Help Change Lives - Join Our COVID FREE Team & Become an Essential Employee Today! *We Offer:WEEKLY PAY!$500 Sign On BonusLoyalty Pay extra $2 per hour!Healthcare Plans (Medical, Dental, Short Term Disability & Life Insurance)NEW Paid Time Off Program401KNegotiable Pay RatesGuaranteed Raise Programs (3 Raises per year!)Paid TrainingFree MealsUniform Reimbursement $$Tuition ReimbursementGood Rx Prescription Discount ProgramManagement OpportunitiesPrimary Duties:Provide personal assistance: bathing, dressing, personal grooming and hygiene, toileting, transfers, any other non-medical basic care needed for our senior residents in an Independent Living setting.Available- Full time (30+ hours), Part Time, and On-Call Available!Mornings 7A - 3PAfternoons 3P - 11PMidnights 11P - 7ATo Keep Our Caregivers Safe, We Have Incorporated:PPE Care Package Equipment (i.e., Masks, gloves, etc.)Virtual Interviews and OrientationsVirtual MeetingsTemperature ScreeningsSanitizing and Disinfecting ProceduresA Safe Work Environment- We do not care for Covid-19 positive patients.Veterans, transitioning active-duty military personnel, and military spouses are encouraged to applyJob Types: Full-time, Part-timeSalary: $13 per hourJob Type: Part-timePay: $12.00 - $13.00 per hourSchedule:8 hour shiftDay shiftNight shiftWeekend availabilityAbility to commute/relocate:Novi, MI 48377: Reliably commute or planning to relocate before starting work (Preferred)Education:High school or equivalent (Preferred)Experience:Caregiving: 1 year (Preferred)Shift availability:Day Shift (Preferred)Night Shift (Preferred)Overnight Shift (Preferred)Work Location: One location", "url": "https://www.indeed.com/viewjob?cmp=Lily-Hospice&t=Resident+Aid&jk=c35f9c8c2322968e&vjs=3"},
{"job_title": "newPart-Time Cashier", "summary": "Exclusive Discounts for gyms, car dealerships, cell phone plans, and more!", "company": "Menards", "location": "Williston, ND 58801+118 locations", "job_description": "Part-Time\n\nMake BIG Money at Menards!\n\nStore Discount\nProfit Sharing\nExclusive Discounts for gyms, car dealerships, cell phone plans, and more!\nFlexible Scheduling\nDental Plan\nOn-the-job training\n\nStart building an exciting and rewarding career in retail with a growing company as a Cashier with Menards! Immediate openings available!\n\nOur Cashiers play an important role in the Customer Experience by providing a fun, fast, and friendly Customer Service at the register!\nApply today! We are hiring immediately and are excited to talk to you about the great opportunities available with Menards!", "url": "https://www.indeed.com/viewjob?jk=f329a836640c2d7e&from=serp&vjs=3"},
{"job_title": "Retail Cashier (Stocker/Image)", "summary": "In this role, you will take pride in the way the store looks and strive to ensure it is clean, organized, and ready for our GUESTs.\nBe at least 16 years old.", "company": "Jacksons Food Stores", "location": "Mountain Home, ID 83647+7 locations", "job_description": "Retail Stocker/Cashier (Image)Starting at $13.75/hr. + Bonus PotentialAn Image Associate at Jacksons is a key member of the team who helps maintain Jacksons reputation of offering clean and well-presented stores. In this role, you will take pride in the way the store looks and strive to ensure it is clean, organized, and ready for our GUESTs. You will assist in other areas of operations when needed including providing product information, suggestive selling, and promoting specials to help improve the customer experience and keep them coming back for more.Take the first step and join the Jackson’s family today! Come on, let’s WORK!What will I get when I join the team?Our employees are our most important asset and that’s reflected in our benefits. Jacksons is proud to offer a variety of benefits to support employees and their families, including:The opportunity to learn new skills in customer service and retail.Comprehensive training in state-of-the-art Learning Centers.A fun work environment with a family centric environment.Competitive compensation, opportunities for advancement, and flexible work schedules.Medical, Vision, Dental, and Paid Time AwayLife and Disability InsuranceMerchandise and fuel discountsFinancial benefits including 401k, profit sharing, bonuses, and performance bases raises.Same day pay!Tuition Reimbursement and many more!What will I do as a Retail Stocker/Cashier (Image)?Here are just some of the things you will do in this role:· Greet every GUEST with a smile, thanking them for their business, and inviting them back.· Provide fast and friendly service as well as accurate product information; helping to build awareness of our retail products and services.· Clean fast-food equipment and area and stock items as needed.· Ensure proper sanitation and food handling/prep/storage/disposal procedures are followed.· Maintain cleanliness, inside and outside the store including fuel islands and pumps.· Properly label, rotate and stock shelves, coolers, and displays.· Be knowledgeable of and follow company policy and procedures.· Meet the physical demands of standing, lifting, bending, and pulling items.· Be at least 16 years old.· Additional duties as assigned.What we’re looking forFamily owned since 1975, Jacksons is a leader in the convenience store industry. Today, we remain a best-in-class organization in innovation, service, and quality. We are currently looking for those who demonstrate:Willingness and passion for delivering exceptional GUEST service.Excellent communication with a friendly can-do attitude!Flexible availability to support business needs for a 24/7 operation including nights, holidays, and weekends.Leading by example and doing the right thing, always.Teamwork! We work together to get the job done.A level of knowledge of cashiering in food service or retail environments.The ability to think quick on your feet and react to change.A strong attention to detail.Physical Requirements: · Must be able to stand for an extended period.· While performing the duties of this job, frequently required to stand, walk, bend, and twist; reach with hands and arms; climb or balance; stoop, kneel, or crouch; and talk and listen.· Must frequently lift and/or move up to 20 pounds and occasionally lift and/or move up to 65 pounds· Work safely in work conditions that include heat, cold, allergen, noise, and fume/chemical/odor from gasoline and cleaning chemicals.Job Types: Full-time, Part-timePay: From $13.75 per hourBenefits:401(k)401(k) matchingEmployee assistance programEmployee discountFlexible scheduleFlexible spending accountLife insurancePaid time offTuition reimbursementSchedule:8 hour shiftDay shiftHolidaysWeekend availabilitySupplemental Pay:Bonus payWork Location: One location", "url": "https://www.indeed.com/viewjob?cmp=Jacksons-Food-Stores&t=Retail+Cashier&jk=2170d286b5d6eff5&vjs=3"},
{"job_title": "newCannabis Retail Associate", "summary": "O Monitor staff and customer access/movement in and out of store, maintaining security awareness.\nOther job duties include greeting customers, coordinating…", "company": "Bloom", "location": "Phoenix, AZ 85034 (Central City area)+5 locations", "job_description": "Job Description & SummaryOur Retail Associates wear many hats – and for good reason! Few people enjoy doing the same repetitive task over and over, so we enable you to train and learn each job in the store, strengthening your contribution to the team and providing you with exceptional retail training! Our Retail Associates perform all of the following:ConciergeAside from Security, this is the first face you should see during your visit. The Concierge is responsible for not just being a warm greeting but also a customer advocate, answering questions when able; a safety coordinator, ensuring guest limits are enforced; and help desk, assisting visitors, vendors, and employees alike.CashierDo you like money? So do our customers! You must possess exceptional math and reasoning skills to ensure charges or correct and proper change is given in return. Other job duties include greeting customers, coordinating complaints, and maintaining store cleanliness.Order AssemblyLet’s face it, not much can beat being in air-conditioned room filled floor to ceiling the world’s most delicious smelling product. This is your opportunity to learn the Bloom Dispensaries catalogue backwards and forwards as customers order everything we have to offer. Your job is to pack it perfectly and professionally, so they come back for more!Customer ConsultantBeing a Customer Consultant is why so many of us got into this business in the first place and it is our team member training program “Valhalla”. Once you have mastered the art of the greeting, performed flawless transactions, and packed perfect product, you will have the unique opportunity to share what you have learned with each visitor based on their needs – from flower to concentrates, from tinctures to salves, YOU are the subject matter expert ready to assist any customer and answer any question.Essential FunctionsA brief list of what you can expect to do on a typical shift. Remember to remain flexible and available to serve.Conciergeo Greet all customers and vendors as they walk in, checking in customers as appropriate.o Answer phones, taking and relaying accurate messages in a timely manner.o Monitor staff and customer access/movement in and out of store, maintaining security awareness.o Provide administrative and clerical support.o Keep reception area organized and clean, including disinfecting and sanitizing high traffic areas and surfaces.o Maintain friendly interactions with customers as they wait.Cashiero Handle customer transactions, order processing, and cash handling pleasantly, but also quickly and accurately.o Operate the cash register and maintain an accurate balance, reconciling at the end of shift.o Greet customers and handle any complaints swiftly, escalating to management only when necessary.o Maintain inventory awareness, informing management of low quantity, and assisting in completing counts.o Advise all customers regarding sale items, promotions, and other news.o Correctly and accurately enter all transactions at point-of-sale site, LeafLogixOrder Assemblyo Fulfill all orders with 100% accuracy.o Inform management of low inventory and assisting in completing inventory counts.o During periods of low traffic or activity, perform any of the other Retail Associate Job Responsibilities.Patient Consultanto Inform customers of the many benefits of cannabis and the varying strains and how to best utilize for their needs.o Greet and provide customers with knowledge on every product we carry.o During periods of low traffic or activity, perform any of the other Retail Associate Job Responsibilities.Knowledge, Skills, Abilities Desiredo Professional attitude and appearance with a personal touch.o Maintain an energetic, friendly, sincere persona.o Sound judgment skills with an emphasis on discretion.o Solid written and verbal communication skills. Must be able to read and write English.o Strong ability to perform basic math including addition, subtraction, multiplication, and division.o Robust experience in using applications like Microsoft Office: Word, Excel or Google Docs, Sheets.o Customer service focused, servant-based professional.o Resourcefulness, using every tool available to you.o Proactive, finding solutions to problems before they arise.o Able to prioritize responsibilities and a strong sense of urgency.o Documented in-depth experience with our product.Qualifications Desiredo High School Diploma or GED required.o 1+ year of experience with Front Desk/Reception/Concierge responsibilities recommended.o 1+ year of experience handling a cash register or other financial responsibility.o 3+ years or retail experience is highly recommended – priority will be given to candidates with proven retail experience.o LeafLogix experience helpful but not mandatory.o Must be able to lift with assistance up to 100 pounds, with/without assistance 50 pounds.o Must be able to stand for prolonged periods of time on a regular basis.o Schedule that is either flexible or dependable.o Must be at least 21-years old per Arizona law.o Must possess a valid, unexpired Arizona Facility Agent (FA) Card or must have applied by employee’s first day.Work Location: One locationJob Type: Full-timePay: $13.00 - $20.00 per hourBenefits:Dental insuranceEmployee assistance programEmployee discountHealth insuranceLife insuranceReferral programVision insuranceSchedule:8 hour shiftDay shiftHolidaysMonday to FridayNight shiftOvertimeWeekend availabilitySupplemental Pay:Bonus payTipsAbility to commute/relocate:Phoenix, AZ 85034: Reliably commute or planning to relocate before starting work (Required)Education:High school or equivalent (Preferred)Experience:Customer Service: 1 year (Required)Shift availability:Day Shift (Preferred)Night Shift (Preferred)Work Location: One location", "url": "https://www.indeed.com/viewjob?cmp=Bloom&t=Cannabis+Retail+Associate&jk=1af2f75547c54ecd&vjs=3"},
{"job_title": "newPayroll Clerk", "summary": "Our Human Resources Department is focused on ALDI’s most valuable asset: our people.\nWhether it's in customer service or our exceptional products, we owe our…", "company": "ALDI", "location": "Remote in Naperville, IL", "job_description": "We're ALDI, one of America's favorite grocers. We've grown a lot in the past few years, expanding our reach and customer base all around the country. Whether it's in customer service or our exceptional products, we owe our success to the efficiencies we create in every corner of our company and the people at each level who make that happen.\nOur Human Resources Department is focused on ALDI’s most valuable asset: our people. With teams including Administration, Employee Communications, Payroll & Benefits, Human Resource Information Systems, Legal, Risk & Security, Recruitment and Training & Development, HR makes sure that ALDI continues to employ talented and motivated people that are focused on preserving the supportive culture we're known for.\n\nPosition Type: Full-Time\nStarting Wage: $19.25 per hour\nWork Location: Naperville, IL (Fully Remote)\nThis role is eligible to participate in ALDI’s Hybrid Work Program, which allows remote work up to 5 days per week (with a requirement to work in-office at least 1 day per month)\n\nDuties and Responsibilities:\n\nMust be able to perform duties with or without reasonable accommodation.\nPrepares, processes, reconciles and audits payroll data within the company-offered payroll system.Maintains payroll information by collecting, calculating and entering data.Handles and processes garnishment requests.Generates reports as required to provide information for management.Escalates issues to the appropriate level of support and/or management when necessary.Maintains payroll operations by following policies and procedures, as well as reporting needed changes.Contributes to team effort by accomplishing payroll-related requests as needed.Performs all assigned tasks accurately, efficiently, and in accordance with applicable policies and procedures.Maintains confidentiality and privacy of employee and company sensitive data.Other duties as assigned.\n\nJob Qualifications:\n\nALDI Acts Competencies:\nPerform within ALDI Acts competencies as outlined below.\nCollaborates and Cooperates with Team: Commits to and supports a collaborative and high-performing working environment with peers and managers.Drives for Success: Seizes opportunities and proactively takes concrete actions to complete tasks. Goes the “extra mile” and persistently overcomes obstacles to improve outputs.Focuses on the Customer: Seeks to understand underlying customer needs to create value. Drives the team to maintain focus on customers.Focuses on Quality: Takes an efficient, analytical approach to solve problems or produce outputs in an accurate and timely manner. Ensures quality and accuracy of results.Plans and Prioritizes: Sets priorities and organizes information in order to efficiently and effectively “get the job done”.\n\nJob-specific Competencies:\n\nKnowledge/Skills/Abilities\nGives attention to detail and follows instruction.Excellent verbal and written communication skills.Ability to prioritize and work under strict deadlines.Ability to work both independently and within a team environment.Ability to stay organized and multi-task efficiently.Understands data collection, entry, and reporting.\nProficient in Microsoft Office Suite.\nAbility to interpret and apply company policies and procedures.\n\nEducation and Experience:\nHigh School Diploma / GED required.A minimum of 1 year of relevant experience required.Or, a combination of education and experience providing equivalent knowledge.\nAssociate’s Degree in Accounting, Business Administration or related field preferred.\n\nPhysical Requirements:\nWork is performed in an office environment where a computer, telephone and other office equipment are used as needed to perform duties.Regularly required to sit, reach, grasp, stand and move from one area to another.Constantly and repeatedly use keyboard/mouse.Occasionally required to push, pull, bend, lift and move up to 25 lbs.\n\nTravel:\nNo travel required.\nALDI offers competitive wages and benefits, including:\n401(k) Plan\nCompany 401(k) Matching Contributions\nEmployee Assistance Program (EAP)\nPerkSpot National Employee Discount Program\nIn addition, eligible employees are offered:\nMedical, Prescription, Dental & Vision Insurance\nGenerous Vacation Time & 7 Paid Holidays\nShort and Long-Term Disability Insurance\nLife, Dependent Life and AD&D Insurance\nVoluntary Term Life Insurance\nALDI is committed to equal opportunity for all employees and applicants. As a proud Equal Opportunity Employer (EOE), we do not discriminate based on race, color, national origin, ancestry, citizenship status, religion, sex, sexual stereotyping, sexual orientation, gender, gender identity, gender expression, age, marital status, mental or physical disability, medical condition, genetic information, military or veteran status, pregnancy (which includes pregnancy, childbirth, and medical conditions related to pregnancy, childbirth, or breastfeeding), or any other protected characteristic. Employment may be contingent upon ALDI's receipt of an acceptable and job-related drug test, motor vehicle report, and/or reference check, as applicable and permissible by law.", "url": "https://www.indeed.com/viewjob?jk=29023af3e5fe2aec&from=serp&vjs=3"},
{"job_title": "Online Thrift Product Lister", "summary": "Coordinate and communicate with store Ecommerce representatives as necessary regarding items sent from that store.\nRemove merchandise from containers and sort.", "company": "America's Thrift Stores", "location": "Birmingham, AL 35207 (Acipco-Finley area)", "job_description": "Are you ready to join an organization where you can make a difference in your local community? We are on a mission to grow our company to double its current size, and we need your help. America’s Thrift Stores is a private equity-owned, for-profit company that operates 23 stores in Alabama, Georgia, Louisiana, Mississippi, and Tennessee. We are proud to employ over 1,400 people across our locations, while supporting the local community providing affordable, quality products. We partner with specific charities within the states we operate.The Online Thrift Product Lister assists with the processing functions of our online retail business by evaluating and posting various merchandise for sale on eBay.com, and other auction-oriented sites. Merchandise will include, but will not be limited to clothing, shoes, and accessories, furniture, musical instruments, jewelry, decorative items, housewares, art, electronics, sports equipment, bicycles, collectibles, and vintage/antique items.Primary Job DutiesUsing the internet, published guidelines and consultation with experts, research potential merchandise to be placed online for sale, determining information such as the type and function of the item, fair market value, eligibility for vintage/antique status, brand, potential buyers, whether the item is genuine, and other details in order to make an educated assessment as to the item’s salability on our online marketsWrite persuasive sales copy about the itemMeasure and weigh items accurately, inclusive of packagingPost items for sale on marketplace channels using e-goods softwareKeep accurate records, using e-goods software, of items posted, sold, sales price, inventory, origin, and destinationUse warehouse equipment, such as pallet jacks to move product in, out, and within the warehouseRemove merchandise from containers and sortCoordinate and communicate with store Ecommerce representatives as necessary regarding items sent from that storeMaintain a quick work pace in order to adhere to posting quotasAssist with warehouse logistics as assignedMaintain and adhere to all agency policies and proceduresOther duties as assignedSkills & Competencies:Self-starter and learns quicklyFamiliar with Microsoft Word and ExcelExcellent written English skillsAbility to conduct reliable research using the InternetExtremely detailed orientedFamiliarity with basic photographic principles so as to operate a mid-level digital camera, including the ability to upload pictures to a computerResponsible and reliable and extremely organizedAbility to complete all assigned tasks quickly, and in an efficient manner, adhering to departmental quotasAbility to understand and adhere to policies and proceduresAbility to continually provide feedback for process improvementsAbility to lift merchandise up to 30 pounds in weightAbility to push and/or pull merchandise up to 200 lbs using warehouse equipmentAbility to work in a warehouse environment with exposure to various temperature extremes (hot in summer, cold in winter), moderate dust and noiseReliable transportation in order to work a variable schedule, including nights, weekends and holidaysPrevious work experience in e-commerce or retail environment, like eBay or Amazon preferredHigh School diploma, GED, or equivalent preferredExperience:Previous work experiences in e-commerce or a retail environment, like eBay or Amazon, preferredMicrosoft Office proficient preferredEducation:High school diploma, GED, or equivalent preferredPhysical DemandsOccasionally - Carrying up to 50 lbs., pushing and pulling up to 25 lbs., lifting up to 50 lbs., climbing up to 14-foot height, balancing, stooping, kneeling, crouching, handling, and smelling.Frequently - walking on tile/concrete, bending, feeling, and reaching waist/overhead level.Continuously - Sitting, standing on tile/concrete, fingering, talking, seeing, and hearing.Other:Mostly regular hours, occasionally working evenings, weekend and holiday hours as needed.Working environment involves inside office with controlled temperatures and outside conditions with varying weather and temperatures.Job Types: Full-time, Part-timePay: From $15.00 per hourBenefits:401(k)Dental insuranceEmployee discountFlexible spending accountHealth insuranceHealth savings accountLife insurancePaid time offReferral programVision insuranceSchedule:8 hour shiftDay shiftWork Location: One location", "url": "https://www.indeed.com/viewjob?cmp=Americas-Thrift-Stores&t=Online+Thrift+Product+Lister&jk=a30c0b8ca1cf58a6&vjs=3"},
{"job_title": "newBox Truck Delivery Driver", "summary": "$2,199 Weekly - Delivery Driver – No Experience Necessary!*.\nPreferred Vehicle: 12 foot to 16 foot box truck (no liftgate needed)*.", "company": "Need It Now Delivers - Automotive", "location": "Neenah, WI", "job_description": "$2,199 Weekly - Delivery Driver – No Experience Necessary!State: WisconsinCity: NeenahPreferred Vehicle: 12 foot to 16 foot box truck (no liftgate needed)Delivery Description: Auto PartsAre you an Experienced Driver with a valid driver’s license? Need It Now Delivers and Xpedited Delivery are looking for you!Smart Phone RequiredDirect DepositMonday - Friday 8am - 5pmStart & End at warehouse in NeenahAverage 15-20 stops dailyRound trip miles 240Full time/Part Time Route Opportunities available1099 Contractor positionMust have valid driver's license, registration, and vehicle insuranceMust be 21 or older with no DUI’s in the last 3 yearsRetirees/ Veterans/ Rideshare Drivers Welcome to Apply!When you Need it Now, Xpedite it! https://www.nindelivers.com/Job Types: Full-time, ContractPay: $2,199.00 per weekSchedule:Monday to FridayWork Location: On the road", "url": "https://www.indeed.com/viewjob?cmp=Need-It-Now-Delivers---Automotive&t=Box+Truck+Delivery+Driver&jk=52cfb2bbd9f151ea&vjs=3"},
{"job_title": "User Researcher, Talk", "summary": "Define, plan and conduct user research.\nGain a deep understanding of how our products and platforms influence user behavior, and represent the voice of our…", "company": "Spotify", "location": "Remote in New York, NY+7 locations", "job_description": "Data, Research & Insights\nUser Research\nSpotify is a global community of over 250 million music fans, artists, and now podcasters. It's always been our mission to make audio more accessible for everyone, and create innovative ways for creators and fans to connect with each other.\nLocation\nNew York or Remote Americas\nJob type\nPermanent\nTalk is the team within Spotify responsible for building the best tools for audio creators. We have three platforms that help us deliver a great creator experience: Anchor (the platform that allows you to create, distribute, monetize, and grow a podcast, all for free), Spotify for Podcasters (the platform that makes it easy to understand and engage with your listeners on Spotify, and Greenroom (the platform that allows anyone to stream or listen to live audio).\nWe've done a lot already, and we have no plans of slowing down. Come help us build the future of audio creation!\nWhat You'll Do:\nDefine, plan and conduct user research\nGain a deep understanding of how our products and platforms influence user behavior, and represent the voice of our users in the product development process\nBe a strategic partner to product development and marketing teams by delivering insights that inform the problems we choose to seek and shape the future of our roadmaps\nExercise your thought leadership and become a go-to specialist for user research in the creator space\nEmploy a wide range of storytelling techniques to communicate results and recommendations to product and design teams\nWho You Are:\nYou have worked in a research role at a consumer-focused company\nYou hold a degree in Psychology, Human Computer Interaction, Social Science or a related field, and/or relevant professional experience\nYou have proven experience in user research, leveraging both qualitative and quantitative research methods\nYou can collaborate closely with Data Science and are comfortable with metrics and A/B tests\nYou are comfortable with autonomously planning, scoping, conducting, analyzing and communicating research in a variety of contexts\nYou have strong interpersonal skills and can strongly communicate with your partners in business, design, engineering and marketing (in English)\nYou are a dedicated advocate of a user-centered, evidence-based approach to product development while balancing business needs\nYou enjoy working in a collaborative environment\nExperience conducting multi-market international research is preferred\nWhere You'll Be:\nWe are a distributed workforce enabling our band members to find a work mode that is best for them!\nWhere in the world? For this role, it can be within the Americas region in which we have a work location and is within working hours\nPrefer an office to work from home instead? Not a problem! We have plenty of options for your working preferences. Find more information about our Work From Anywhere options here\nOur global benefits\nExtensive learning opportunities, through our dedicated team, GreenHouse.\nFlexible share incentives letting you choose how you share in our success.\nGlobal parental leave, six months off - fully paid - for all new parents.\nAll The Feels, our employee assistance program and self-care hub.\nFlexible public holidays, swap days off according to your values and beliefs.\nSpotify On Tour, join your colleagues on trips to industry festivals and events.\nLearn about life at Spotify\nSpotify is an equal opportunity employer. You are welcome at Spotify for who you are, no matter where you come from, what you look like, or what’s playing in your headphones. Our platform is for everyone, and so is our workplace. The more voices we have represented and amplified in our business, the more we will all thrive, contribute, and be forward-thinking! So bring us your personal experience, your perspectives, and your background. It’s in our differences that we will find the power to keep revolutionizing the way the world listens.\nSpotify transformed music listening forever when we launched in 2008. Our mission is to unlock the potential of human creativity by giving a million creative artists the opportunity to live off their art and billions of fans the chance to enjoy and be passionate about these creators. Everything we do is driven by our love for music and podcasting. Today, we are the world’s most popular audio streaming subscription service with a community of more than 381 million users.\nGlobal COVID and Vaccination Disclosure\nSpotify is committed to safety and well-being of our employees, vendors and clients. We are following regional guidelines mandating vaccination and testing requirements, including those requiring vaccinations and testing for in-person roles and event attendance. For the US, we have mandated that all employees and contractors be fully vaccinated in order to work in our offices and externally with any third-parties. For all other locations, we strongly encourage our employees to get vaccinated and also follow local COVID and safety protocols.\nThis role is not eligible for hire in Colorado, USA.", "url": "https://www.indeed.com/viewjob?jk=42508de6a8d068e9&from=serp&vjs=3"}