[
{"job_title": "newHigh School Visual Arts Teacher (2022-2023)", "summary": "We operate high-performing urban public charter schools and a unique graduate school of education that trains teachers for high-poverty schools.", "company": "Match Education", "location": "Boston, MA 02215 (Allston area)+1 location", "job_description": "Position: High School Visual Arts Teacher (2022-2023 Opportunity)Location: Boston, MA (Brighton Campus)Start date: August, 2022 ABOUT THE MATCH CHARTER PUBLIC SCHOOLMatch Charter Public School is a free, high-performing charter public school in Boston. We are a PreK-12 school serving 1,250 students. Our mission is to prepare students for success in college and careers in order to achieve economic security and mobility. Students gain acceptance to our schools via an annual blind public lottery open to all Boston residents.Our families bring amazing racial and cultural diversity to the school community - they represent over 20 different countries of origin with over 20 different languages spoken at home.\n\n94% of our students are people of color. Our students bring a diversity of needs to our school, and we are prepared to serve them. 21% of our students qualify for special education services; 18% of our student body are English Language Learners.We know that the largest driver of our success is the people who work in our schools every day. Match teachers and staff have an immediate impact on our ability of reaching our mission and changing the lives of our students.\n\nWe strive to attract, develop, and retain a team that is diverse by race, ethnicity, culture, income background, gender, sexual identity, and a variety of other factors. See our statement on diversity here. OVERVIEW OF ROLE AND RESPONSIBILITIESWe are looking for a full-time Visual Arts Teacher who can help continue to build the arts program at our high school. The position is based at our high school campus on 1001 Commonwealth Ave.\n\nin Brighton and entails designing and delivering a curriculum for high school students who will have Visual Arts classes during the regular school day.We would like the Visual Arts teacher to offer a mix of classes in visual media. There is a budget available for equipment and supplies. The Visual Arts teacher will: -Design curriculum and teach Visual Arts classes-Teach classes at multiple grade levels-Assist with duties to uphold a positive and safe school culture-Participate in regular professional development, coaching sessions, and faculty meetings-Performs other duties assigned as a member of the school faculty QUALIFICATIONSResearch has shown that people of color and women are less likely to apply for jobs if they dont believe they meet every one of the qualifications described in a job description. Our highest priority is finding the best candidate for the job.\n\nWe encourage you to apply, even if you don't believe you meet every one of our qualifications described or you have a less traditional background. We are looking for applicants who the following qualifications: -Have at least 1-3 years prior experience as an Visual Arts teacher, ideally with high school students-Hold a valid and appropriate license issued by the Massachusetts Department of Elementary and Secondary Education, or obtain the licensure within a year of date of hire-Articulate a clear vision for an high school Visual Arts curriculum-Demonstrate skill in designing and delivering lessons-Demonstrate skill in building effective relationships with students and colleagues-Hold a deep belief that all students can and will succeed-Possess a desire to continually improve their practice as an educator by taking and implementing feedback ABOUT MATCH EDUCATIONMatch Education (www.matcheducation.org) is the shared brand name of The Match Charter Public School, The Match School Foundation, Inc., and The Sposato Graduate School of Education. Match Education is an engine of discovery and applied innovation in education. We operate high-performing urban public charter schools and a unique graduate school of education that trains teachers for high-poverty schools.\n\nOut of this applied work, we refine, validate empirically, and eventually disseminate new ideas and practices on core questions in education reform. The Match Foundation, Inc., The Charles Sposato Graduate School of Education, Inc., and Match Charter Public School prohibit discrimination on the basis of race, color, sex, gender identity, sexual orientation, age, national origin, physical or mental disability, religion, veteran status, and any other class of individuals protected from discrimination under state or federal law in any aspect of the access to, admission, or treatment of students in its programs and activities, or in employment and application for employment.", "url": "https://www.indeed.com/viewjob?jk=13134c4eedca7e87&from=serp&vjs=3"},
{"job_title": "newElection Logistics Worker", "summary": "The position is located in Pearl City on the Island of Oahu.\nAs a condition of employment with the State of Hawaii, all qualified external candidates who have…", "company": "State of Hawaii", "location": "Oahu Island, HI", "job_description": "Recruitment Information\n\nThis posting is for the State of Hawaii, Department of Accounting and General Services, Office of Elections.\n\nThe position is located in Pearl City on the Island of Oahu.\n\nSalary: $2,600 per month\n\nAs a condition of employment with the State of Hawaii, all qualified external candidates who have been given a conditional offer of employment must show proof of full COVID-19 vaccination and shall be fully vaccinated by his/her/their employment start date. A reasonable accommodation will be provided if requested by a candidate and it is determined through an interactive process that pregnancy, a qualifying disability, or a sincerely held religious belief prevents the candidate from receiving a COVID-19 vaccination.\n\nThe State Recruiting Office will refer all inquiries regarding this exempt position to the Department of Accounting and General Services, Office of Elections.\nDuties Summary\nThis position is responsible for providing manpower and logistical assistance in preparing and conducting the 2022 Elections. This position is also responsible for ensuring the operational readiness of facilities to be used for the election and will need to operate a motor vehicle to transport equipment, materials, and supplies. This is a temporary position that does not exceed December 2022.\nMinimum Qualification Requirements\nCitizenship Requirement: The State of Hawaii requires that all persons seeking employment with the government of the State shall be citizens, nationals, or permanent resident aliens of the United States, or eligible under federal law for unrestricted employment in the United States.\n\nKnowledge: Warehouse operations in handling equipment, materials, and supplies.\n\nSkills/Abilities: Understand oral and written instructions; knowledge of basic mathematics; operate a forklift; take physical inventories; foresee occupational hazards and take effective measures to eliminate them; deal courteously and effectively with others; lift and carry heavy equipment, materials, and supplies.\n\nEducation: Graduation from high school or its equivalent.\n\nExperience: One year experience working in a warehouse environment handling equipment, materials, and supplies; and operating a forklift. Hawaii Driver License is required.\nOther Information\nThis position is exempt from the civil service and considered temporary in nature. Therefore, if you are appointed to the position, your employment will be considered to be \"at will,\" which means that you may be discharged from your employment at the prerogative of your department head or designee at any time.\n\nSubmit resumes to:\nOffice of Elections\nAttn: Kristen Uyeda\n802 Lehua Avenue\nPearl City, Hawaii 96782\n\nResumes can also be faxed to (808) 453-6006 or emailed to elections@hawaii.gov\n\nDirect all inquiries regarding this position to:\nKristen Uyeda\nPhone: (808) 453-8683\nMonday - Friday, 7:45 a.m. - 4:30 p.m. (HST)\nEmail: elections@hawaii.gov\n\nNOTE: The State Recruiting Office will refer you to the Department of Accounting and General Services, Office of Elections regarding this exempt position.", "url": "https://www.indeed.com/viewjob?jk=cfc5331778526f14&from=serp&vjs=3"},
{"job_title": "newTrain Electrical Engineer", "summary": "Providing direct inputs to Electrical and Schematic Design engineers for the development of vehicle schematics, including schedule deadlines.", "company": "Segula Technologies", "location": "Naperville, IL+1 location", "job_description": "Job Description\nIn this role you are responsible for the Train Electrical engineering deliverables on projects such as overhauls. You functionally manage a team of electrical engineers and ensure that clear expectations in terms of technical deliverables, schedule and responsibility are defined. You report progress to the project team and the external customer.\n\nQualifications\n\nAccountable for the definition of all train electrical deliverables including schematics, primarily for overhaul projects\nProviding direct inputs to Electrical and Schematic Design engineers for the development of vehicle schematics, including schedule deadlines\nDefining electrical interfaces with Train Control and/or System engineers to ensure electrical functions and systems are adequately integrated\nSupporting the Mechanical Design team for cable routing and cable harness drawings development, as well as the Industrial Engineering team for manufacturing aspects\nEnsuring the train electrical design is compliant with applicable standards for reliability, safety, maintainability and customer requirements\nProviding support to the Production Line, Testing, Procurement and Quality teams\nTravel of up to 10% may be required to support business meetings, Production Line support, or validation and test activities.\nAdditional Information\nAll your information will be kept confidential according to EEO guidelines.", "url": "https://www.indeed.com/viewjob?jk=6b22b5e773efdddb&from=serp&vjs=3"},
{"job_title": "Tree Worker", "summary": "Tree Foreperson Tree Trimmer with a Commercial Driver’s License – Starting pay $40.37.\nTree Foreperson Tree Trimmer with a Class C License – Starting Pay $38.57…", "company": "Mountain F Enterprises", "location": "California", "job_description": "In 1984, Mountain F. Enterprises, Inc. (MFE) was established in Lotus, California, and has blossomed into a full spectrum vegetation management company that specializes in providing services to a variety ofcustomers including federal, state, local agencies, and utility companies. MFE prides itself with employees who are highly skilled, professional and have a work ethic unprecedented in the industry while utilizing top of the line equipment.The MFE team is currently recruiting for a wide range of full-time positions. We are looking for those individuals with experience as well as those that have no prior tree experience but have a passion to learn and want to begin a career in the utility tree industry.Tree Foreperson Tree Trimmer with a Commercial Driver’s License – Starting pay $40.37Tree Foreperson Tree Trimmer with a Class C License – Starting Pay $38.57Specialized Tree Equipment Operator $32.44 - $38.57Tree Climber (2 years minimum experience) – Starting Pay $36.05Apprentice Tree Climber 1-6 months exp– Starting Pay – $25.23Apprentice Tree Climber 6 -12 Months exp – $28.84Apprentice Tree Climber after 12 months - $32.44Ground Person 0-6 months experience - $22.01Ground Person 6+ months experience - $23.43Traffic Control (Flagger) - $22.01$50.00 per day for Per Diem for Apprentices Climbers & Foreperson$25.00 per day for Ground Person and FlaggersTo apply and submit an application, please visit our website at www.mtfent.com/careersMFE offers a competitive benefits package which includes:Medical/Dental/VisionVacationFull Union Pension/Retirement PackageMountain F. Enterprises, Inc. is a drug-free workplace. You must pass a pre-employment drug screen, physical, background check, and have a valid US Driver’s License.for employmentJob Type: Full-timePay: From $22.01 per hourBenefits:401(k)401(k) matchingDental insuranceHealth insuranceVision insuranceSchedule:10 hour shift12 hour shift8 hour shiftDay shiftMonday to FridayOvertimeWeekend availabilityWork Location: Multiple Locations", "url": "https://www.indeed.com/viewjob?jk=2a9c66f4c53e7afb&q=Worker&l=USA&from=web&advn=5558136261453681&adid=379206656&ad=-6NYlbfkN0Bj6kKvXj-goe1pDAgv29bc0negiy65Ek_imM3bA2IhbLzOUQUZJz7fQnYVTdTcgy1sudfYcA5vATKtjBbBt6z1X7ErK8mqPRMWOMZo8Aj1rHpnv3qg-et6B2ACR-pBaP3QgUk0c0_ymj-g7SJpT-H2J_fV0Ta_BCwMtl2YHfLqwPuem2qUgpmF2pRwNrPihwS2sibVZiVPu7z9lhWEe5LFfjWNFveM3avq22VAI-OwpOdVP75L9UgxBC0kD1HKuT9zeUKNyDNm10zoGbJMDDuAqL2giD90jJIn-j-bKsG1FDF8oJJbvxC-OR9cBZqFyngm0adNV4MppcAj0QOxqjAjW2wysZHHG3AjraRm_j8Dyz-Ih0WtLFa6&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "newDesign Engineer", "summary": "Responsibilities include assisting in component design for Honda's high performance race vehicle/powertrain.\nThis includes design concept preparation, component…", "company": "Honda Performance Development", "location": "Santa Clarita, CA 91355 (Valencia area)", "job_description": "Design Engineer(Job Number: HPD00007K)\n\nHonda Performance Development\n\nDescription\nResponsibilities include assisting in component design for Honda's high performance race vehicle/powertrain. This includes design concept preparation, component and assembly modeling, design evaluation and analysis, drawing preparation and release, part manufacturing coordination and other related administrative duties.\n\nQualifications\nBS Degree in Electrical/Mechanical Engineering preferred or equivalent experience. 1-3 years of experience in 2 and 3-dimensional software modelling in automotive industry, preferably in design of electrical, powertrain or vehicle components. Extensive hands on experience with internal combustion race engines, race vehicles and related electronic and mechanical systems. Proficient with PC workstation hardware and CATIA Software.", "url": "https://www.indeed.com/viewjob?jk=8d45659b8b4fa093&from=serp&vjs=3"},
