[
{"job_title": "newCashier", "summary": "Cashiers play a critical customer service role by providing customers with fast, friendly, accurate and safe service.", "company": "The Home Depot", "location": "El Centro, CA 92243+126 locations", "job_description": "Job Description\nPosition Purpose:\nCashiers play a critical customer service role by providing customers with fast, friendly, accurate and safe service. They process Checkout and/or Return transactions, as well as monitor and maintain the Self-Checkout area. They proactively seek product/project knowledge to provide customers with information and identify selling opportunities. They follow all policies and procedures to ensure that shrink is minimized. A Head Cashier will position Cashiers and support them by expediting price checks, approving Point of Sale transactions and markdowns for mainline registers, Self-Checkout, Returns, Pro Desk, Special Services, and Tool Rental. They provide first level escalation for customer issues and assist in the supervision, coaching and training of other Front End Associates by participating in the training of new Cashiers and utilizing all available tools to coach and develop other Cashiers. The preferred qualification for a Head Cashier is 1+ years of Cashier experience.\nPay Rate: -", "url": "https://www.indeed.com/viewjob?jk=30597fc0da85a6bf&tk=1freqv9oqnpv6800&from=serp&vjs=3&advn=408043805857178&adid=382682755&ad=-6NYlbfkN0BAuTfAu5ThYozS55O8p5sS5gWZMb8bifg5H3ftdCgDuBriRxBvjCN-v9pIEM4HZVZb4UoyoZ4NLiCljNHodV6tIZ4FQtdtz8EeUX8IqB-s-C0F9oUOjj0AmV0yWw9X51_Kyxry36zUCxvIwuennuVuoNmkpIO1exrQqVIwWI0sw2XY47gOrg4VN042PHHoi9MaUbXdYXTirjMMMiUg4u0AiccjrkDY1biKv8gEyQfO5AVhvby3U6PdGd6N3P5WJHJfBuPCRAbWqUwazorMifBcmH-7yzUWnirjzL8bYwCICtZalxkfz3cRjiXhIjBxA7OT393-ce2Vhck-cu1WbeGWiqT7Z-zYsWunXuqQawlb82EtQQfmJZxo&sjdu=QWF4TUFyrHvH7u082A4fa7M39mv_xVu3eHfGEh0bObw"},
{"job_title": "Executive Assistant", "summary": "Work part-time or full-time hours.\nOur diverse team includes parents, military spouses, caregivers, and those with unique life situations where working remotely…", "company": "Boldly", "location": "Remote in California", "job_description": "Why you?You are an experienced professional with a positive outlook and a passion for helping others succeed. You are looking for a long-term career opportunity with a company that is committed to work-life balance, and that promotes a culture of respect, kindness and transparency. You are an excellent communicator, you take great pride in the quality of your work, you are a stickler for details, you are tech savvy, you excel at multitasking - and you do it all with a smile!Why us?As a premium executive assistant company we set the standard for remote professionals. We are proudly certified as a Great Place to Work, and our accolades include being named by Fortune Magazine as one of the “50 Best Small Workplaces”, and Entrepreneur Magazine in their Entrepreneur 360 List as one of the “Best Entrepreneurial Companies in America”. Military Friendly named us as part of the Top 10 Military Spouse Friendly Employers, and FlexJobs as a Top 100 Company to watch for. We are also accredited by Flexa as a truly flexible employer.We believe that it is possible to have a rewarding career that doesn’t conflict with your personal responsibilities and life choices. Our diverse team includes parents, military spouses, caregivers, and those with unique life situations where working remotely, part time and on a flexible schedule is not just a ‘nice to have’. As a woman owned business, we are intimately familiar with the challenges women and minorities face in the workplace and we are committed to maintaining a diverse, equitable, and inclusive workplace for all. And of course, as a remote first company since our inception in 2012, we are long time established experts at leading and succeeding in a remote work environment!For more information about our company culture and to hear from team members about their experience in roles filled with variety and new learning - visit our jobs page at https://boldly.com/jobs/About the positionThis is a rewarding long-term career opportunity to work alongside established Fortune 500 companies, senior-level executives, and successful business owners of small and medium size businesses as they make a greater impact in the world. As an executive assistant, you will have the opportunity to choose the companies that you support based on company values and your preferences, and to create long-term partnerships with the executives that you support as you develop new skill sets and get exposure to a variety of industries. You will join our team as a part-time W2 employee with the opportunity to become full-time in due course, based on performance.As an executive assistant you’ll apply your professional skills in a wide range of tasks including: Maintaining appointment schedules and calendars.Planning and scheduling meetings, conferences, and travel.Making travel arrangements including flight and hotel bookings.Maximizing the executive’s time by reading, researching, and routing correspondence; drafting letters and documents; collecting and analyzing information; initiating phone calls on their behalf.Email management.Creating PowerPoint presentations.Managing expenses.Conducting research on various topics.Providing customer/supplier support.Other executive admin responsibilities as needed.Your Skills and Experience: A minimum of 7 years of direct hands-on experience in a role related to executive assistance and administration.Ability to multitask and prioritize work as needed.Excellent time management skills.Advanced knowledge of online tools and software such as Google Drive, Outlook, and Zoom.Ability to learn new tools quickly.Excellent interpersonal communication.Strong writing skills.Highly organized.A team player who is proactive, flexible, results-oriented and comfortable in a rapidly changing environment.Ability to work independently and under the pressure of deadlines.Benefits you’ll love: W2 employment statusOpportunities for pay raisesGenerous PTOPaid holidaysPaid parental leaveTechnology stipendCompetitive pay (starting at $22 an hour)Show me the Perks, Perks, Perks!Flexible work hoursWork part-time or full-time hours100% remote (work from home)Steady work with the same clients for years!Choose the clients who you want to work withJoin a team of like minded professionalsPaid onboardingWork with a dedicated Team Leader to help you succeed with ongoing mentorshipIn house Technical SupportOpportunities for collaboration with other members of the Boldly teamCamaraderie and all around support with our Team SlackLearning and development opportunities in different industriesA positive and thriving company culture that understands work/life balanceAn opportunity to grow with a leader in the remote work spaceCompany newsletters, team shares, quizzes, prizes, charity events, and celebrationsFun company swag!We are just getting started and the future is bright! Don’t miss out on joining us!Boldly is currently hiring in the following 23 states:ArizonaCaliforniaColoradoDelawareFloridaGeorgiaIllinoisKansasMassachusettsMichiganMinnesotaMontanaNew HampshireNew JerseyNew YorkNorth CarolinaOhioPennsylvaniaSouth CarolinaTennesseeTexasVirginiaWashington''Work Location: Fully RemoteWork Remotely  YesJob Type: Part-timePay: From $22.00 per hourBenefits:Flexible schedulePaid time offParental leaveSchedule:Day shiftMonday to FridayWork Location: Multiple Locations", "url": "https://www.indeed.com/viewjob?jk=c26dedb12965b7f4&q=Office&l=CA&from=web&advn=6550110154777366&adid=380719644&ad=-6NYlbfkN0CpPP9DwnhXfZGfrLbSYiRHtUdaesnKgVk6yuUYdgfP844RgljxUl8XN506jcyn9KHHuio913WTajjknn6CLRpQ_r9BmBz47kCH49-fc9CRnqahuUZ3_i6QYAivuE08PyfNhtX3mG11Lr-5XqDbxRLzbnqjgmCZv-Pn2EomDDifOXtNNmXhn6N-WkjjA9Q70HhV8bYFulTbJSu0Uj7l8GuH6wCcAt0nas8Pi25ucQp_vmnOwTUvHhlMDKK4F5W-cs2pMQJc1yM9k6AVsmHUZP41MNylksodMew48IDNHnlL9sJjDnzjtUnXINVHE-Elnw1MIof_RO5t8BkE_jOvN2hhGZeIJAhtSlT-RTKFBq93TuL2h_WGtr2w&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "newADMINISTRATIVE SECRETARY", "summary": "Schedule appointments, make reservations and complete trip authorizations;\nRequest and submit insurance documents;\nUnderstand and follow complex instructions;", "company": "Stanislaus County", "location": "Stanislaus County, CA", "job_description": "About the Opportunity\nTHE IDEAL CANDIDATE\nThe Public Works Department is looking for an organized, detail-oriented person that is able to maintain consistency in a high pressure, quick-paced environment with tight deadlines. This candidate will be customer-oriented and able to multi-task with multiple demands from our Engineering Division.\n\n To learn more about the Public Works Department, click here.\n\nABOUT THE POSITION\nThe Administrative Secretary performs difficult and specialized secretarial work of a varied and sensitive nature often involving the exercise of independent judgment and initiative based upon skills, knowledge, and abilities gained through prior experience in the performance of high level secretarial work. Individuals in the Administrative Secretary classification are journey-level employees who are highly skilled and independently perform a wide variety of complex and general clerical duties associated with the immediate clerical support of a particular manager or organizational unit of County government. This classification requires a thorough knowledge of office procedures and regulations and the ability to perform these duties with minimum direction or supervision. The Administrative Secretary is distinguished from the Executive Secretary (Confidential Assistant IV) in that he/she normally provides secretarial services in support of an office or division head or an identified management employee rather than a Department Head. This classification also supervises subordinate employees and may relieve supervisors of routine operating details. This position is subject to overtime, standby, and callback assignments. Performs related duties as assigned.\nUnless otherwise provided, this position is part of the Classified Service of the County and is assigned to the Office Worker/Clerical bargaining unit for labor relations purposes.\n\nIndividuals who are in a full-time classification position are required to serve a twelve-month probationary period, which may be extended an additional six months, for a total of eighteen months.\n\nThe Job Task Analysis provides information detailing the physical and functional demands of the classification. For the complete job task analysis, visit the Risk Management website at http://www.stancounty.com/riskmgmt/ under \"Disability Management\".\n\nIncumbents may also be subject to overtime, standby, callback, weekend, holiday and shift assignments as identified in their MOU (Memorandum of Understanding).\n\nTypical Tasks\n\nType letters, reports, records;\nAssist with answering the main line and routing calls accordingly;\nUse the Government Outreach portal to record constituent requests;\nMaintain informational and operational records;\nReview material for completeness and accuracy;\nMaintain and improve files and filing systems;\nRecording and filing with the Clerk Recorder;\nAssemble data and information, and assist in the preparation of reports;\nSurvey map logging, tracking, and filing;\nRequest and submit insurance documents;\nDo purchasing and requisitions as requested;\nAct independently, or in accordance with instructions;\nCompose correspondence;\nProcess mailings via USPS and FedEx;\nAssist with routing documents such as contracts and agreements between Morgan Rd and our Tenth Street Place office;\nSchedule appointments, make reservations and complete trip authorizations;\nInterpret and disseminate instructions, department rules, and policies and procedures;\nTime card review and submittal for Engineering Divisions;\nProcess Traffic Delay Notifications;\nProvide website updates;\nRefer incoming mail to proper staff members;\nAttend and take notes at meetings, hearings and conferences, and prepare summaries; And\nDuties as assigned.\nMinimum Qualifications (Skills, Abilities, Knowledge, Education/Experience)\nSKILLS/ABILITIES\n\nPerform a variety of difficult clerical work;\nUnderstand and apply laws, rules, procedures and policies relating to the work of the department;\nUnderstand and follow complex instructions;\nCompose difficult letters independently;\nSupervise the work of a small group of employees;\nOperate office equipment related to the job;\nCompile data for and prepare reports of average difficulty;\nFollow oral and written communication;\nType at a speed of at least 45 WPM from handwritten, printed or typewritten material; and\nTake shorthand and/or use a Dictaphone machine.\nKNOWLEDGE\nPrinciples and methods of statistical clerical work, including business letter writing;\nPrinciples of supervision and training; and\nCurrent office practices and procedures, including familiarity with filing systems and method.\n\nEDUCATION/EXPERIENCE\n\nTwo (2) years of journey-level clerical experience; AND\nTyping certificate, within four years, of 45 wpm (net corrected) from any temporary agency or comparable institution. The certificate must be a three to five minute timed test.\nApplications without proof of typing speed will not be considered.\nApplication and Selection Procedures\nAPPLICATION PROCEDURES/FINAL FILING DATE\n\nApplications cannot be submitted later than 5:00 p.m. on the final filing date. Make your online application as complete as possible so a full and realistic appraisal may be made of your qualifications.\n\nResumes will not be accepted in lieu of a completed application.\n\nAttaching your resume and cover letter are an optional feature for those who wish to do so in addition to completing the required application. Information on your resume and cover letter will not substitute for the education, work experience and required fields on the County application. The online County application is the primary tool used to evaluate your job qualifications.\nEXAMINATION PROCESS\nMost County recruitments consists of the steps detailed below and are governed by Merit Principles. The examination process ensures that all applicants are given the same opportunity to gain employment within Stanislaus County.\nApplication Review and Screening. Applications are carefully screened based on information provided. Those who submit incomplete applications that lack relevant qualifications or do not submit all required documents will not be invited to move on.\nWritten Examination. Applicants will be invited to participate in a written exam that tests knowledge for the position.\nOral Examination. Applicants are invited to a panel interview in which they will be evaluated by County subject matter experts.\nEligible Lists. Candidates who pass the examination will be placed on an eligible list for that classification. Eligible lists are effective for six months, but may be extended up to eighteen months.\nTENTATIVE RECRUITMENT SCHEDULE\n\nApplication Deadline: February 21, 2022\nOral Examination: Week of February 28, 2022 through March 4, 2022.\n\nNote: The eligible list generated from this recruitment may be used to fill future extra-help, part-time and full-time vacancies throughout Stanislaus County.\n\nFinal appointment will be conditional upon successfully passing a County paid pre-employment drug screening (if applicable for position) and a job-related background investigation.\n\nStanislaus County supports the good health of its workforce. More information is available at http://myclubwellness.org\n\nCell phones are typically incompatible with the online application format or browser. We recommend using a desktop or laptop computer. If you are still having technical difficulties, please call NEOGOV at 1-855-524-5627.", "url": "https://www.indeed.com/viewjob?jk=b7d697c7114549cb&from=serp&vjs=3"},
{"job_title": "Securities Lawyer-Remote", "summary": "Develop and maintain policies and procedures to ensure compliance with SEC and other securities-related regulatory requirements applicable to publicly-traded…", "company": "AlignTech", "location": "Remote in California", "job_description": "Join a team that is changing millions of lives.\n\nTransforming smiles, changing lives\nAt Align Technology, we believe a great smile can transform a person’s life, so we create technology that gives people the confidence to take on whatever’s next. We revolutionized the orthodontic industry with the introduction of the Invisalign system, and we have never lost sight of that spirit of innovation. Our diverse and collaborative teams are constantly pushing the boundaries of what’s possible.\nReady to join us?\nAbout this opportunity\nWe are looking for a talented lawyer to support our Vice President and Associate General Counsel, Corporate Securities. This is a newly created position due to growth and offers the opportunity to work closely with various cross-functional teams and make an immediate impact with your analytic rigor, business judgment, and ability to get things done.\nIn this role, you will…\nDevelop and maintain policies and procedures to ensure compliance with SEC and other securities-related regulatory requirements applicable to publicly-traded companies, including the Sarbanes-Oxley Act, Dodd-Frank Act and stock exchange listing standards and corporate governance initiatives\nSupport the preparation and review of SEC filings, including registration statements, Forms 10-K, 10-Q and 8-K, proxy statements (including shareholder proposals and proxy solicitations)\nSupport earnings preparation and reporting, including IR presentations, scripts and earning releases\nAssist with Insider Trading Policy revisions, processes and procedures, including revisions, training on best practices, and FINRA and SEC investigations, along with the review of 10b5-1 trading plans, and assist with preparation and review of Section 16 forms (including Forms 3 and 4) and Rule 144\nOversee the creation, management, compliance and dissolution of domestic and foreign entities, including the policies and procedures for establishing entities, managing and approving corporate powers, assisting with annual reporting and compliance and performing periodic compliance audits\nAssist in overall corporate secretarial functional matters, including preparation of notices, agendas and materials for board of directors and committee meetings, including board minutes, resolutions and actions, and leading preparation for annual shareholder meetings and for all company subsidiaries\nProvide counseling and training regarding Regulations FD and G and related party transactions review\nAssist with various strategic transactions including due diligence, drafting and negotiation of transactions involving mergers and acquisitions, joint ventures, and other investments\nLegal support for finance department (including global corporate reporting; tax; investor relations; the corporate communications department, and the executive compensation/human resources department)\nSupport Treasury transactions and matters, including debt offerings, credit facilities, dividend and stock repurchase programs and charitable support or foundations\nSupport the stock administration team, including review of equity plans and compliance with local securities regulations worldwide\nAssist in evolving the company’s risk management program and assist with the company’s insurance portfolio\nIdentify, prioritize and implement crisis management program enhancements and expansion across the regions\nManage the D&O Questionnaire process, including updating questionnaires, coordinating distribution, review of completed questionnaires for disclosure issues, and reviewing and assessing compensation and expenses for perks disclosures\nResponsible for tracking, executing, designing, facilitating, monitoring and collaborating with Tax concerning intercompany work relationships and transactions among and between the various corporate entities (intercompany transactions, drafting occasional make/buy analyses and price-cost analyses and noting any significant, and/or unique contract requirements, special provisions and terms and conditions to ensure compliance with applicable laws, regulations and corporate policies)\nStay abreast of new and proposed securities law and corporate governance developments, best practices and trends to ensure continued compliance and anticipate trends and changes\nAssist with other legal corporate projects as requested\nIn this role, you’ll need …\n4+ years of corporate experience with a sophisticated law firm or in-house legal department; *must include significant dedicated experience advising public companies on and preparing U.S. public company securities reporting requirements.\nExcellent communications and interpersonal skills with the ability to communicate complex legal subject matter to colleagues, as well as senior executives and board members. Adaptability and ability to self-start; must be proactive in providing counsel to internal and external clients.\nTo be a detailed-oriented and a critical thinker. You must be proactive and possess the ability to think strategically and give practical advice with a global mindset focused on creating operational efficiencies in a rapidly growing, cutting-edge company. You will have a track record of conducting a careful and thoughtful analysis of complex corporate governance and securities law issues and applying such analysis to produce high quality work.\nSound judgment; ability to clearly make reasoned decisions and recommendations; ability to cross think and determine who should be kept informed.\nTo be a self-starter with good business sense and a sense of urgency, honesty and fairness.\nTo demonstrate leadership and be comfortable working in a fast-paced, highly collaborative, team environment and demonstrate the ability to successfully handle frequent changes in priorities, deadlines, and workload. To be successful, you will need to be self-confident and inspire confidence from colleagues and clients.\nA Juris Doctorate from an accredited law school and a license to practice law.\nA strong commitment to be a legal business partner to internal clients.\nTo travel periodically, both domestically and internationally, primarily to Align locations in the United States and abroad.\nA willingness and the ability to work in a global environment, which includes handling calls outside normal working hours on a regular basis.\nExperience supporting corporate charitable organizations or foundations a plus.\nHigh integrity and ethics in all dealings.\nA good sense of humor, openness to learning, resiliency and collaborative personality.\nFamiliarity with Wdesk/Workiva a plus.\nSound like a good fit?\nGreat! Click the \"Apply\" link to let us know you are interested. Not the right fit? Don’t worry, Align is quickly growing so we are creating more opportunities to expand our Align family. Please consider joining our Talent Network to receive notifications about future jobs or sharing this opportunity with others in your network.\nAbout Align\nAlign Technology is a publicly traded medical device company that is transforming smiles and changing lives. Our global team of talented employees develop innovative technology, tools and treatment options to help dental professionals worldwide achieve the clinical results they expect. Our digital ecosystem combines the power of technology to create beautiful smiles through the integration of AI and machine learning, digital imaging and visualization, biomechanics and material science to develop the Invisalign system, the most advanced clear aligner system in the world; iTero Intraoral Scanners and OrthoCAD digital services. Did you know? Align is the world’s largest manufacturer of custom 3D-printed materials.\nBy joining Align, you will be part of a global, fast-growing company in one of the most dynamic industries. Great people, innovative technologies, and meaningful work – these are just some of the things employees say make Align Technology a great place to work.\nWe respect your privacy. Please review our Applicant Privacy Policies for additional information.\nGlobal Diversity Statement:\nAt Align, we believe in the power of a smile, and we know that every smile is as unique as our employees. As we grow, we will continue building a workforce of diverse cultural backgrounds and life experiences and fostering a culture of open-mindedness and compassion for all our employees. We live our company values by promoting healthy people and healthy communities. All with the intent of changing millions of lives, one unique smile at a time.\nUS EEO Statement:\nAlign Technology is an equal opportunity employer. We recruit, employ, train, compensate and promote regardless of race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, age, veteran or disability status.\n#LI-32160401_MB1", "url": "https://www.indeed.com/viewjob?jk=6c7ddcbce3ce5432&from=serp&vjs=3"},
{"job_title": "newTemporary Scheduling Executive Assistant", "summary": "Accommodating scheduling changes with short notice.\nReporting to the Office of Global Engagement, the Scheduling Executive Assistant (Administrative Officer III…", "company": "University of California - Irvine", "location": "Remote in Irvine, CA", "job_description": "This recruitment is for Temporary Scheduling Executive Assistant position (Administrative Officer III) through UCI's internal temporary service. Position is fully remote.\nReporting to the Office of Global Engagement, the Scheduling Executive Assistant (Administrative Officer III) will primarily be responsible for calendaring and general administrative functions for executive-level staff. Duties include, but are not limited to:\nManagement of complex calendars\nOrganizing group meetings with senior staff members\nAccommodating scheduling changes with short notice\nGeneral administrative tasks, as assigned\nCompensation Range: $31.75 per hour\nRequired:\nStrong calendaring & scheduling skills\nPrevious executive assistant or administrative support experience\nStrong writing skills and excellent attention to detail\nPreferred:\nPrevious experience supporting executive or C-Level staff members\nPlease attach resume.\nFinal candidate subject to background check. As a federal contractor, UC Irvine is required to use E-Verify to confirm the work status of individuals assigned to perform substantial work under certain federal contracts/subcontracts.\nThe University of California, Irvine is an Equal Opportunity/Affirmative Action Employer advancing inclusive excellence. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, age, protected veteran status, or other protected categories covered by the UC nondiscrimination policy.\nUCI provides reasonable accommodations for applicants with disabilities upon request. For more information, please contact Human Resources at (949) 824-0500.\nTEMPORARY EMPLOYMENT\nThis is a temporary employment recruitment reporting to the UCI Temporary Employment Services (TES) Department. Interviewing and hiring is based on internal hiring needs and how well the candidate matches the requirements and is a fit to the assignment.\nDue to the volume of resumes that we receive, only those candidates selected for interviews will be contacted. Thank you for your interest in employment with UCI Temporary Employment Services.", "url": "https://www.indeed.com/viewjob?jk=a6856ff9084f73b3&from=serp&vjs=3"},
{"job_title": "newACCOUNTING ADMINISTRATOR I (SPECIALIST)", "summary": "Under the general direction of the Accounting Administrator II (AA II), the Accounting Administrator I (Specialist) (AA I) works as part of the…", "company": "California Public Utilities Commission", "location": "Remote in Sacramento County, CA", "job_description": "Job Description and Duties\nUnder the general direction of the Accounting Administrator II (AA II), the Accounting Administrator I (Specialist) (AA I) works as part of the multidisciplinary production system support team of the Department of FISCal (FI$Cal). The incumbent will provide the necessary information and support to the departments required to transact in the FI$Cal system, and coordinate with the State Controller’s Office (SCO) to facilitate the closing of accounting modules for Month-End Close / Year-End Close (MEC/YEC) activities. The AA I plays an important role in the overall success of the FI$Cal system by providing customer support, researching and resolving system incidents, and performing as the subject matter expert (SME) for the accounting areas and modules of the system such as general ledger (GL), accounts payable (AP), project costing (PC), grants, customer contracts and support change request processing. The AA I participates in teams and workgroups in related FI$Cal areas such as the Information Technology Division and other Business Operation and Solutions Division (BOSD) sections, including ad hoc process teams.\nThe incumbent will act in a lead capacity in the AP Unit and serves as a SME in the FI$Cal Service Center (FSC) with a working level knowledge of one or more business functional areas such as accounting, GL and PC. The AA I will provide Level 2 (L2) functional support and working knowledge of data processing concepts, practices & methods to departmental end-users regarding FI$Cal system incidents and service requests in the FSC. This includes timely incident communication and resolution of reported incident tickets by FI$Cal system users.\nTelework Opportunity\nPosition is located at 2000 Evergreen Street, Sacramento, CA\nPositions at FI$Cal are eligible for part-time or full-time telework\n\nYou will find additional information about the job in the Duty Statement.\nWorking Conditions\nThe incumbent may need to be on-site to carry out their duties. This position requires the ability to work under pressure to meet deadlines and may require excess hours to be worked. The incumbent should be available to travel as needed and is expected to perform functions and duties under the guidance of the Department of FISCal’s core values. The incumbent provides back-up, as necessary, to ensure continuity of departmental activities.\nThis position requires prolonged sitting in an office-setting environment with the use of a telephone and personal computer. This position requires daily use of a copier, telephone, computer and general office equipment, as needed. This position may require the use of a hand-cart to transport documents and/or equipment over 20 pounds (i.e., laptop, computer, projector, reference manuals, solicitation documents, etc.). The incumbent must demonstrate a commitment to maintain a working environment free from discrimination and sexual harassment. The incumbent must maintain regular, consistent, predictable attendance, maintain good working habits and adhere to all policies and procedures.\n\nCandidates who reside outside of the State of California may be admitted to the job interview, but they must show proof of residence in California prior to being eligible for appointment.\nMinimum Requirements\nYou will find the Minimum Requirements in the Class Specification.\nACCOUNTING ADMINISTRATOR I (SPECIALIST)\n\nPosition Details\nJob Code #: JC-289590\nPosition #(s):\n333-450-4552-024\nWorking Title: Accounting Administrator I (Specialist)\nClassification: ACCOUNTING ADMINISTRATOR I (SPECIALIST)\n$5,913.00 - $7,402.00 A\n# of Positions: 1\nWork Location: Sacramento County\nJob Type: Permanent, Full Time\nDepartment Information\nThe Financial Information System for California (FI$Cal) is a historic partnership of the Department of Finance, the State Treasurer's Office, the State Controller's Office, and the Department of General Services — to transform the existing budgeting, accounting, procurement, and cash management systems to optimize the financial business management of the state. FI$Cal will allow the state to operate as a single enterprise for the first time in history.\nThe Department of FISCal values diversity at all levels of the organization and is committed to fostering an environment in which employees from a variety of backgrounds, cultures and personal experiences are welcomed and can thrive. FI$Cal believes the diversity of our employees and their unique ideas inspire innovative solutions to further our mission. Join FI$Cal and help us work together towards common goals through knowledge sharing and learning!\nDepartment Website: http://fiscal.ca.gov/careers\nSpecial Requirements\nThe position(s) require(s) a Background Investigation be cleared prior to being hired.\nThe incumbent will use tact and interpersonal skills to develop constructive and cooperative working relationships with others, e.g., stakeholders, customers, management, peers, etc., to facilitate communication to improve the work environment and increase productivity. Fingerprinting and background check will be required.\nApplication Instructions\nCompleted applications and all required documents must be received or postmarked by the Final Filing Date in order to be considered. Dates printed on Mobile Bar Codes, such as the Quick Response (QR) Codes available at the USPS, are not considered Postmark dates for the purpose of determining timely filing of an application.\nFinal Filing Date: 2/14/2022\nWho May Apply\nIndividuals who are currently in the classification, eligible for lateral transfer, eligible for reinstatement, have list eligibility, are in the process of obtaining list eligibility, or have SROA and/or Surplus eligibility (please attach your letter, if available). SROA and Surplus candidates are given priority; therefore, individuals with other eligibility may be considered in the event no SROA or Surplus candidates apply. Individuals who are eligible for a Training and Development assignment may also be considered for this position(s).\n\n\nApplications will be screened and only the most qualified applicants will be selected to move forward in the selection process. Applicants must meet the Minimum Qualifications stated in the Classification Specification(s).\nHow To Apply\nComplete Application Packages (including your Examination/Employment Application (STD 678) and applicable or required documents) must be submitted to apply for this Job Posting. Application Packages may be submitted electronically through your CalCareer Account at www.CalCareers.ca.gov. When submitting your application in hard copy, a completed copy of the Application Package listing must be included. If you choose to not apply electronically, a hard copy application package may be submitted through an alternative method listed below:\nAddress for Mailing Application Packages\nYou may submit your application and any applicable or required documents to:\nFinancial Information System for California\nAttn: FI$Cal - Human Resources Office\n2000 Evergreen Street\nSuite 120\nSacramento, CA 95815\nAddress for Drop-Off Application Packages\nYou may drop off your application and any applicable or required documents at:\nFinancial Information System for California\nFI$Cal - Human Resources Office\n2000 Evergreen Street\nSuite 120\nSacramento, CA 95815\n08:00 AM - 05:00 PM\nRequired Application Package Documents\nThe following items are required to be submitted with your application. Applicants who do not submit the required items timely may not be considered for this job:\nCurrent version of the State Examination/Employment Application STD Form 678 (when not applying electronically), or the Electronic State Employment Application through your Applicant Account at www.CalCareers.ca.gov. All Experience and Education relating to the Minimum Qualifications listed on the Classification Specification should be included to demonstrate how you meet the Minimum Qualifications for the position.\nOther -\nUnofficial Transcripts are required for submission. You may bypass this requirement: 1: If you meet the minimum qualifications with experience only; or 2. If you are currently working the classification.\nApplicants requiring reasonable accommodations for the hiring interview process must request the necessary accommodations if scheduled for a hiring interview. The request should be made at the time of contact to schedule the interview. Questions regarding reasonable accommodations may be directed to the EEO contact listed on this job posting.\nBenefits\nFree Parking/Electric Vehicle Charging Stations.\nThis position is eligible for telework but the incumbent must be available for occasional mandatory onsite duties.\nBenefit information can be found on the CalHR website and the CalPERS website\nContact Information\nThe Human Resources Contact is available to answer questions regarding the position or application process.\nDepartment Website: http://fiscal.ca.gov/careers\nHuman Resources Contact:\n\nHuman Resources\n(916) 576-5240\nHR@fiscal.ca.gov\nPlease direct requests for Reasonable Accommodations to the interview scheduler at the time the interview is being scheduled. You may direct any additional questions regarding Reasonable Accommodations or Equal Employment Opportunity for this position(s) to the Department's EEO Office.\nEEO Contact:\nTeresa Bunuel\n(916) 246-3519\nFISCal.EEO@fiscal.ca.gov\nCalifornia Relay Service: 1-800-735-2929 (TTY), 1-800-735-2922 (Voice) TTY is a Telecommunications Device for the Deaf, and is reachable only from phones equipped with a TTY Device.\nSpecial Instructions\nIn order for experience to be considered, applications must be completed fully, including “to” and “from” employment dates (m/d/y), hours per week and prior employer contact information including contact number. In addition applications submitted via mail or drop-off must include the JC number listed on this recruitment, and indicate the basis of your eligibility in the “Examinations or Job Title” section on your application (i.e. Training and Development, List Eligibility, Lateral Transfer, etc.). Applications without this information may be rejected. Please do not include the Equal Employment Opportunity questionnaire of the state application.\nWhen submitting supporting documents, PDF file format is preferred.\nDo NOT include ANY confidential information on any documents you submit for a job vacancy, such as your state application, resume, or educational transcripts. Confidential information that should be excluded or removed from these documents includes, but is not limited to, your Social Security Number (SSN), birth date, student identification number, driver’s license number (unless required), basis of eligibility, examination results, LEAP status, marital status, and age. Confidential information on the first page of applications submitted electronically online (i.e. SSN, examination related information, and driver’s license number) will automatically be redacted upon submission.\nPossession of minimum qualifications will be verified prior to interview and/or appointment. Applications received that do not clearly reflect how the candidate meets the minimum qualifications, and/or if the candidate does not possess list or transfer eligibility for the classification may be rejected.\n\nIf you are meeting minimum qualifications with education, you must include your unofficial transcripts for verification. Official transcripts may be required upon appointment. If it is determined a candidate does not meet the minimum qualifications, the candidate will be withheld from the eligibility list, rendering them inactive and ineligible to be hired for the position. Candidates who have been withheld may file an appeal with the State Personnel Board.\nEqual Opportunity Employer\nThe State of California is an equal opportunity employer to all, regardless of age, ancestry, color, disability (mental and physical), exercising the right to family care and medical leave, gender, gender expression, gender identity, genetic information, marital status, medical condition, military or veteran status, national origin, political affiliation, race, religious creed, sex (includes pregnancy, childbirth, breastfeeding and related medical conditions), and sexual orientation.\nIt is an objective of the State of California to achieve a drug-free work place. Any applicant for state employment will be expected to behave in accordance with this objective because the use of illegal drugs is inconsistent with the law of the State, the rules governing Civil Service, and the special trust placed in public servants.", "url": "https://www.indeed.com/viewjob?jk=951133d2b3df7329&from=serp&vjs=3"},
{"job_title": "newManager, Casting", "summary": "Support VP in overseeing all aspects of casting for Columbia Pictures, Tri Star Pictures, 3000 Pictures, Screen Gems, and Affirm Films.", "company": "Sony Pictures Entertainment, Inc.", "location": "Culver City, CA", "job_description": "Title: Casting Manager / Sony\nDepartment: Features Casting\nPosition reports to: VP Feature Casting\nSummary:\nSupport VP in overseeing all aspects of casting for Columbia Pictures, Tri Star Pictures, 3000 Pictures, Screen Gems, and Affirm Films.\nJob Description:\nCreating and maintaining cast lists for various projects for multiple divisions\nReading scripts in development and pre-production to create character breakdowns and assist in making lists of recommended actors for assigned projects\nCollect and keep accurate information regarding talent availabilities on all lists\nPrepare, coordinate and distribute talent and casting director deal memos\nProcess time sensitive information with ease and confidence and maintain high level of confidentiality\nMaintain an established, detailed system for organizing confidential information accessible to the entire department\nResearching up and coming actors, pulling clips to present to studio executives\nDistributing and following-up on documents and managing document flow\nPreparing lists and materials for meetings\nAssist VP in being the liaison between studio and various casting directors and productions\nMay be asked to review numerous auditions and narrow down the selections\nMiscellaneous duties as required\nJob Requirements:\nAt least 3-4+ years of experience in Casting capacity or related role within a studio or production environment.\nBachelor’s degree.\nSolid knowledge of the film production process\nSolid knowledge of actors\nIn-depth experience working with Talent (actors, agents)\nStrong computer skills (Microsoft Word, Cast It, Breakdown Services, Qwire and iMovie a plus)\nExceptional organizational and interpersonal skills and ability to interface with various levels of management, talent and staff\nDemonstrate ability to prioritize, meet deadlines, make preliminary decisions and change course of action quickly\nMust be up-to-date on popular and current talent and content\nMust be able to multi-task and prioritize to ensure that all assignments are completed in an accurate and timely manner\nOutstanding communication skills, written and oral\nMust be flexible – an ability to work well in an environment where needs and priorities are subject to much revision\nDependability, discretion, and attention to detail are required\nMust be a self-starter with a team-player attitude\nUnderstands the global and multicultural audienceSony Pictures Entertainment is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, national origin, disability, veteran status, age, sexual orientation, gender identity, or other protected characteristics.\nAs part of our commitment to health and safety, all U.S. non-union and O.P.E.I.U. Local 174 applicants and employees must submit proof of vaccination against COVID-19 or request and obtain approval of a reasonable accommodation based on disability or a sincerely held religious belief, practice or observance. To request an accommodation for purposes of participating in the hiring process, you may contact us at SPE_Accommodation_Assistance@spe.sony.com.", "url": "https://www.indeed.com/viewjob?jk=9994c96519697851&from=serp&vjs=3"},
{"job_title": "Legal Procedures Clerk (Entry)", "summary": "Three (3) months of full-time clerical work experience.\nUnder general supervisor, performs a variety of routine clerical support work in the processing of legal…", "company": "County of Solano", "location": "Fairfield, CA 94533", "job_description": "THE POSITIONUnder general supervisor, performs a variety of routine clerical support work in the processing of legal and other official documents such as court actions, subpoenas, criminal warrants; performs related duties as required.EXAMPLES OF DUTIESDepending on assignment, duties may include, but are not limited to tl1e following:1. Prepares and processes legal documents and records through the office to which assigned, as well as through the Courts and/or other offices based on established legal procedure or special case file notations; examines documents and/or applications for sufficiency, completeness, conformity, validity; edits, corrects errors and posts correct information; notes applicable restrictions and requirements; reconciles automated and manual records; affixes seals and stamps to endorse or certify documents; processes documents w: itlun established restrictions and requirements; calendars cases and/or maintains schedule for court appearances; prepares office recordings pertaining to cases requiring witness appearances; notifies police agencies of required appearance.2. Assists the public either on the phone or over the counter in filling-out or using forms; gatl1ers information by researching rules, procedures or codes on specific questions; screens and routes phone calls; takes or relays messages involving department staff; takes and fills out orders for services/materials from public or employees; notifies appropriate public individuals of actions taken; evaluates described problem and directs individuals/ calls to appropriate office; assists individuals in locating material/information; explains fees, bills or assessments.EDUCATIONHigh School Diploma or GED.EXPERIENCEThree (3) months of full-time clerical work experience.To view the full job description, please visit: https://www.jobapscloud.com/Solano/sup/bulpreview.asp?R1=22&R2=714070&R3=01Application Deadline: February 1, 2022 By 5:00pmJob Type: Full-timePay: $24.46 - $30.39 per hourBenefits:401(k)Dental insuranceHealth insurancePaid time offVision insuranceSchedule:8 hour shiftMonday to FridayWork Location: One location", "url": "https://www.indeed.com/viewjob?cmp=Solano-County&t=Legal+Procedure+Clerk&jk=3d8fd3d23208ded7&vjs=3"},
{"job_title": "newRegistered Nurse", "summary": "The Registered Nurse (RN), CF, under the supervision of the Supervising Registered Nurse II, CF is responsible for providing basic nursing care to inmates…", "company": "California Men's Colony", "location": "San Luis Obispo, CA", "job_description": "Until Filled\nRegistered Nurse, CF\n$106,980 - $127,512 Annual Range\n\nThe Registered Nurse (RN), CF, under the supervision of the Supervising Registered Nurse II, CF is responsible for providing basic nursing care to inmates incarcerated in the California Department of Corrections and Rehabilitation. This includes assessments, triage, scheduling, patient education, and emergency response coverage. Performs Health Care related duties consistent with the RN Scope of Practice. A detailed duty statement is available upon request.\n\nThe California Department of Public Health (CDPH) issued an Order on August 19, 2021 which requires workers working in a healthcare setting at all local and state correctional facilities and detention centers be vaccinated against COVID-19. Therefore, all workers identified under the CDPH Order are required to either be vaccinated or submit a medical or religious accommodation. While working through either of these interactive processes, staff shall wear an N95 mask and test twice-weekly (with at least 72 hours between each test) until they comply with the August 19, 2021 CDPH Order.\n\nPlease review the appropriate bulletin/assessment on the Bulletin Page for the Minimum Qualifications and, if qualified, complete the Assessment according to the instructions.\n\nHow To Apply: You may apply for this position by clicking \"Apply Now\" on the top or bottom of this page.\n\nContact Jill.Smith@cdcr.ca.gov or 559-221-3274 for your questions regarding the application process, and status of your application.\n\n\"CCHCS uses E-Verify in its hiring practices to achieve a lawful workforce. For more information about E-Verify, please go to www.e-verify.gov.\"\n\nEOE.", "url": "https://www.indeed.com/viewjob?jk=58c24d507090d0e1&from=serp&vjs=3"},
{"job_title": "Student Support Specialist", "summary": "Job Purpose: Provides customer service support to prospective and current Calbright College students.\nWorks closely with administration, faculty, management,…", "company": "Calbright College", "location": "Remote in Sacramento, CA", "job_description": "The Position\nTitle: Student Support Specialist\n\nPosition Type: Full time\n\nRequisition No: 22028\n\nCategory: Classified\n\nSupervisor: Senior Manager of Enrollment Services\n\nLast Updated: December 2021\n\nJob Purpose: Provides customer service support to prospective and current Calbright College students\n\nLocation: Remote, various locations throughout California\nPosition Overview\nThe Student Support Specialist provides information and generates excitement for prospective students. Performs a full range of technical and support duties for a diverse and varied population in an online environment. Works closely with administration, faculty, management, external entities, staff, and students. Student Support Specialists are responsible for providing support and direction for all inquiries including application and student onboarding support, basic technology support, and real-time referral support to other units in the College for maximized student success. Student Support Specialists must be flexible with schedules, as hours may include evenings and weekends.\nPerforms varied and entry-level administrative/clerical and technical program support and/or specialized functions related to the area of assignment, program, department, or office.\nEssential Job Duties and Responsibilities\nThe duties below are representative of the role and are not intended to cover all of the duties performed within the scope of work.\n\nAssists current and prospective students with various needs related to the assigned program; provides necessary information, troubleshoots issues, concerns, and assists students with accurate completion of required program documentation.\nResponds to student, faculty, staff and/or community inquiries; resolves complaints and various issues; provides direction to appropriate personnel/departments to assist with resolution, if necessary; provides information and available resources to students with the aim of resolving most issues within the first contact.\nResearches, responds, and resolves routine student program issues; referring issues of more complex areas of concern to the appropriate manager and/or administrator for consultation. Makes recommendations for mutually acceptable resolutions.\nProvides support to administrators, faculty, counselors, and managers to facilitate urgent and non-urgent student and general public communication.\nWorks closely with Student Services, Academic Success Counseling, Instructional Faculty, and other departments across the college to ensure cohesive and collaborative student service.\nProvides one-on-one assistance to students, instructors, counselors, and others.\nAssists students in navigating technical and difficult platforms and processes.\nMaintains relevant confidential student information in student database and files, and/or special program databases, and/or additional corresponding reporting systems.\nMonitors and responds to requests for service, and refers/schedules student appointments for program services, as needed; maintains records related to student changes and/or needs.\nRequired to abide by all college policies and procedures.\nPerform other related duties as assigned that support the objective of the position.\nKnowledge, Skills, and Abilities\n\nRequires basic knowledge of and use of communication tools, and technologies with accurate documentation of inquiries and follow-through on next steps.\nRequires knowledge of program support principles and practices.\nRequires proficient knowledge of computer applications including common office productivity software, internet, and software applications and platforms supporting academic and higher education in general.\nRequires proficient knowledge of specialized, program-specific computer applications or reporting databases.\nRequires sufficient English language and writing skills sufficient to prepare materials and reports.\nRequires well-developed oral communication skills to convey concepts in individual and group settings\nRequires intercultural communication skills and cultural competency to work cooperatively with a diverse population of students and service providers.\nDemonstrated commitment to improving outcomes for all students, particularly disproportionately impacted populations.\nRequires the ability to perform the essential responsibilities and functions of the position.\nRequires the ability to be flexible and adaptable in a fast-paced environment.\nRequires the ability to work independently and remotely with minimal supervision.\nRequires the ability to work cooperatively with students, faculty, and staff, as well as external service providers, families, community organizations, and other agencies.\nRequires the ability to develop and maintain active advocacy relationships with students.\nRequires the ability to organize and prioritize work, manage time, and meet program deadlines.\nRequires the ability to communicate in a professional manner, orally and in writing, in both formal and informal settings with students, faculty, staff, managers, and others involved with the program.\nRequires the ability to maintain confidentiality.\nDemonstrate understanding of, sensitivity to, and respect for the diverse academic, socio-economic, ethnic, religious, and cultural backgrounds, disability, and sexual orientation of community college students, staff, and faculty.\nMinimum Qualifications\n\nThe position requires a High School diploma or equivalent and at least 2 years of experience in a highly responsible customer support capacity, involving frequent customer contact, preferably in an educational environment. One year of college-level courses can substitute for one year of experience.\nDesired Qualifications\n\nExperience with Salesforce or other customer relationship management software.\nWorking Conditions and Travel\n\nCalbright College is a statewide online college where all instruction and support are done via various online technologies both in person and remotely. Calbright College has administrative offices in Sacramento available for use. When working remotely, employees should be able and willing to use digital communication tools as used by the college, and have the ability to work on a computer for extended periods of time.\nRegular attendance is considered an essential job function; the inability to meet attendance requirements may preclude the employee from retaining employment.\nThe person holding this position is considered a mandated reporter under the California Child Abuse and Neglect Reporting Act and is required to comply with the requirements set forth in Calbright College policies, procedures, and Title IX.\nCalbright College celebrates all forms of diversity and is deeply committed to fostering an inclusive environment within which students, staff, administrators, and faculty thrive. Individuals interested in advancing Calbright College’s strategic diversity goals are strongly encouraged to apply. Reasonable accommodations will be provided for qualified applicants with disabilities who self-disclose.\nRequires the ability to function in a remote online instructional and support environment performing work of primarily a sedentary nature. Requires the ability to use hearing and speech to make presentations to groups and carry on conversations over the phone and in-person. Requires speaking skills to communicate with staff and students in one-on-one and small group settings, on the phone, and to distinguish sound prompts from various types of equipment. Requires near visual acuity to read printed materials and computer screens. Requires sufficient hand/arm/finger dexterity to retrieve work materials, operate a personal computer keyboard, and operate standard office equipment. Requires the ability to lift and/or move up to 25 pounds.\nWork is performed indoors where minimal safety considerations exist.\nEqual Employment Opportunity\nCalbright College provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, gender expression, national origin, age, veteran status, disability or genetics. In addition to federal law requirements, Calbright College complies with applicable state and local laws governing nondiscrimination in employment.\nWho We Are\nCalbright College is one of California’s newest community colleges – the first statewide, online campus designed to bridge the gap between employers with unfilled positions and students who don’t have either the time or money to attend a traditional school. Our mission is to increase economic mobility and close equity gaps for working adults who lack easy access to traditional forms of higher education by offering online, flexible, affordable skills-based programs that provide tangible economic value for both working adults and hiring managers.", "url": "https://www.indeed.com/viewjob?jk=8883c58ffe07d6f6&from=serp&vjs=3"},
{"job_title": "Registered Nurse", "summary": "Candidates must be flexible, have a positive attitude, and excellent communication skills with the ability to maintain positive relationships with physicians,…", "company": "Aesthetx Surgery Center", "location": "Campbell, CA 95008 (White Oak area)", "job_description": "Aesthetx Surgery Center has immediate openings for full-time, part-time and per-diem peri-operative registered nurses.Aesthetx Surgery Center is a physician owned boutique-like, out-patient surgery center located in beautiful Campbell, CA. The physician founders are renowned plastic surgeons well respected in the community. The surgery center is equipped with state-of the-art equipment and employs other highly qualified medical personnel.Qualified candidates will have experience in a surgical setting, preferably with the ability to work in pre-operative, post-operative and operating room positions. Candidates must be flexible, have a positive attitude, and excellent communication skills with the ability to maintain positive relationships with physicians, patients, co-workers, and managers.Job Types: Full-time, Part-time, Per diemPay: $60.00 - $85.00 per hourBenefits:401(k)401(k) matchingDental insuranceHealth insurancePaid sick timePaid time offVision insuranceMedical Specialty:SurgeryPhysical Setting:OutpatientSchedule:Day shiftSupplemental Pay:Overtime payCOVID-19 considerations:Strict COVID-19 protocols are in place.Education:Associate (Required)Experience:Nursing: 1 year (Required)License/Certification:ACLS Certification (Required)RN (Required)Work Location: One location", "url": "https://www.indeed.com/viewjob?cmp=Aesthetx-Surgery-Center&t=Registered+Nurse&jk=f21e7967520c3147&vjs=3"},
{"job_title": "Mathematics & Physics Teacher, Upper School", "summary": "We seek to hire a highly qualified individual for a full-time position teaching Mathematics along with some 9th grade physics at our Upper School Campus.", "company": "The Harker School", "location": "San Jose, CA 95129 (West San Jose area)+2 locations", "job_description": "Harker attracts teachers who are experts in their fields, love working with children and who, through their teaching, inspire students to reach their highest potential. The Harker teacher creates a rich learning environment within and beyond the classroom so that students can find their places in the world today. Harker teachers, like the students, also care about the community, fostering the values that contribute to a successful and happy life.We seek to hire a highly qualified individual for a full-time position teaching Mathematics along with some 9th grade physics at our Upper School Campus. The position starts in August for the 2022-2023 school year. For information about our academic programs, please visit us at https://www.harker.org.Has at minimum, a bachelor's degree in subject area; MA preferredHas three+ years of teaching experience in relevant subject area and appropriate grade level divisionHas ability to create and communicate well-organized, meaningful, and creative lesson plans that incorporate teaching strategies in a thoughtful manner to further and maximize student learningDemonstrates collaboration, collegiality, and organizationAbout The Harker School: Harker is a coeducational, non-sectarian, college preparatory school serving TK through grade 12. Harker has three campuses (lower, middle, and upper schools) located within minutes of each other in San Jose. For more than 100 years, Harker's mission has remained constant: to create an environment that promotes academic excellence, inspires intellectual curiosity, expects personal accountability, and forever instills a genuine passion for learning. Were tremendously proud of our century-old tradition of excellence in education, and the international recognition our students, faculty and programs have earned.Our Mission: Our mission is to educate students for success at college and beyond, and to foster kindness, respect, and integrity within a safe and nurturing environment. We achieve academic excellence through the development of intellectual curiosity, personal accountability, and love of learning. Our comprehensive program and exceptional faculty and staff help students discover, develop, and enjoy their unique talents. We honor individuality, embrace diversity, and promote leadership and service, preparing students to take their place as global citizens.Location: 500 Saratoga Ave., San Jose, CA 95129Job Type: Full-time", "url": "https://www.indeed.com/viewjob?cmp=The-Harker-School&t=Mathematic+Physic+Teacher&jk=7088ab35527f047e&vjs=3"},
{"job_title": "HR Ops Services Representative (Mid-west- Remote Position)", "summary": "The HROSC Representative position is responsible for problem identification, accurate documentation, and clear communication to Operations associates in…", "company": "Panda Restaurant Group", "location": "Remote in Rosemead, CA+1 location", "job_description": "At Panda, we all share a common mission: \"Deliver exceptional Asian dining experiences by building an organization where people are inspired to better their lives.\" We invest in our people because great people run great operations that will exceed our guests' expectations. Talk to any of our associates and you will experience a culture dedicated to its mission and our five fundamental values- Proactive, Respect/Win-Win, Growth, Great Operations, and Giving.\n\nPanda Restaurant Group includes the original Panda Inn fine dining restaurants, Panda Express, our Gourmet Chinese food concept served in a fast casual environment, and Hibachi San, our Japanese grill concept. The family owned and operated company is still run by founders Andrew and Peggy Cherng.\n\nPanda offers competitive benefits and rewarding opportunities, from entry-level positions to management. We have restaurant positions available nationwide and support center positions in Rosemead, CA. Come join the nation's largest and fastest growing Asian restaurant company.\n\n\nJob Description\n\n\n The HROSC Representative position is responsible for problem identification, accurate documentation, and clear communication to Operations associates in resolving their inquiries on HR processes and programs. The HROSC Representative also handles specialized assignments involving unemployment claims, leaves of absence, and other HR activities to ensure HR processes are carried out accurately and on a timely basis on behalf of Operations associates. This position also conducts training at regional Operations meetings on HR processes/benefits\n\n\nRequirements\n\nProvides responses to Operations associates concerning a wide variety of HR practices and processes, such as benefits, hiring processes, and employment verification, on a timely and accurate basis.\nIdentifies location with common questions and issues and attends regional Operations meetings to provide training on HR processes and company benefits, focusing on issues specific to the location.\nHandles specialized assignments involving unemployment claims, leaves of absence, state-specific tax forms, and other activities as required to support Operations. Ensures that appropriate documentation is prepared so that new hire transactions and existing employee changes can be processed.\nSolicits input from Operations and other functions on how to improve HR processes using technology.\n\nRequirements\nBachelor’s degree required.\nMinimum two years of experience, preferably in a retail/hospitality operations environment.\nSuccessful completion of annual store training.\nIf hired, must provide proof of full vaccination on your start date, unless prohibited by federal, state, or local law. Full vaccination means two weeks or more have passed after receiving the second dose in a two-dose series, or more than two weeks after receiving a single-dose vaccine. Examples of proof of full vaccination include an original, photocopied, or digital completed vaccination card which includes your name, type of vaccine provided, and date last dose administered.\nPanda Restaurant Group’s culture is strongly guided by our Mission and Values, highlighted on the Panda websites. We recommend all interested candidates become familiar with our Mission and Values, as well as the principles of The Seven Habits of Highly Effective People, by Stephen Covey.\n\nPanda Restaurant Group, Inc. is an Equal Opportunity Employer.", "url": "https://www.indeed.com/viewjob?jk=74f505cbdb7bb613&from=serp&vjs=3"},
{"job_title": "newTrader Development Program", "summary": "Participants will build solid understanding and hands on experience of the key systems associated with the life of a deal – Operations, Demurrage/Claims,…", "company": "Shell", "location": "San Diego, CA", "job_description": "The Role\nWhat’s the role?\nShell Trader Development Programme (TDP) is a dynamic, individualized programme like no other. Typically, it takes 2-3 years to complete but no two trainees follow the same route. We’ll assess your strengths, weaknesses, experience and aptitude and then tailor a rotational programme that allows you to develop the competences you need – both to meet the requirements of the trading desk you’re assigned to today and to be an accomplished, all round trader tomorrow.\nYou’ll be working alongside, and learning from, some of the best traders in the business; tapping into a wealth of insight and experience. Participants will build solid understanding and hands on experience of the key systems associated with the life of a deal – Operations, Demurrage/Claims, Contracts, Credit, Risk Control, Scheduling, Analysis and Trading strategies/ fundamentals.\nThere are regular performance reviews and assessments to review your progress and support your development with the right level of coaching and feedback. Along the way, you’ll sharpen your ability to analyse markets and manage risk and learn how to successfully negotiate and structure deals – everything you'll need to apply for a permanent trading role with us on completion. It is contingent to pass all relevant assessments and achieve sign-off from the programme to be considered Trader Ready and to be competitive for any trader roles. In the event that candidates do not meet the criteria to be signed off from the programme or become a full time Trader, on mutual agreement their departure window will open, they will be supported to find alternative roles as per local policy.\nWhat we need from you\nMust have legal authorization to work in the US on a full-time basis for anyone other than current employer.\nBachelor's degree is required.\nYou don’t need trading experience to join us, but would possess minimum of 2 years of work experiences. You could come from any of the CoBs in Shell - Finance, Manufacturing, or any of our commercial businesses.\nCommercial acumen\nYou’ll need to cultivate an incisive understanding of global energy markets work – that means you should be entrepreneurial, self-motivated and commercially acute. With a keen interest in how business works, you’re passionate about working in trading and excited by the prospect of unearthing opportunities to create monetary value.\nAnalytical\nYou’re numerate and highly analytical. You’ve shown you can digest wide amounts of information from different sources, pinpoint the relevant details from a huge range of data, and synthesize it to form critical insights and trading strategies.\nAdaptable\nThe market changes by the minute so you need to be comfortable thinking on your feet and making quick decisions, even if you don’t have all the facts at your command. Speed of thought is vital; you’re someone who can move easily between a micro and macro view.\nCollaborative\nThis is a highly open, collaborative environment where we achieve results through teamwork. You’ll\nbe talking to colleagues and contacts all over the world, so you’ll need to be able to change your social style to suit your audience. We value people who’ve proven they can persuade and influence; in English and in a mother tongue like Arabic or Chinese if you are operating in those markets.\nResponsible\nIn trading, the risks you take must be calculated and the decisions you make considered. You’ll be\naccountable: someone who takes responsibility for their decisions and can adhere to both the letter and the spirit of all relevant legislation. You’ll always work with Shell’s values of honesty, integrity and respect for others firmly in mind.\nAn innovative place to work\nThere’s never been a more exciting time to work at Shell. Everyone here is helping solve one of the biggest challenges facing the world today: bringing the benefits of energy to everyone on the planet, whilst managing the risks of climate change.\nJoin us and you’ll add your talent and imagination to a business with the power to shape the future – whether by investing in renewables, exploring new ways to store energy or developing technology that helps the world to use energy more efficiently.\nAn inclusive place to work\nTo power progress together, we need to attract and develop the brightest minds and make sure every voice is heard. Here are just some of the ways we’re nurturing an inclusive environment – one where you can express your ideas, extend your skills and reach your potential…\nWe’re creating a space where people with disabilities can excel through transparent recruitment process, workplace adjustments and ongoing support in their roles. Feel free to let us know about your circumstances when you apply, and we’ll take it from there.\nWe’re closing the gender gap – whether that’s through action on equal pay or by enabling more women to reach senior roles in engineering and technology.\nWe’re striving to be a pioneer of an inclusive and diverse workplace, promoting equality for employees regardless of sexual orientation or gender identity.\nWe consider ourselves a flexible employer and want to support you finding the right balance. We encourage you to discuss this with us in your application.\nA rewarding place to work\nCombine our creative, collaborative environment and global operations with an impressive range of benefits and joining Shell becomes an inspired career choice.\nWe’re huge advocates for career development. We’ll encourage you to try new roles and experience new settings. By pushing people to reach their potential, we frequently help them find skills they never knew they had, or make career moves they never thought possible.\n\n\nDisclaimer\nPlease note: We occasionally amend or withdraw Shell jobs and reserve the right to do so at any time, including prior to the advertised closing date. Before applying, you are advised to read our data protection policy. This policy describes the processing that may be associated with your personal data and informs you that your personal data may be transferred to Royal Dutch/Shell Group companies around the world. The Shell Group and its approved recruitment consultants will never ask you for a fee to process or consider your application for a career with Shell. Anyone who demands such a fee is not an authorised Shell representative and you are strongly advised to refuse any such demand. Shell participates in E-Verify. All qualified applicants will receive consideration for employment without regard to race, color, sex, national origin, age, religion, disability, sexual orientation, gender identity, protected veteran status, citizenship, genetic information or other protected status under federal, state or local laws. Shell is an Equal Opportunity Employer - Minorities/Females/Veterans/Disability. As a US Federal Contractor, hiring selections are subject to periodic audit review and documentation of your selections should be maintained for a period of three calendar years. It is the policy of Shell in the U.S. (“Shell”) to provide equal opportunity to all individuals, employees and all qualified applicants for employment consistent with employment requirements and qualifications. Shell prohibits discrimination based on race, color, sex, national origin, age, religion, disability, sexual orientation, gender identity, veteran status, citizenship, genetic information, or other protected status under federal, state or local laws. All employees are expected to support this policy and contribute to an environment of equal opportunity. If you need an accommodation for a disability during the resourcing process, please speak with an HR representative.", "url": "https://www.indeed.com/viewjob?jk=7d705712ab2c45b5&from=serp&vjs=3"},
{"job_title": "2022-2023 Peer Resources Teacher Pool", "summary": "Additional salary stipend of $2000 for credentialed teachers teaching in high potential schools and a $1000 stipend for teachers teaching hard to fill subject…", "company": "San Francisco Unified School District", "location": "San Francisco, CA 94102 (Downtown area)+27 locations", "job_description": "2022-2023 Peer Resources Teacher Pool Position\nSFUSD employees applying to positions should use the EMPowerSF Careers page to submit an application.\n\nAny valid CA credential with English Learner Authorization required. This is a pool position for the 2022-23 SY. Please apply if you are interested in being considered for Peer Resources positions across SFUSD.\n\nWho We Are\n\nThe San Francisco Unified School District (SFUSD) is the seventh largest school district in California, serving more than 57,000 students who speak more than 44 documented languages across 132 schools in the city of San Francisco every year. We aim for every student who attends SFUSD schools to discover his or her spark, along with a strong sense of self and purpose. Our goal is that all students graduate from high school ready for college and career, equipped with the skills, capacities and dispositions outlined in SFUSD’s Graduate Profile. Every day in our quest to achieve this mission we provide each and every student the quality instruction and equitable support required to thrive in the 21st century.\nWhat It Means to Work Here\n\nWhen you join our team at SFUSD you can expect to be part of an inclusive, innovative and equity-focused organization that approaches public education as a social justice movement, requiring broad collaboration across an array of strategic partners. In 2014, SFUSD created an inspiring statement, Vision 2025, which captures our aspirations and vision for the future of public education in San Francisco. Alongside the District’s strategic plan, Transform Learning. Transform Lives.SFUSD is reimagining how public education will change over the next decade to meet the dynamic future of San Francisco. As aCORE district, SFUSD is also a leader in critical systems change for more comprehensive school accountability and innovations that help strengthen the instructional core, which is the foundation of our strategic plan and Vision 2025.\nWho We Want\n\nWe want talented people with diverse backgrounds and experiences, who are inspired by our mission steeped in equity, and who are motivated to unleash our children’s potential. We want people who are strong collaborators, skilled communicators, and problem solvers comfortable in a community of continuous learning.\n\nWe have high need for teachers in the following areas:\n\nBilingual (Cantonese, Mandarin, Spanish)\nSpecial Education (Mild/Moderate, Moderate/Severe, Deaf & Hard of Hearing, Early Childhood Special Education)\nPhysical Education\nMath\nScience\nMinimum Qualifications\n\nSFUSD requires all teachers to hold or be pursuing a valid California teaching credential and an English Learner or Bilingual Authorization. We welcome applications from teachers who have not yet received their credentials, and our Credentials Team is happy to work with each teacher who's accepted a position in SFUSD to apply for permits that allow them to teach while pursuing a credential.\nDesired Qualifications\nWhat We Offer\n\nSFUSD is committed to attracting and retaining the best educators in the nation. Benefits of teaching in San Francisco include:\n\nCompetitive salaries determined by experience, education level, and credentials\nComprehensive medical, vision, and dental insurance for teachers and their eligible dependents\nCity and state programs for housing assistance:\nTeacher Next Door Program: https://sfmohcd.org/teacher-next-door\nMyHome Assistance Program: https://www.calhfa.ca.gov/homebuyer/programs/myhome.htm\nAdditional salary stipend of $5000 for National Board Certified teachers\nAdditional salary stipend of $2000 for credentialed teachers teaching in high potential schools and a $1000 stipend for teachers teaching hard to fill subject areas\nHow to Apply\nGo to: https://careers.sfusd.edu/\nCreate an account and complete an application.\nGo to the “Current Openings” tab to view and apply for specific openings.\n\nPlease check back often to connect your application to specific openings as they are posted. Applicants will be contacted based on the needs of the district. For more information about careers at SFUSD, please visit https://careers.sfusd.edu/. For more information about SFUSD’s mission and Strategic Plan please visit www.sfusd.edu. For other questions, contact us at teach@sfusd.edu.\nNon-Discrimination Policy\n\nSan Francisco Unified School District programs, activities, and practices shall be free from unlawful discrimination, harassment, intimidation, and bullying based on actual or perceived race, color, ancestry, national origin, ethnic group identification, age, religion, marital or parental status, physical or mental disability, sex, sexual orientation, gender, gender identity, or gender expression; or on the basis of a person’s association with a person or group with one or more of these actual or perceived characteristics. This policy extends to San Francisco County Office of Education, including community school programs and activities. For more information about the District's non-discrimination policy, please review Board Policy 4030.\n\nNearest Major Market: San Francisco\n\nNearest Secondary Market: Oakland", "url": "https://www.indeed.com/viewjob?jk=ea78b185382c9a25&from=serp&vjs=3"},
{"job_title": "Child Development Ctr, Teacher II", "summary": "Minimum of 3 years direct classroom experience as a teacher.\nChild Care Services supports our faculty, staff and graduate students families with child…", "company": "University of California - Irvine", "location": "Irvine, CA", "job_description": "The Division of Student Affairs is committed to developing the whole student by ensuring your life outside of the classroom complements your academic endeavors. This means providing enriching opportunities that affirm your experiences. Our efforts are guided by student learning outcomes within the following domains: • Civic & Community Engagement • Leadership Development • Diversity & Global Consciousness • Professional & Administrative Skills • Personal Responsibility The UCI campus is an exciting and dynamic place where you will engage in experiences that will be inspirational, life changing, and may also challenge your current thinking. Child Care Services supports our faculty, staff and graduate students families with child development, education and services for their children.\nDepartment Substitute at 5 centers, Early Childhood Education Center, Verano Preschool, Children’s Center, Extended Day Center and Infant Toddler Center. Responsible for co-supervising the day-to-day operation of the children in a preschool setting. Responsibilities include planning curriculum and outdoor activities, assist in supervision of practicum and field study students.\nCompensation Range:\n$21.54 - $25.03\nDepartment Website:\nhttps://childcare.uci.edu/\nRequired:\nMinimum of 2 years’ experience in an early childhood development program with supervisory/ management responsibility. Minimum of 3 years direct classroom experience as a teacher. Experience working with children ages 2 months to 36 months in a group setting. Maintain active/ valid First Aid/ CPR cards, completion of 15 hour First Aid/ CPR training.\nMust have three units of Infant Toddler course work.\nBachelor's degree in related area and / or equivalent experience / training.\nCalifornia Child Development Permit – either holds an active permit or must show proof that you qualify.\nCurrent California Child Development Program Permit.\nDocumentation of absence of active tuberculosis.\nCurrent First Aid and CPR Certification.\nExperience working with preschool age children in a supervised capacity.\nKnowledge of first aid and health practices appropriate for children ages 3 months to 12 years of age.\nAbility to demonstrate a nurturing, warm and supportive attitude when interacting with children\nPhysical Stamina\nA minimum of 3 units in Infant Development.\nCalifornia Child Development Permit – either holds an active permit or must show proof that you qualify\nKnowledge of appropriate activities (physical, emotional, language, social and cognitive) for this age group.\nFinal candidate subject to background check. As a federal contractor, UC Irvine is required to use E-Verify to confirm the work status of individuals assigned to perform substantial work under certain federal contracts/subcontracts.\n\nThe University of California, Irvine is an Equal Opportunity/Affirmative Action Employer advancing inclusive excellence. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, age, protected veteran status, or other protected categories covered by the UC nondiscrimination policy.\n\nUCI provides reasonable accommodations for applicants with disabilities upon request. For more information, please contact Human Resources at (949) 824-0500.", "url": "https://www.indeed.com/viewjob?jk=64127ecfe93f6760&from=serp&vjs=3"},
{"job_title": "Bilingual (Spanish / English) Customer Service Representativ...", "summary": "You’re someone who can provide concierge style phone service to our customers in a helpful and respectful manner on every call.\nFluent in English and Spanish.", "company": "Bold Business", "location": "Remote in San Jose, CA+1 location", "job_description": "We’re looking for a customer service representative who is excited to work from home (100% remote).\nWhat does a Work From Home bilingual Customer Representative really do?\nYou’re someone who can provide concierge style phone service to our customers in a helpful and respectful manner on every call. You’re great on the phone and you’re confident you can always find a way to connect with anyone you talk with. We’re looking for top-notch people with coachable attitudes so this isn’t for everyone.\nThis is a part-time role starting immediately. Must be fluent in English and Spanish. Shifts available between 8am EST and 11pm EST Monday through Sunday.\nAs a Bilingual (Spanish / English) Call Center Representative you will have:\nGreat Phone Etiquette — manage inbound and outbound customer calls in a professional manner\nBe a Problem Solver— identify customers’ needs, clarify information, research issues and provide solutions\nTech Savvy —document customer interaction according to company operating procedures\nCoachable — open to following phone scripts when handling rejections\nWhy we think this job is great:\nIt’s a remote full-time, 100% remote position where you’ll work from home\nYou’ll have clear goals and the resources you need to deliver. How you execute and deliver is up to you\nWhat are the requirements:\nFluent in English and Spanish\nAvailable 25-30 hours per week starting immediately\nExperience in an outbound call center, inside sales experience, or related sales experience\nAdaptable and flexible, demonstrating abilities to work with process and information changes\nAbility to work independently or as an active member of a team\nAbout Us\nBold Business is a remote-first, global outsourced-solutions company with over $7B in service solutions over the past 25 years. Our international team helps the world’s leading companies transform their ideas into bold impacts. From Fortune 500 organizations looking to reduce operational costs by 40%-60% to fast-growth startups looking to scale, we work behind the scenes and empower companies to do more for less.\nIf you like to move fast and have a bias for action, you’ll fit right into our fast-paced, results-based environment. We’re a 100% remote/virtual team environment where you can work from wherever you are.", "url": "https://www.indeed.com/viewjob?jk=59920a6f310f7b19&from=serp&vjs=3"},
{"job_title": "newRecruiting Specialist (Part Time", "summary": "This is a part time, temporary, work from home/remote opportunity (25-30 hours a week).\nAs a Recruiting Specialist (part time/temporary) you will play an…", "company": "The Cheesecake Factory", "location": "Remote in Calabasas Hills, CA", "job_description": "Overview\nThis is a part time, temporary, work from home/remote opportunity (25-30 hours a week)\nPosition Overview:\n\nYou may know us as a company with great food…You may also know us from being named to the FORTUNE Magazine “100 Best Companies to Work For®” list…What you may not know is how much fun it is to staff our restaurants!\nAs a Recruiting Specialist (part time/temporary) you will play an integral part in driving the high-volume recruiting of a wide range of hourly positions within our restaurants. (Server, Host, Line Cook, Dishwasher, etc.) You’ll have the opportunity to learn the ins and outs of how a Recruiting department functions by interacting with the entire team as well as cross functionally with other departments.\nReporting to the Associate Director, Talent Selection you will work with a recruiting team of 20 located in Calabasas Hills, CA, supporting the recruiting function for a global $2 billion public company with over 300 full-service restaurants and more than 42,000 staff members.\nYou’ll thrive in this opportunity if you are:\nA strong communicator: you’re capable of articulating a message in a clear, concise and conversational manner.\nService minded: you’re a people person who effortlessly provides exceptional support whether it’s over the phone or in person.\nDriven by results: you are conscientious and persistent about delivering timely, high quality deliverables. You are never satisfied with your latest accomplishment and are always focused on hitting your next goal.\nResponsibilities\nHere’s more of what you will get to do:\nResearch indeed.com resume boards for qualified candidates and engage them through phone, email and text.\nMonitor, respond and engage with candidates who apply to job ads.\nReview and phone screen a high volume of hourly restaurant applicants for Server, Baker, Cashier, Host, Line Cook, Dish etc.\nSchedule applicant on site interviews with the restaurant management team.\nFollow up to gather feedback for hiring managers and report out on activity and hires.\nQualifications\nRequirements:\nRequired:\nAvailable to work a minimum of 25 hours per week.\nProficient in MS Office (Word, Excel, Outlook, PowerPoint)\nExcellent verbal and written communication skills\nPreferred:\nA minimum of 1+ years recruiting experience\nBilingual (Spanish/English)\nPrevious experience working within a casual restaurant\nThis is a part time, temporary, work from home/remote opportunity (25-30 hours a week)\nAbout the Company\nRecognized as one of the FORTUNE “100 Best Companies to Work For®” eight years in a row, The Cheesecake Factory Incorporated operates almost 300 restaurants – including The Cheesecake Factory, North Italia, Grand Lux Cafe, Social Monk and Fox Restaurant concepts. Internationally, twenty-seven The Cheesecake Factory® restaurants operate under licensing agreements. Our bakery division operates two facilities that produce delicious cheesecakes and other baked products for our restaurants, international licensees and third-party bakery customers. Continuing on our path to becoming a Global Iconic Brand, we are a $2B public company with more than 40,000 staff members, 430 of whom work at the corporate support center in Calabasas Hills, CA.\n#SoCheesecake #LifeAtCheesecake\nWe are an e-verify and equal opportunity employer. We are committed to creating an inclusive and welcoming workplace for all. We welcome applicants from a wide variety of identities, ideas, perspectives and experiences and encourage people from underrepresented backgrounds to apply. The Cheesecake Factory offers reasonable accommodations to job applicants with disabilities.\nCompensation Range\n..", "url": "https://www.indeed.com/viewjob?jk=00df8ce856fe3e52&from=serp&vjs=3"}