[
{"job_title": "newMedical Records Processing Specialist", "summary": "HealthMark Group's innovative technology and superior customer service enable clients to streamline operations by outsourcing administrative support functions…", "company": "HealthMark Medical Group", "location": "+2 locationsRemote", "job_description": "Records Processing Specialist- Salem Support\nWork Remote\nJob Description\nHealthMark Group is a leader in health information management and technology focusing on serving the health information management needs of physician practices and hospitals throughout the nation. HealthMark Group's innovative technology and superior customer service enable clients to streamline operations by outsourcing administrative support functions such as the release of information and form completion processes. By integrating experience, technology and service, we help hospitals, health systems and clinics concentrate on what they do best, patient care.\nHealthMark Group is growing and looking for bright, energetic and motivated candidates to join our team. This is an entry level position and an exciting opportunity for someone looking to start their career with a fast-growing company.\nWe are expanding rapidly and have created unique roles that need qualified candidates.\nEntry level job duties include but not limited to:\nProcessing medical record requests\nHigh volume and fast paced environment\nReports directly to the Processing Manager\nAssist as needed in overflow processing due to high volume issues and/or coverage issues\nAbide by HIPAA guidelines while ensuring the confidentiality of PHI\nMaintain consistent schedule by processing all requests within 24-48 hours of receipt for assigned accounts\nAssist as needed in overflow processing due to high volume issues and/or coverage issues\nProvide feedback regarding request volume and perceived issues\nMonitors incoming requests received through various means\nGeneral office duties\nQualities that the candidate for this position should include:\nFast learner\nDependable\nQuick worker\nTeam player\nPositive attitude\nSomeone who strives to do more\nWhen applying, it would be greatly appreciated if you would complete the assessment screening process. This helps us to set candidates apart and make more informed decisions.\nIn accordance with our company policy, Full Time Employees are eligible for the following benefits:\nRobust Health Insurance Plan Options with Company Coverage\nCompany HSA Account Contributions for Eligible Health Plans\nVision and Dental Plan Options\nCompetitive Paid Time Off including Paid Holidays\nQuarterly Offsite Team Building Events\nMonthly Birthday/Anniversary Lunches\n401(k) Plan Offering with Employer Matching\nlwqv1dlGe2", "url": "https://www.indeed.com/viewjob?jk=25e3a1018992933c&from=serp&vjs=3"},
{"job_title": "IT Specialist II", "summary": "The incumbent is a lead programmer responsible for the design, development, and implementation of Web, desktop server and mobile applications, including system…", "company": "State of California-Student Aid Commission", "location": "Remote", "job_description": "Under the general direction of the Information Technology (IT) Manager I of the Application Development Team, the IT Specialist II works independently with the Program Administration and Services Division serving as a technical and expert lead for the most complex and time sensitive information technology projects. The incumbent is a lead programmer responsible for the design, development, and implementation of Web, desktop server and mobile applications, including system databases and stored procedures.This position may have some in office work as well. Please see the link to apply for further details on the location.Job Types: Full-time, TemporaryPay: $7,700.00 - $10,318.00 per monthBenefits:401(k)Dental insuranceEmployee assistance programFlexible scheduleFlexible spending accountHealth insurancePaid time offParental leaveProfessional development assistanceRetirement planTuition reimbursementVision insuranceSchedule:Monday to FridayCOVID-19 considerations:As a potential employee of the California Student Aid Commission, verification of full COVID-19 vaccination status must be confirmed on your first day of employment with the California Student Aid Commission. Vaccination records can be confirmed electronicWork Location: Remote", "url": "https://www.indeed.com/viewjob?cmp=State-of-California--Student-Aid-Commission&t=IT+Specialist&jk=e98d28ba659440a2&vjs=3"},
{"job_title": "newPermit Clerk I", "summary": "Eighteen (18) months full-time experience in clerical public contact work.\nMust have the use of sensory skills in order to effectively communicate and interact…", "company": "City of Miami Beach, FL", "location": "Miami Beach, FL 33139 (City Center area)", "job_description": "Nature of Work\nThis is specialized responsible clerical work processing construction permit applications including moderately complex work procedures. Employees in this classification are responsible for reviewing construction permit applications, issuing construction permits, securing inspection approval, and recording completed projects. Duties include assisting owners, contractors, and developers in filing applications for building permits, determining the completeness of permit applications, and obtaining the required documents to ensure compliance with established rules and regulations. Some judgment is exercised in the application of departmental rules, regulations and procedures. Supervision is received from a supervisor who periodically reviews work through personal observation and conferences for compliance with departmental operating procedures.\nIllustrative Examples of Essential Duties\nReceives various construction permit applications from a variety of sources\nIssues and distributes plans to appropriate personnel for review and inspection\nIssues construction permits following review and approval\nOperates microfilming equipment, calculators, and other office equipment, including the incidental use of a typewriter\nEnters the applicable contractor, architect, and construction related data into computerized permitting system\nAssists the public by telephone or in person to obtain necessary documents and forms and by supplying answers to a variety of procedural questions\nOperates a two-way radio to dispatch inspectors\nAssembles and summarizes material from files, cross references data, locates information requested and prepares simple analysis of data\nPerforms related duties as required\nMinimum Requirements\nEighteen (18) months full-time experience in clerical public contact work\nPermit Technician Certification preferred\nPHYSICAL REQUIREMENTS\n\nMust have the use of sensory skills in order to effectively communicate and interact with other employees and the public through the use of the telephone and personal contact\nPhysical capability to effectively use and operate various items of office related equipment, such as, but not limited to, word processor, calculator, copier, and fax machines\nNo significant standing, walking, moving, climbing, carrying, bending, kneeling, crawling, reaching, handling, sitting, standing, pushing, and pulling\n\nFor all positions:\nAbility to establish and maintain effective working relationships with elected officials, coworkers, the press the general public and members of diverse cultural and linguistic backgrounds regardless of race, religion, age, sex, disability, political affiliation, gender identity or sexual orientation.\nAbility to serve the public and fellow employees with honesty and integrity in full accord with the letter and spirit of all city ethics and conflicts of interest policies. Strong understanding of ethical behavior is required.\nAbility to maintain regular and punctual attendance.\nPerforms related work as required\nReports to work as directed during an emergency as an essential employee of the City of Miami Beach\nFor all technical, professional, supervisory and managerial positions:\nAbility to develop innovative and creative solutions to issues consistent with the City’s strategic plan.\n\nApplicants must detail any related work experience on the application or risk disqualification. It is the applicant's responsibility to update their NEOGOV profile with work experience, education, certifications and personal contact information when submitting each application, failure to do so will result in ineligibility. City of Miami Beach employees must reflect their current position and detail their work experience on the application to avoid being disqualified.\n\nVeterans Preference: Veterans Preference is awarded in accordance with Florida State Statute 295.07. If veteran's preference is being claimed, it must be indicated on the application form and proper documentation, including all forms DD-214 (either Member 2 or Member 4), as well as the final Department of Defense Disability Letter (dated within one year) must be submitted with the application", "url": "https://www.indeed.com/viewjob?jk=6a7dd128fd022598&from=serp&vjs=3"},
{"job_title": "newBox Truck Delivery Driver", "summary": "$2,199 Weekly - Delivery Driver – No Experience Necessary!*.\nPreferred Vehicle: 12 foot to 16 foot box truck (no liftgate needed)*.", "company": "Need It Now Delivers - Automotive", "location": "Neenah, WI", "job_description": "$2,199 Weekly - Delivery Driver – No Experience Necessary!State: WisconsinCity: NeenahPreferred Vehicle: 12 foot to 16 foot box truck (no liftgate needed)Delivery Description: Auto PartsAre you an Experienced Driver with a valid driver’s license? Need It Now Delivers and Xpedited Delivery are looking for you!Smart Phone RequiredDirect DepositMonday - Friday 8am - 5pmStart & End at warehouse in NeenahAverage 15-20 stops dailyRound trip miles 240Full time/Part Time Route Opportunities available1099 Contractor positionMust have valid driver's license, registration, and vehicle insuranceMust be 21 or older with no DUI’s in the last 3 yearsRetirees/ Veterans/ Rideshare Drivers Welcome to Apply!When you Need it Now, Xpedite it! https://www.nindelivers.com/Job Types: Full-time, ContractPay: $2,199.00 per weekSchedule:Monday to FridayWork Location: On the road", "url": "https://www.indeed.com/viewjob?cmp=Need-It-Now-Delivers---Automotive&t=Box+Truck+Delivery+Driver&jk=52cfb2bbd9f151ea&vjs=3"},
{"job_title": "Operator, Security Ops Ctr", "summary": "The SOC Operator will monitor cameras and alarms, dispatch associated calls via telephone and radio, operate access control technology, and provide general…", "company": "Park Nicollet", "location": "Saint Louis Park, MN", "job_description": "Operator, Security Ops Ctr\nJob ID #: 59886 Location: Park Nicollet Methodist Hospital, St. Louis Park\n\nPosition Category: Safety / Security Department: Safety & Security 8300\n\nEmployment Type: Full Time Education Required: High School Diploma or equivalent (GED)\n\nExperience Required: 2+ years Union Representation: Non-Union (NONE)\n\nWork Schedule 21-07 (4-10's per week/EOW) Job Code: P9BX\n\nHours/ Pay Period: 80 Date Posted: Jan 26, 2022\n\n\n\nPosition Summary\n\n\nThe primary role and responsibility of this position is to protect people, property, information, and the reputation of HealthPartners and Park Nicollet organizations.\n\nThe Security Operations Center (SOC) Operator will use best practices to identify, analyze, and support all incidents that are either impactful or potentially impactful to business continuity, the brand and/or colleagues. This colleague must be a strong multi-tasker, problem solver, possess critical thinking skills and be detail oriented.\n\nThis position will effectively prioritize response to a wide variety of routine, public service and emergency support calls requiring various problem-solving techniques, judgment, and verbal de-escalation. The SOC Operator will monitor cameras and alarms, dispatch associated calls via telephone and radio, operate access control technology, and provide general assistance to colleagues, patients, visitors, and members. The SOC operator supports all HealthPartners properties and work locations in preparedness, response, and recovery from both routine and emergency incidents. This position is responsible for communicating information surrounding incidents to leadership as appropriate.\n\nEducation/Experience:\n\n1. FBI/BCA background check required upon hire. Approval for continued employment is dependent on this background result.\n2. One or more of the following educational or experience requirements:\n2 or 4-year degree in Law Enforcement/Criminal Justice or currently in a degree program.Previous experience in healthcare security.Previous law enforcement or public safety experience.Previous customer service.Military experience as applicable.Interpersonal skills required.Strong time management and organizational skills required.\nSpecial Knowledge/Skills/Certifications/Licenses:\n\n1. Can maintain physical and emotional control when in conflict or crisis situations.\n2. Can maintain clear and concise communications and have excellent customer service skills.\n3. Must be able to speak and write clearly and effectively in both interpersonal and digital environments.\n4. Can display a professional demeanor and confidence in response to stressful and emergency situations.\n5. Must demonstrate proficiency and accuracy in use of proprietary applications including video monitoring and dispatching software.\n6. Experience with troubleshooting various security software platforms utilized by the organization.\n7. Must be detail-oriented, organized with the ability to multi-task in a fast-paced, deadline-oriented environment.\n8. Ability to analyze problems, identify causes, and implement results-oriented solutions.\n9. Excellent organizational and time management skills as well as skilled multi-tasking.\n10. Demonstrates knowledge of age-related growth and development principles necessary to provide appropriate service and assure safety of patients.\n11. Ability to work independently while also being effective as a member of a team.\n12. Ability to work a flexible schedule inclusive of days, nights, weekends, and holidays.\n13. Required Coursework to be completed upon hire\na. Successful completion of the New Dispatcher 25-day Training Program, including:\ni. Departmental Verbal De-escalation Training\nb. Required successful completion within 12 months of hire:\ni. APCO Public Safety Telecommunicator Certification\nii. FEMA ICS 100, 200, 700, 906 & 907\nAdditional Information\n\n\nThe primary role and responsibility of this position is to protect people, property, information, and the reputation of HealthPartners and Park Nicollet organizations.\nThis position has expanded in 2021 to be responsible for calls from over 200 HealthPartners facilities including clinics, administrative sites, hospitals (Regions and Methodist), and other ambulatory and retail service locations.\nThis position manages incoming communications from all HealthPartners/Park Nicollet facilities and staff via multiple communications vehicles including phone, e-mail, radio, and software applications.\nFamiliarity with all 200+ facilities, contacts, resources, and response protocols are necessary.\nThis position communicates incoming information across HP Security teams.\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class.\nThe Organization\nAt Park Nicollet you're part of something bigger. We're a member of the HealthPartners organization, an award-winning integrated health care system comprised of several organizations. HealthPartners includes a team of 21,000 people dedicated to making a difference for our members, patients and the community. Whether you want to work in direct patient care, or support those who do, you will find a vast variety of job opportunities. Here, your contributions help to improve lives and impact health care for the better. If you want to make a difference, we want you on our team.\nPark Nicollet Mission, Vision and Values\nMission: Our mission is to improve health and well-being in partnership with our members, patients and community.\nVision: Health as it could be, affordability as it must be, through relationships built on trust.\nValues:\nExcellence We strive for the best results and always look for ways to improve.\nCompassion We care and show empathy and respect for each person.\nPartnership We are strongest when we work together and with those we serve.\nIntegrity We are open and honest, and we keep our commitments.\nWhat makes us unique?\nAt Park Nicollet, we never forget why we're here. Your health and well-being is our top priority and is at the forefront of everything we do. We believe outstanding health care is delivered when we merge the science and intellect of medicine with the compassion, spirit and humanity of our hearts. We refer to this as \"Head + Heart, Together,\" and it exists to inspire constant improvement and lasting success. We achieve this by partnering with patients and families in everything from care decisions to service and facility design. As we work together as a unified team, we engage patients, families and the community, and put them at the center of everything we do.", "url": "https://www.indeed.com/viewjob?jk=4d9eb538052dfcfa&from=serp&vjs=3"}