[
{"job_title": "newCORRECTIONAL OFFICER", "summary": "Pursuant to the Public Health Orders (https://bit.ly/3r4Sis6 and https://bit.ly/3H82cid) issued by the California Department of Public Health and the directive…", "company": "California Public Utilities Commission", "location": "San Bernardino County, CA", "job_description": "Job Description and Duties\nPursuant to the Public Health Orders (https://bit.ly/3r4Sis6 and https://bit.ly/3H82cid) issued by the California Department of Public Health and the directive https://bit.ly/3KPVzn1 issued by the Department of Corrections & Rehabilitation (CDCR), all staff who work in correctional settings who are unvaccinated, partially vaccinated, or have not provided a record of full vaccination shall undergo twice-weekly COVID testing with at least 72 hours between each test.\nMasks must be worn in accordance with local requirements, the California Department of Public Health (CDPH) requirements, and directive (https://bit.ly/3IIJrCx) issued by CDCR.\nThis position is located at CC#35 Oak Glen in Yucaipa, CA.\nSierra Conservation Center is canvassing for staff interested in transferring to the Conservation Camp Program. Due to the often remote locations and operations of the Conservation Camps, the following knowledge, skills and abilities are desirable: independent problem solving, sound decision making; heightened ability to work closely with others in a small unit; the ability to interact effectively with other state agencies and the public; display maturity and professionalism and ability to perform successfully with little or no supervision; custodial experience; computer familiarity; and fire-fighting, life saving knowledge. Other desirable factors include previous experience in camp, emergency fire fighting, community crew experience, volunteer fire fighting varied correctional assignments including transportation, R&R, and knowledge/experience in fire science, forestry, or related fields. The position requires travel and extended periods away from home while on fire assignments.\nUnder the supervision of the Assistant Camp Commander, the Correctional Officer is responsible for the custody, supervision, security, health and welfare of the inmate population and care of equipment, as well as the security coverage of the camp facility and boundaries. The Correctional Officer shall conduct duties in a professional manner at all times consistent with California Code of Regulation 3391, Employee Conduct, and keep immediate supervisor informed of any unusual or emergency situations as they occur.\nYou will find additional information about the job in the Duty Statement.\nWorking Conditions\nOvertime and travel is required.\nMinimum Requirements\nYou will find the Minimum Requirements in the Class Specification.\nCORRECTIONAL OFFICER\n\nPosition Details\nJob Code #: JC-290510\nPosition #(s):\n099-635-9662-001\nWorking Title: Correctional Officer at CC#35 Oak Glen\nClassification: CORRECTIONAL OFFICER\n$6,535.00 - $8,216.00 K\n# of Positions: 1\nWork Location: San Bernardino County\nJob Type: Permanent, Full Time\nDepartment Information\nVision\nWe enhance public safety and promote successful community reintegration through education, treatment and active participation in rehabilitative and restorative justice programs.\nMission\nTo facilitate the successful reintegration of the individuals in our care back to their communities equipped with the tools to be drug-free, healthy, and employable members of society by providing education, treatment, rehabilitative, and restorative justice programs, all in a safe and humane environment.\n\nThe California Department of Corrections and Rehabilitation and the California Correctional Health Care Services are committed to building an inclusive and culturally diverse workplace. We are determined to attract and hire more candidates from diverse communities and empower all employees from a variety of cultural backgrounds, perspectives, and personal experiences. We are proud to foster inclusion and drive collaborative efforts to increase representation at all levels of the Department.\n\nFounded in 1885, the California Department of Corrections and Rehabilitation (CDCR) is one of the nation’s largest and most diverse correctional departments in the country. We are dedicated to enhancing public safety through the safe and secure incarceration of offenders, by providing effective parole supervision, and implementing rehabilitative strategies to successfully reintegrate offenders into our communities.\nThe primary mission of Sierra Conservation Center is to provide housing, programs and services for minimum and medium custody inmates, to aid in their rehabilitation. SCC is one of the two prisons in the State responsible for the training and placement of male inmates in the Conservation Camp Program. SCC administers 16 male camps located from Central California to the southern border.\nDepartment Website: http://cdcr.ca.gov\nSpecial Requirements\nCandidates must be a current permanent, full-time California Correctional Officer and have completed the Correctional Officer Apprenticeship Program to interview. Those who are not may be eliminated from the hiring process.\n\nDo NOT include ANY confidential information on any documents you submit for a job vacancy, such as your State application, resume, or educational transcripts. Confidential information that should be excluded or removed from these documents includes, but is not limited to, your Social Security Number (SSN), birthdate, student identification number, driver’s license number (unless required), basis of eligibility, examination results, LEAP status, marital status, and age. Confidential information on the first page of applications submitted electronically online, such as Easy ID number, SSN, examination related information, and driver’s license number will automatically be redacted upon submission.\nPossession of Minimum Qualifications will be verified prior to interview and/or appointment. If you are meeting Minimum Qualifications with education, you must include your unofficial transcripts/diploma for verification. Official transcripts may be required upon appointment. If it is determined an applicant does not meet the Minimum Qualifications, the candidate will be withheld from the eligibility list, rendering them inactive and ineligible to be hired for the position. Candidates who have been withheld may file an appeal with the State Personnel Board.\nCandidates new to CDCR or the Division of Juvenile Justice are required to submit to a background investigation process utilizing Live Scan Fingerprinting, and Tuberculosis testing prior to appointment followed by department annual Tuberculosis testing/evaluation thereafter.\nApplication Instructions\nCompleted applications and all required documents must be received or postmarked by the Final Filing Date in order to be considered. Dates printed on Mobile Bar Codes, such as the Quick Response (QR) Codes available at the USPS, are not considered Postmark dates for the purpose of determining timely filing of an application.\nFinal Filing Date: 2/18/2022\nWho May Apply\nIndividuals who are currently in the classification, eligible for lateral transfer, eligible for reinstatement, have list eligibility, are in the process of obtaining list eligibility, or have SROA and/or Surplus eligibility (please attach your letter, if available). SROA and Surplus candidates are given priority; therefore, individuals with other eligibility may be considered in the event no SROA or Surplus candidates apply.\n\n\nApplications will be screened and only the most qualified applicants will be selected to move forward in the selection process. Applicants must meet the Minimum Qualifications stated in the Classification Specification(s).\nHow To Apply\nComplete Application Packages (including your Examination/Employment Application (STD 678) and applicable or required documents) must be submitted to apply for this Job Posting. Application Packages may be submitted electronically through your CalCareer Account at www.CalCareers.ca.gov. When submitting your application in hard copy, a completed copy of the Application Package listing must be included. If you choose to not apply electronically, a hard copy application package may be submitted through an alternative method listed below:\nAddress for Mailing Application Packages\nYou may submit your application and any applicable or required documents to:\nSierra Conservation Center\nAttn: Personnel\n5100 O'Byrnes Ferry Rd\nJamestown, CA 95327\nAddress for Drop-Off Application Packages\nYou may drop off your application and any applicable or required documents at:\nSierra Conservation Center\nPersonnel\n5100 O'Byrnes Ferry Road\nJamestown, CA 95327\nOffice closed weekends and holidays.\n07:00 AM - 04:00 PM\nRequired Application Package Documents\nThe following items are required to be submitted with your application. Applicants who do not submit the required items timely may not be considered for this job:\nCurrent version of the State Examination/Employment Application STD Form 678 (when not applying electronically), or the Electronic State Employment Application through your Applicant Account at www.CalCareers.ca.gov. All Experience and Education relating to the Minimum Qualifications listed on the Classification Specification should be included to demonstrate how you meet the Minimum Qualifications for the position.\nResume is required and must be included.\nApplicants requiring reasonable accommodations for the hiring interview process must request the necessary accommodations if scheduled for a hiring interview. The request should be made at the time of contact to schedule the interview. Questions regarding reasonable accommodations may be directed to the EEO contact listed on this job posting.\nDesirable Qualifications\nIn addition to evaluating each candidate's relative ability, as demonstrated by quality and breadth of experience, the following factors will provide the basis for competitively evaluating each candidate:\nCamp Experience\nCDCR Experience\nCamp Tour Experience\nKnowledge of SOMS/ERMS/Telestaff/RVR\nExperience in Varied Correctional Assignments\nKnowledge of/Experience in Fire Science, Forestry, or Related Fields\nWillingness to create and promote an equitable and inclusive workplace where diversity is celebrated and valued.\nBenefits\nInformation on benefits afforded by membership in the California Public Employees’ Retirement System can be found on the California Department of Human Resources (CalHR) Salary and Benefits website at www.calhr.ca.gov/employees/pages/salary-and-benefits.aspx.\n\nInformation regarding Merit System Principles provided to public employees by the State Civil Service Act can be found on the CalHR website at https://www.calhr.ca.gov/Training/Pages/performance-management-merit-system-principles.aspx.\n\nAdditional benefit information can be found on the CalHR California State Civil Service Employee Benefits Summary website at https://www.calhr.ca.gov/Pages/California-State-Civil-Service-Employee-Benefits-Summary.aspx.\n\nThis webpage is intended to provide general information. Benefit eligibility may be based on job classification, bargaining unit, time base and length of appointment.\nContact Information\nThe Human Resources Contact is available to answer questions regarding the position or application process.\nDepartment Website: http://cdcr.ca.gov\nHuman Resources Contact:\n\nJosh Fitzwater\n(209) 984-5291 ext: 5137\njosh.fitzwater@cdcr.ca.gov\nPlease direct requests for Reasonable Accommodations to the interview scheduler at the time the interview is being scheduled. You may direct any additional questions regarding Reasonable Accommodations or Equal Employment Opportunity for this position(s) to the Department's EEO Office.\nEEO Contact:\nEEO Coordinator\n(209) 984-5291 ext: 6208\nCalifornia Relay Service: 1-800-735-2929 (TTY), 1-800-735-2922 (Voice) TTY is a Telecommunications Device for the Deaf, and is reachable only from phones equipped with a TTY Device.\nMay Be Used\nThis advertisement may be used to fill additional vacancies for this classificiation.\nEqual Opportunity Employer\nThe State of California is an equal opportunity employer to all, regardless of age, ancestry, color, disability (mental and physical), exercising the right to family care and medical leave, gender, gender expression, gender identity, genetic information, marital status, medical condition, military or veteran status, national origin, political affiliation, race, religious creed, sex (includes pregnancy, childbirth, breastfeeding and related medical conditions), and sexual orientation.\nIt is an objective of the State of California to achieve a drug-free work place. Any applicant for state employment will be expected to behave in accordance with this objective because the use of illegal drugs is inconsistent with the law of the State, the rules governing Civil Service, and the special trust placed in public servants.", "url": "https://www.indeed.com/viewjob?jk=658c9c0ab8273d49&from=serp&vjs=3"},
{"job_title": "newCommunity Service Officer", "summary": "Relief person for court officer.\nThe Sunprairie Police Department is looking to hire motivated, hard-working people who are interested in serving their…", "company": "City of Sun Prairie", "location": "Sun Prairie, WI", "job_description": "The Sunprairie Police Department is looking to hire motivated, hard-working people who are interested in serving their community. This is a non-sworn position that will be responsible for promptly and effectively carrying out routine Police Department service duties, which do not require the performance of a sworn Police Officer, and other limited code enforcement duties.One of our full-time Community Service Officers (CSO) has moved into a sworn Police Officer role, we have a vacancy Mon - Fri from 6am - 2pm. In addition, we have created two part-time CSO positions to cover Mon-Sat from 4:30pm - 10:30pmEssential Job FunctionsEnforces the City's parking restrictions both on public and private property through the issuance of parking tickets, identifying abandoned vehicles and, when required, having illegally parked vehicles towed.Investigates animal complaints, including animal bites, and enforces ordinances including the impoundment of unsecured animals and authorizing the release of animals when claimed by the respective owners.Recovers, secures, processes, and returns property and evidence..Provides assistance to the Emergency Medical Service and Fire Department, which may include assisting as a first responder to calls.Directs traffic.Work collaboratively with the building inspection department to conduct initial and follow up visits regarding code violations for grass and sidewalks.Investigates and completes forms for various minor complaints.Cleans department vehicles, coordinates vehicle maintenance with the Fleet department, maintains supplies, and delivers vehicles and equipment to the maintenance division for repairs and maintenance.Assists with special events and parades.Identifies and investigates complaints of property based code violations.Coordinate and execute the Med Drop Program.Assists with other miscellaneous tasks as assigned such as running mail between facilities and obtaining supplies from local businesses.Assists with municipal court as needed.Assists with fingerprinting citizens as scheduled.Relief person for court officer.Assists with the inventory and cleaning of building storage and evidence areas.Requirements of WorkGeneral knowledge of the locations and streets in the City of Sun Prairie.Ability to organize and complete a variety of work assignments and understand department procedures and regulations as well as controlling laws.Ability to communicate information accurately and effectively under adverse conditions and able to complete reports in a timely manner.Must be able to establish and maintain effective working relationships with other employees and the public. Must execute duties firmly, tactfully, courteously and impartially.Working skill in the use of a two-way radio and computer is preferred.Requires a high school diploma or equivalent degree.Requires a Wisconsin Driver's License.Receive annual training on self-defense techniques and use of issued equipment.WORK CONDITIONS AND PHYSICAL REQUIREMENTS: Must have the ability to safely lift 100 pounds from ground to waist level (the weight of one end of an average stretcher/individual combination).Must have ability to stand or walk for extended periods of time and to push/pull objects (speed trailer or road debris).Must have ability to work and maneuver on uneven terrain and in all weather conditions an d pass general strength and flexibility testing.Learn more about our Benefits by visiting our website: www.cityofsunprairie.com/benefitsHEALTH INSURANCEThe City offers a High Deductible Health Plan and will pay 100% for family and single coverage. Point of service for providers outside of the network is also offered at an additional cost. Provider is Dean Health Insurance. Coverage begins the 1st of the month following 1 full month of service. (i.e.; DOH=January 2nd, coverage begins March 1st)ACCESS TO OUR EMPLOYEE WELLNESS CLINIC - myspwellnessclinic.orgDENTAL INSURANCEDelta DentalThe City provides 100% premium payment for single or family coverage. Coverage begins the 1st of the month following 1 full month of service.LIFE INSURANCEState Life Fund- Minnesota MutualThe City provides 100% premium payment for basic coverage (1 times annual salary)The employee has the ability to purchase at their expense supplemental coverage, additional coverage (up to 3 units),and spouse/dependent coverage. Eligibility begins 1st of the month, following 30 days of employment (ie; DOH Feb 1st, April 1st coverage begins).Boston_ Mutual Whole Life Insurance_The employee has the ability to purchase at their expense and eligibility would be in September of each year.INCOME CONTINUATION INS - State FundThis benefit provides up to 75% of your average earnings if you become disabled. The City provides coverage up to $64,000 at the 180-day elimination period. Employees can buy down to a shorter elimination period at their expense. Supplemental coverage is also available for earnings over $64,000 up to $120,000 at the employee's expense. Eligibility begins the 1st of the following month, unless you were previously employed in WRS.VISION INSURANCEAvailable for the employee to purchase at their own expense. RETIREMENTWisconsin Retirement System which requires a matching 6.5% employee contribution.Deferred Comp, Traditional or Roth IRAThe employee can participate in a 457 Deferred Comp Plan, IRA Traditional or Roth IRA, if they choose.SICK LEAVEAccumulation of one day per month. At retirement ability to convert sick balance up to 120 days into a Health Reimbursement Account (HRA).PAID PARENTAL LEAVEEffective September 4, 2018, all City of Sun Prairie employees who meet the eligibility criteria and have a qualifying event, shall receive 240 hours (prorated for less that 1.0 FTE) of Paid Parental Leave once per year.VACATIONVacation is earned on your anniversaryStart - 10 days vacationCompletion of 1 year - 10 days vacationCompletion of 2 years - 12 days vacationCompletion of 3 years - 13 days vacationCompletion of 4 years - 15 days vacationCompletion of 6 years - 16 days vacationCompletion of 7 years - 17 days vacationCompletion of 8 years - 18 days vacationCompletion of 9 years - 19 days vacationCompletion of 10 years - 20 days vacationCompletion of 11 years - 21 days vacationCompletion of 12 years - 22 days vacationCompletion of 13 years - 23 days vacationCompletion of 14 years - 24 days vacationCompletion of 15 years - 25 days vacationCompletion of 17 years - 26 days vacationCompletion of 19 years - 27 days vacationCompletion of 21 years - 28 days vacationCompletion of 23 years - 29 days vacationCompletion of 25 years - 30 days vacationHOLIDAYSThe following Holidays are observed:Dr. Martin Luther King Jr. BirthdayMemorial Day,Fourth of July Labor Day,Thanksgiving Day the day after Thanksgiving Day,Christmas Eve Day Christmas Day,New Years Eve Day New Years Day.Two Personal Days are given at the beginning of each year (prorated if hired after July 1 and not available if hired after October 1).Location: 2598 W Main Street,Sun Prairie,WI, Sun Prairie, WIJob Type: Full-time", "url": "https://www.indeed.com/viewjob?cmp=City-of-SunPrairie&t=Community+Service+Officer&jk=4f78cb1bf0f56ca2&vjs=3"},
{"job_title": "newAdministrative Assistant (OA)", "summary": "Your benefits depend on the type of position you have - whether you're a permanent, part-time, temporary or an intermittent employee.", "company": "US Armed Forces Retirement Home", "location": "Washington, DC", "job_description": "Duties\nAs an Administrative Assistant (OA), you will:\n\nAct as a liaison between the Service Chief, the Director and other Service Chiefs and all other internal and external customers. Tactfully determines the name and affiliation of callers and nature of calls. Personally handles many matters, answering questions of an administrative/general nature, or refers the caller to the appropriate office.\nMaintain the calendar of the Service Chief, and resolves any scheduling conflicts. Arranges meetings, to include time, space, attendance and any equipment needs.\nPrepare and distribute meeting agenda. Attend meetings and records minutes, and prepare minutes for distribution.\nPrepare a variety of documents using word processing, spreadsheets and databases.\nResponsible for ensuring travel arrangements are accurately prepared in a timely manner, to include most cost effective mode of transportation, making reservations, planning itineraries, coordinating with point of contact at TDY site, and preparing travel voucher upon completion of travel.\n\nRequirements\nConditions of Employment\nThe experience may have been gained in either the public, private sector or volunteer service. One year of experience refers to full-time work; part-time work is considered on a prorated basis. To ensure full credit for your work experience, please indicate dates of employment by month/day/year, and indicate number of hours worked per week on your resume.\n\nKey Requirements:\nPlease refer to \"Conditions of Employment.\"\nMust be U.S. Citizen or U.S. National\n\nQualifications\nYou must meet the following requirements by the closing date of this announcement.\n\nTo be qualified for this position at the GS-09 level, you must have at least one year of specialized experience at a level of difficulty and responsibility equivalent to the GS-08 grade level in the Federal service performing administrative support functions.\nSpecialized experience for this position includes:\nEnsuring administrative support work is performed in compliance with relevant regulations, guidelines, and policies; OR\nCreating, proofing, and editing documents; OR\nMonitoring and, adjusting budget accounts; OR\nProcuring items for the office and/or department; OR\nEnsuring the accuracy and completeness of time and leave documents; OR\nAnswering general information questions from customers and/or visitors.\n\n\nAND\n\n\nCertified typist - ability to type at least 40 words per minute\nAdditional information\nTo ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement Safer Federal Workforce Task Force 2 pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a Federal job announcement includes the requirement that applicants must be fully vaccinated against COVID-19 pursuant to Executive Order 14043, that requirement does not currently apply. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and quarantine\n\n***THIS IS SUBJECT TO CHANGE, DEPENDENT ON THE APPEAL DECISION***\n\nWe may select from this announcement or any other source to fill one or more vacancies.This is a non-bargaining unit position.\nCONDITIONS OF EMPLOYMENT:\nA one year probationary period may be required.Must successfully complete a background investigation.Complete a Declaration for Federal Employment to determine your suitability for Federal employment, at the time requested by the agencyIf you are a male applicant born after December 31, 1959, certify that you have registered with the Selective Service System or are exempt from having to do so.Have your salary sent to a financial institution of your choice by Direct Deposit/Electronic Funds Transfer.Go through a Personal Identity Verification (PIV) process that requires two forms of identification from the Form I-9. Federal law requires verification of the identity and employment eligibility of all new hires in the U.S.Submit to a drug test prior to your appointment and random drug testing while you occupy the position.Selectees will be subject to the AFRH Tuberculosis Surveillance Program.Wear required safety clothing and/or equipment required by the position. This may include safety shoes, hard hats, hearing protection, gloves, masks, etc.Because the AFRH's mission requires uninterrupted, direct human support and medical care for its Residents, this position is considered essential for continuing AFRH operations. Therefore, the incumbent is expected to arrive for duty on time, as scheduled, and to complete the assigned tour during emergency situations such as hazardous weather.\n\nBenefits\n\nA career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\nHow You Will Be Evaluated\nYou will be evaluated for this job based on how well you meet the qualifications above.\nYour application includes your résumé, responses to the online questions, and required supporting documents. Please be sure that your résumé includes detailed information to support your qualifications for this position; failure to provide sufficient evidence in your résumé may result in a \"not qualified\" determination.\n\nRating: Your application will be evaluated in the following areas:\nTechnical\nAnalytical\nCommunication\n\n\nCategory rating will be used to rank and select eligible candidates. If qualified, you will be assigned to one of three quality level categories: Outstanding, Excellent or Qualified, depending on your responses to the online questions, regarding your experience, education, and training related to this position. Your rating may be lowered if your responses to the online questions are not supported by the education and/or experience described in your application.\n\nVeterans' preference is applied after applicants are assessed. Preference-eligibles will be listed at the top of their assigned category and considered before non-preference-eligibles in that category. Qualified preference-eligibles with a compensable service-connected disability of 10% or more will be listed at the top of the highest category.\n\nReferral: If you are among the top qualified candidates, your application may be referred to a selecting official for consideration. You may be required to participate in a selection interview.\n\nIf you are a displaced or surplus Federal employee (eligible for the Career Transition Assistance Plan (CTAP)/Interagency Career Transition Assistance Plan (ICTAP)) you must receive a score in the middle category or better to be rated as \"well qualified\" to receive special selection priority.\nBenefits\n\nA career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\nRequired Documents\nAs a new or existing federal employee, you and your family may have access to a range of benefits. Your benefits depend on the type of position you have - whether you're a permanent, part-time, temporary or an intermittent employee. You may be eligible for the following benefits, however, check with your agency to make sure you're eligible under their policies.\nA complete application includes 1. A résumé, 2. Vacancy question responses, and 3. Submission of any required documents. Please note that if you do not provide all required information, as specified in this announcement, you may not be considered for this position (or may not receive the special consideration for which you may be eligible).\n\nPlease ensure all required documents, including any required work samples, narratives, or other materials as stated in this announcement, are attached to your application package\n\nAll applicants are required to submit a résumé either by creating one in USAJOBS or uploading one of their own choosing. (Cover letters are optional.) To receive full credit for relevant experience, please list the month/date/year and number of hours worked for experience listed on your résumé. We suggest that you preview the online questions, as you may need to customize your résumé to ensure that it supports your responses to these questions. Please view résumé tips.\n\nVETERANS' PREFERENCE DOCUMENTATION: If you are claiming veterans preference, please see applicant guide for required documentation. In order to be considered for veterans preference, you must submit all required documentation as outlined in the applicant guide.\n\nCAREER TRANSITION ASSISTANCE PLAN (CTAP) OR INTERAGENCY CAREER TRANSITION ASSISTANCE PLAN (ICTAP) DOCUMENTATION: If you are a displaced or surplus Federal employee, click CTAP/ICTAP for eligibility and a detailed list of required documents you must submit in order to be eligible.\nIf you are relying on your education to meet qualification requirements:\nEducation must be accredited by an accrediting institution recognized by the U.S. Department of Education in order for it to be credited towards qualifications. Therefore, provide only the attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education.\nFailure to provide all of the required information as stated in this vacancy announcement may result in an ineligible rating or may affect the overall rating.\nHow to Apply\nAFRH has partnered with the Treasury's Bureau of the Fiscal Service to provide certain personnel services to its organization. Fiscal Service's responsibilities include advertising vacancies, accepting and handling applications, and extending job offers.\n\nPlease review the entire announcement before applying.\n\nThe following instructions outline our application process. You must complete this application process and submit any required documents by 11:59 p.m. Eastern Time (ET) on the closing date of this announcement. We are available to assist you during business hours (normally 8:00 a.m. - 5:00 p.m. ET, Monday - Friday). If applying online poses a hardship, please contact us by noon ET on the announcement's closing date.\n\nThe Bureau provides reasonable accommodation to applicants with disabilities on a case-by-case basis. Please contact us if you require this for any part of the application and hiring process.\n\nTo begin, click Apply to access the online application. You will need to be logged into your USAJOBS account to apply. If you do not have a USAJOBS account, you will need to create one before beginning the application.\nFollow the prompts to select your resume and/or other supporting documents to be included with your application package. You will have the opportunity to upload additional documents to include in your application before it is submitted. Your uploaded documents may take several hours to clear the virus scan process.\nAfter acknowledging you have reviewed your application package, complete the Include Personal Information section as you deem appropriate and click to continue with the application process.\nYou will be taken to the online application which you must complete in order to apply for the position. Complete the online application, verify the required documentation is included with your application package, and submit the application.\nTo verify the status of your application:\nLog into your USAJOBS account (USAJOBS Login), all of your applications will appear on the Welcome screenUnder \"application status,\" click \"Track this application\" and you will be taken to the agency website where you can check your application status. For more information regarding the job and applicant status, please refer to https://www.usajobs.gov/Help/how-to/application/status/\n\nIf you wish to make changes/updates to your application and the vacancy is still open, you can click on the job announcement and \"Update Application\" to be taken back to your application. No updates can be made once the announcement has closed.\n\nPlease notify us if your contact information changes after the closing date of the announcement. Also, note that if you provide an email address that is inaccurate or if your mailbox is full or blocked (e.g., spam-blocker), you may not receive important communication that could affect your consideration for this position.\n\nFor additional information on how to apply, please visit the Partnership for Public Service's Go Government website.\n\nTo preview the assessment questionnaire: https://apply.usastaffing.gov/ViewQuestionnaire/11380366\nAgency contact information\nApplicant Call Center\nPhone\n304-480-7300\nEmail\nAFRHINQUIRIES@fiscal.treasury.gov\nAddress\nHEALTHCARE SERVICES\nAdministrative Resource Center\nParkersburg, WV 26101\nUS\n\nNext steps\nOnce the online questionnaire is received, you will receive an acknowledgement email that your submission was successful. We will review your resume and transcript(s) (if appropriate) to ensure you meet the basic qualification requirements. We will evaluate each applicant who meets the basic qualifications on the information provided and may interview the best-qualified applicants. After making a tentative job offer, we will conduct any required suitability and/or security background investigation.\nFair and Transparent\nThe Federal hiring process is setup to be fair and transparent. Please read the following guidance.\nEqual Employment Opportunity (EEO) Policy\nReasonable accommodation policy\nFinancial suitability\nSelective Service\nNew employee probationary period\nSignature and false statements\nPrivacy Act\nSocial security number request\n\nRequired Documents\nA complete application includes 1. A résumé, 2. Vacancy question responses, and 3. Submission of any required documents. Please note that if you do not provide all required information, as specified in this announcement, you may not be considered for this position (or may not receive the special consideration for which you may be eligible).\n\nPlease ensure all required documents, including any required work samples, narratives, or other materials as stated in this announcement, are attached to your application package\n\nAll applicants are required to submit a résumé either by creating one in USAJOBS or uploading one of their own choosing. (Cover letters are optional.) To receive full credit for relevant experience, please list the month/date/year and number of hours worked for experience listed on your résumé. We suggest that you preview the online questions, as you may need to customize your résumé to ensure that it supports your responses to these questions. Please view résumé tips.\n\nVETERANS' PREFERENCE DOCUMENTATION: If you are claiming veterans preference, please see applicant guide for required documentation. In order to be considered for veterans preference, you must submit all required documentation as outlined in the applicant guide.\n\nCAREER TRANSITION ASSISTANCE PLAN (CTAP) OR INTERAGENCY CAREER TRANSITION ASSISTANCE PLAN (ICTAP) DOCUMENTATION: If you are a displaced or surplus Federal employee, click CTAP/ICTAP for eligibility and a detailed list of required documents you must submit in order to be eligible.\nIf you are relying on your education to meet qualification requirements:\nEducation must be accredited by an accrediting institution recognized by the U.S. Department of Education in order for it to be credited towards qualifications. Therefore, provide only the attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education.\nFailure to provide all of the required information as stated in this vacancy announcement may result in an ineligible rating or may affect the overall rating.\nHelp\nThis job is open to\nThe public\nU.S. Citizens, Nationals or those who owe allegiance to the U.S.\nClarification from the agency\nU.S Citizens or U.S. Nationals; No prior federal experience is required.", "url": "https://www.indeed.com/viewjob?jk=45ae4ebf3a8b1472&from=serp&vjs=3"},
{"job_title": "newWaiter / Waitress", "summary": "The Ninety Nine Restaurant & Pub is headquartered in Woburn, MA and is proud to serve more than 20 million guests a year in over 100 restaurants throughout the…", "company": "Ninety Nine Restaurant & Pub Team Members", "location": "Pembroke, MA 02359+126 locations", "job_description": "The Ninety Nine Restaurant & Pub is headquartered in Woburn, MA and is proud to serve more than 20 million guests a year in over 100 restaurants throughout the Northeast. We treat people right, and that's why our team makes new guests feel welcome, and regulars feel right at home.\n\nNow Hiring / Immediate Opportunities Available for Full Time & Part Time:\n\nServers / Waiters / Waitresses\n\nAt Ninety Nine Restaurant & Pub we're always looking for great team members to join in the fun and “Love Where You Work”\n\nTips - Take home your tip pay each day.\nGrowth Opportunities - Approximately 50 percent of Ninety Nine's entire management staff started out as hourly team members.\nStability - We have some of the lowest manager & hourly turnover in the industry, that means the team you'll be a part of doesn't change nearly as often as other restaurants\nBetter quality of life - no late night bar hours!\nHealthcare Coverage - Restaurant hourly team members may become eligible for health and welfare plans the first of the month following an ACA measurement period in which average hours worked per week is 30 or greater.\nDiscounts - 25% discount on food and non-alcoholic beverages for team members to enjoy with their family and friends outside of their work shift\nPaid Time Off - Earn vacation based upon company policy\nRetirement Savings Plan - After 1 year of employment you are eligible to participate in the company’s 401(k) plan upon reaching 21 years of age.\n\nWE ARE COMMITTED TO OUR GUESTS, TEAM MEMBERS & COMMUNITY\n\nSubmit your application today, we can't wait to meet you.\n\nNinety Nine Restaurants is an Equal Opportunity & E-Verify Employer\n\nJoin the Ninety Nine (The 99 Restaurants) team today. This restaurant front of house job for Food Server / Waiter will focus on guest service / waiting tables in which you will be expected to provide great customer service. Mesero / Mesera roles also must interact with co-workers in a friendly and thoughtful manner in addition to other Waiters / Waitresses.\n\nAdvertised per hour average pay is an estimate based on recent data, but not a guarantee. All tipped team members are paid the tipped minimum wage, plus tips.\n\n#SourcingPro #3uv #date020222 #ninetyninerestaurantpubteammembers30096waiterwaitress", "url": "https://www.indeed.com/viewjob?jk=0169360d896a283a&q=Waiter&l=USA&from=web&advn=2261614087599194&adid=383645773&ad=-6NYlbfkN0DwuaQ2wRgXHhCx7qVJbwjb-IxsN2SCEY9G9Z8aVeV1BR0V40LFB5PGIF52RkoSwxqs09J_PLzB_kMbQ-VOsyO59KUezfXv_kNScpxH7OlLqCQTl4PoUphx7-E6komFe-2f1Destlc5W31_gmrhkkph7mi3NCdiBwQLfs0s28Ohd3AIf9El8F1wjymlCzH5m0z76pHnDvfd28UaKbKWv8I4npdLw3VEYGHiIcBOGjVEMSFDtdRqkBvZDcSKSVzPb_fxjAsbY7oCamg1Z6RfpZ9QdGCjJ_d7lER64TjRH4quGiH0oR0MTK-85EpSOSCelEmNysyfde08-7e6M0q6p8aSa2HDHz_S5jHNhEZV2TGipfe1qpTNkGgG&sjdu=J--2vUBaJR95RFdIjWAnJ075SJbqDzDhqlp2e7yFqF9rdnPIti-kqN8iUZVHZ-gF3nHp2y82aaGbExXFSvYRCTwYdWM-ag9ZGmjlmtfCt0SgFkKB52lwwpC7SmcKZizKr4bw9-ntuE2msUTVY8VYSU_JxO5yqGwqEdVYxoqcHrWhDTMkxwCs1DfPUk374F5he6wxVlxlnlYGDMPsESJxk2pKfIg7uiXQu_m4VhA6TCQ&acatk=1frf6l6d5t4vm800&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "Construction Workers, all levels of experience", "summary": "Primary Duties:: Workers complete various construction tasks to build manufactured homes using construction equipment and tools.", "company": "KIT HomeBuilders West", "location": "Caldwell, ID+1 location", "job_description": "KIT Custom HomeBuilders is actively hiring workers for various construction production tasks. Experience preferred but not required.\n\nThese are full-time positions at our Production Plant in Caldwell, Idaho, and will be scheduled to work Monday-Friday from 7:00 a.m. until 5:30 p.m., plus any required evening or Saturday overtime. Hourly wage starts from $20.00 per hour, depending on any prior experience. KIT is also now paying a $1,000 Signing Bonus to new employees after 90 days of employment.\n\nKIT offers a competitive benefit package including vacation pay, medical, dental, and vision insurance, as well as 401(K) and an employee home purchase discount program.\n\n\nPrimary Duties:: Workers complete various construction tasks to build manufactured homes using construction equipment and tools. Available openings vary and departments hiring may include framing, welding, plumbing, electrical, cabinetry/molding, sheet rock, drywall finishing, and roofing.\n\nRequirements::\nMust be able to lift & carry up to 50 pounds and be on your feet for a 10-hour shift. Work is fast-paced and requires use of either manual or air tools.\nRegular attendance is a critical part of all positions. Employees must be available to consistently work the required shift and overtime hours without tardiness, interruption, or early departure. Shift hours are Monday through Friday, 7:00 a.m. to 5:30 p.m., as well as any required Saturday or evening overtime.\n\nKIT Custom HomeBuilders is an AA/EEO/ADA Employer", "url": "https://www.indeed.com/viewjob?jk=ce396df129a41657&from=serp&vjs=3"},
{"job_title": "newCashier and Waiter/Waitress", "summary": "We are looking for a competent Restaurant Server to take and deliver orders.\nYou’ll be the face of our restaurant and responsible for our customers’ experiences…", "company": "Tip Thai", "location": "Starke, FL 32091", "job_description": "We are looking for a competent Restaurant Server to take and deliver orders. You’ll be the face of our restaurant and responsible for our customers’ experiences. Food server responsibilities include ensuring our tables are clean and tidy when guests arrive, presenting menus and serving food and beverages. You need to be quick on your feet (literally and metaphorically) and have a polite and friendly attitude. If you enjoy talking to people and thrive in a fast-paced workplace, we’d like to meet you. Your ultimate goal will be to provide high-quality service that will help us maintain and attract customers.ResponsibilitiesPrepare restaurant tables with special attention to sanitation and orderAttend to customers upon entrancePresent restaurant menus and help customers select food/beveragesTake and serve ordersAnswer questions or make recommendations for complementary products*Collaborate with other restaurant servers and kitchen/bar staffDeal with complaints or problems with a positive attitudeIssue bills and accept paymentSkillsProven restaurant serving or waitering experienceHands-on experience in cashier dutiesAttention to cleanliness and safetyPatience and customer-oriented approachExcellent people skills with a friendly attitudeResponsible and trustworthyHigh school diploma is a plus but not requiredJob Types: Full-time, Part-time, ContractPay: $12.00 - $20.00 per hourBenefits:Flexible schedulePhysical Setting:Casual dining restaurantSchedule:8 hour shiftDay shiftEvening shiftHolidaysMonday to FridayNight shiftWeekend availabilityExperience:Full Service Servers: 1 year (Preferred)Restaurant experience: 1 year (Preferred)Work Location: One location", "url": "https://www.indeed.com/viewjob?cmp=Tip-Thai&t=Cashier+Waiter+Waitress&jk=811904fbf7b97850&vjs=3"},
{"job_title": "Remote Telephone Service Representative $20/hr Must reside i...", "summary": "$20/hr. full-time, 40 hours a week (and with a premium pay program enabling you to earn up to $28/hr.).\nFull paid training is provided.", "company": "Centratel", "location": "Remote in Texas", "job_description": "Telephone Service Representative (TSR) Work-from-home positions(For more information, also see www.centratel.com/jobs)We are hiring in Texas!$20/hr. full-time, 40 hours a week (and with a premium pay program enabling you to earn up to $28/hr.) Full health insurance and IRA.We are looking for experienced call center/answering service agents (sometimes called Telephone Service Representatives or TSRs) who want to work from home for a great company and who will stay with us long-term.Who are we? We are, statistically, the highest quality telephone answering service in America. We’ve been in business for 37 years under a single owner and our headquarters are in Bend, Oregon.This is not a sales position, our TSRs process incoming calls only.Candidates for these positions must reside in Texas. We are hiring individuals who are customer-centric and detail-oriented; with solid typing skills and who are strong linguistically (verbal and written). An empathetic yet confident comportment is also an essential attribute.Our training is thorough and the “people” skills that you’ll learn will prove valuable for the rest of your lifetime.Age is no barrier. Full paid training is provided.Because of the nature of our 24/7/365 business, with heavy call traffic on weekends, expect to work both Saturdays and Sundays, along with three sequential days during the week.Job Description: You will be processing incoming calls for various businesses that are located throughout the United States. The TSR’s task is to take messages accurately and efficiently, and then deliver that information to our clients per their individual message-relay protocols. The Centratel TSR utilizes a specialized telephone system specifically designed for answering services.The clients we serve include service businesses (whose personnel are in the field and away from their business phones); medical and veterinary offices that receive emergency patient calls during and after normal business hours, property management companies, heating and air conditioning firms, funeral homes, hi-tech operations, etc.Job Requirements: · Experienced call-center/answering service agents only· Per our typing test, type a minimum of 40 WPM· Absolutely drug-free. An initial monitored professional drug screening and subsequent intensive random/unannounced tightly-monitored drug tests will be conducted· Understand basic internet navigation; messaging tools· Excellent oral and written communication skills· Adept at actively listening; can communicate efficiently· Empathetic and personable, yet professional demeanor· Reliable, dependable and customer-centric. Focused· Disciplined and resourceful, personable· Receptive to coaching feedback through regular one-on-one online meetings with supervisors and quality specialists· Able to train remotely via self-guided classroom programs· Can troubleshoot very basic internet connection challenges guided by our experienced and always-available tech team· Attend paid (virtual) monthly meetingsPhysical Requirements: · Must have a secured separate workspace free of distractions and extraneous noise, for HIPAA compliance requirements· Up-to-date computer with Windows 10 or higher operating system (Mac is not supported) with 20 GB of hard space available, dual monitors or an ultra-wide monitor, standard Keyboard, and webcam with microphone· Provide a reliable high-speed (minimum 100mbps) broadband internet connection. No satellite connections· Reliable landline or Voice-over-Internet Protocol (VoIP) service. Must have a mobile phone with unlimited minutes for a backup sourceWages and Benefits: Starting wage is $20.00 per hour with quick escalation, keyed to performance, to $22.00-$28.00 per hour. To meet the highest performance criteria typically takes 30-60 days. (Most of our trained TSRs earn at the $25.00-$28.00 per hour level)· Full time: 40 hours per week· Overtime available at 1 1/2 times hourly wage· Retirement plan with a 3% match, after 90 days· Fully paid health insurance, after 90 days. (Note: If you choose not to use our group health insurance, we will add $200 per month to your compensation)· Set schedules (per seniority-based bidding process)Job Type: Full-timePay: From $20.00 per hourBenefits:401(k) matchingHealth insurancePaid time offPaid trainingVision insuranceWork from homeSchedule:8 hour shiftEvening shiftHolidaysWeekend availabilitySupplemental Pay:Bonus payApplication Question(s):Please list all the basic required equipment and your current internet speed download speed required for this position.Please describe why you are the ideal candidate for this position?Do you live in Texas?Were your calls graded for quality assurance? If yes, what elements were they rated on?Education:High school or equivalent (Required)Experience:incoming high-volume call center: 2 years (Required)Shift availability:Day Shift (Required)Night Shift (Required)Overnight Shift (Required)Work Location: Multiple Locations", "url": "https://www.indeed.com/viewjob?jk=03fbcce69654aa56&q=Sale&l=USA&from=web&advn=3284652567323727&adid=381277683&ad=-6NYlbfkN0CimM6vkOwEJh4PJM0LjhcIfQ6C_tw1iMN4VJZRV6ozRpP2As-Gg_6xYcjJ_bx7R7jcKchPEUxUZWEcrLnGzD6FL2O6R0O1TN9My8Q3crF6Hyc8vTxpfBhiGxYD7aEPJlNdPW7gUAfimh7cD2ZmN282kF_34DV7PXy1GJq8amcAjnw82j8Uc1qTHnjKEMBN7y-7ghaWJjL8pPDHMGdTFVuPuweoElq98tI2MFgS26wgiEgW1Z6bDdIzh2CN2Dr18KjCr_MlQHBoB4bTcuarOX0nLY7Fer_n2a91meqke5x4989ouPewLkVSgG6iRzIyU2N3SqS1X0yyXUsqP2LV_jaUImyvDFdx8A0g5YMUpaYsa-KPoZjrr2_H&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "The Lawyer", "summary": "It’s an exciting time for us.\n$70,000 - $150,000 annual salary depending on relevant experience.\n100% employer-paid medical, dental and vision for employees.", "company": "Corporate Tools", "location": "Post Falls, ID 83854+1 location", "job_description": "Overview:\nCorporate Tools in Post Falls, Idaho is building a team of 5 +/- lawyers. As we grow, we’re looking to transition from kicking the can and reactionary legal decision making (otherwise known as firefighting), to using legal decisions to drive the company and steer our growth. This is a M-F 40 hour or less a week job. We don’t have employees take emails home with them. We don’t work after hours. We believe in using work to pay for a lifestyle outside of working.\n\nAs one of our “The Lawyers” you’ll be working with a curated group of fun and talented lawyers to build from the ground up how we use legal to drive our company. Your work here WILL MATTER. Day like 45 or so after you start to see how much work everyone has squirreled away in their file cabinets for you over the years or people start to realize we have a smart team of in house lawyers ready to dig in and start dusting off all the junk on the corner of their desks we let sit for one reason or another.\n\nIt’s an exciting time for us. It’s an exciting transition. We should have built this team a few years ago… but we didn’t. But we are building it now. How will it all work out?? Well. We’re not sure, but we’re going to hire 5ish lawyers over some time that are good humans and smart people and let them figure it out. If you’re looking for a job that matters, please read on:\n\n\nWage:\n$70,000 - $150,000 annual salary depending on relevant experience\nBenefits:\n100% employer-paid medical, dental and vision for employees\nAnnual cost of living increase\nAnnual review with raise option\n22 days Paid Time Off\nAfter 3 years, PTO increases to 29 days. Employees transition to flexible time off after 5 years with the company—not accrued, not capped, take time off when you want.\nPaid Maternity and Paternity Leave\n4% company matching 401(k) with no vesting period\nQuarterly \"Work Wherever\" allowance\nUse to make your remote work wherever set up more comfortable, for continuing education classes, a plant for your desk, coffee for your coworker, a massage for yourself... really, whatever.\nCreative environment where you can make a difference\nNo dumb benefits like free dog walking on the weekends that snobby hipster places have to make you feel cool, but mathematically won't cost the company much money because you won't use it.\nTrail Mix Bar - oh yeah.\nResponsibilities:\nQuarterback anything and everything legal. We do registered agent service, corporate filings, software as a service, and operate physical locations in every state. As the lawyer, you’d be the primary front line responder to anything legal in our operation. You’d be responsible for determining if you can deal with the problem or hire local or specialized counsel in the appropriate jurisdiction.\nYou’ll be responsible for how we operate legally. Are we doing the right things? Are we operating legally? Is the city mad at us for something? Is the state mad at us for something? Who’s mad at us???? Who’s going to be mad at us and how do we avoid it? Are we violating someone's IP rights? Is someone encroaching on our IP? We have a massive amount of Intellectual Property. Massive. It will be shocking to you… Tech, IP, and Data Privacy should be interesting to you.\nMaintain trademarks in all 50 states and federal trademarks\nMaintain servicemarks in all 50 states and federal registrations\nManage UDRP and Icann registrations, complaints, and responses\nMaintain terms of service, privacy policies, and data collection and retention policies\nHelp with HIPPA and PCI compliance regulations\nHelp with random employment problems\nHelp respond to subpoenas\nManage all service agreements and legal agreements we make with vendors\nManage all service agreements we provide clients\n3-4 acquisitions a year. Stock purchases, asset purchases, website purchases. Some very large and complex\nProvide support to all employees for any type of legal questions and all managers to help make daily decisions better\nExplore and help craft new business ventures in the quasi legal services industry we work in such as offering trademarks, legal forms, and other legal services as a service\nHelp run the company through better and smarter legal decisions\nYour direct report is the employees. Corporate Tools is a horizontal organization without any real C level organizational chart. You're crazy valuable and important day 1.\nNot Your Responsibility:\nLitigation\nAdditional Benefits:\nCompany sponsored CLE’s to keep your trademark law skills sharp\nRequirements:\nYou find fulfillment in the work, not a title or ladder to climb\nYou've built an ego shelf in your tool shed or garage and are willing to put it in storage there while employed here\nYou're a good human\nSome experience with HR, general business and commercial property law\nStrong academic credentials including a J.D. from an accredited law school and current bar license\nCompetitive Attitude: This is a hard charging role. We move fast and we grow fast and you will need to enjoy beating our competition and helping us do this with smart legal decisions\nBonus Points: 5+ years experience with Intellectual Property\nBonus Points: Experience with ICANN and how domain names work\nBonus Points: Current experience in trademarks and service marks\nBonus Points: You can explain what Discombobulating is\nBonus Points: You can explain what Bonanzificating is\nBonus Points: You can explain what Anti-Thought Leadership is\nThe Lawyer\nPost Falls, ID", "url": "https://www.indeed.com/viewjob?jk=c4aa7b33e7a768be&from=serp&vjs=3"},
{"job_title": "newCorporate Associate", "summary": "Pierce Atwood strives to provide a very competitive compensation and benefit package.\nAll attorneys are eligible for a competitive package of base pay and a…", "company": "Pierce Atwood", "location": "Portland, ME", "job_description": "Pierce Atwood strives to provide a very competitive compensation and benefit package. All attorneys are eligible for a competitive package of base pay and a discretionary bonus based on performance.\n\nBenefits are an important part of our total compensation package. Each attorney's work and family situation is different and we have designed our package to be flexible to the unique needs of each attorney. First-year associates receive the following benefits:\n\nHealth Benefits\n\nMedical Plans (self, family and domestic partner)\nDental Insurance (self, family, and domestic partner)\nVision Service Plan (self, family, and domestic partner)\nPre-Tax Dependent Care and Health Care Spending Accounts\nAnnual flu vaccines\nWellness program and funding for wellness related activities\n\nInsurance Benefits\n\nEmployee Life Insurance\nShort and Long Term Disability Insurance\nAccidental Death and Dismemberment Option\nBusiness Travel Accident Insurance\nSupplemental Life Insurance Option\nIdentify Theft Insurance\n\nWork/Life Benefits\n\nFlexible Work Arrangements\nGenerous Paid Time Off and Holidays\nPre-Tax Parking and Transportation Accounts and subsidies\nEmergency Back-Up Child and Adult Dependent Care\nPaid Parental Leave\nTuition Reimbursement\nEmployee Assistance Program\nComputer Discount Purchase Program\nPersonal Insurance Discount Program\nBereavement Leave\nEmployer sponsored 529 College Savings Plan\nAdoption Assistance\n\nRetirement Benefits\n\n401(k) Retirement Savings Plan\nDiscretionary Profit Sharing Contributions\nPierce Atwood LLP seeks an associate with 3-5 years of corporate law experience to join and build the Business Practice Group in its Portland, Maine office. Candidates must have a strong background in mergers and acquisitions. Additional experience in general representation of business entities (corporate, partnerships, and limited liability companies), formation and structuring of business entities, and in finance and private equity transactions is preferred. Securities law knowledge is a plus, but not required.\n\n\nPlease submit your cover letter, resume and transcripts to Heather Higgins at hhiggins@pierceatwood.com.", "url": "https://www.indeed.com/viewjob?jk=97d167231ca47e72&from=serp&vjs=3"},
{"job_title": "newPROGRAMMING SERVICES OFFICER", "summary": "GENERAL STATEMENT OF DUTIES: To assist the head of a department, agency, or division by relieving such superior of complex duties involved in the development,…", "company": "State of Rhode Island", "location": "Providence, RI 02908 (Smith Hill area)", "job_description": "Class Definition\nGENERAL STATEMENT OF DUTIES: To assist the head of a department, agency, or division by relieving such superior of complex duties involved in the development, management, reorganization, and/or operation of a departmental/divisional program which provides services to employees and/or the public; to act as program supervisor; and to do related work as required.\nSUPERVISION RECEIVED: Works under the general supervision of a superior with considerable latitude for exercising initiative and independent judgement; work is subject to review for results obtained and conformance to established policies, rules, regulations and laws.\nSUPERVISION EXERCISED: Plans, directs, coordinates, supervises and reviews the work of a professional, technical and clerical staff assigned to assist.\nIllustrative Examples of Work Performed\nTo assist the head of a department, agency, or division by relieving such superior of complex duties involved in the development, management, reorganization, and/or operation of a departmental/divisional program which provides services to employees and/or the public.\nTo act as program supervisor, managing the services of the program, while monitoring those service for program effectiveness and efficiency.\nTo study and analyze operational procedures and prepare detailed and comprehensive reports of findings and recommendations.\nTo establish the scope and detail of the operation of such proposed programs, to document the need for such programs and to indicate the relative importance of such programs as they relate to existing and/or proposed programs.\nTo coordinate the flow of work among the various programs within the department/division, and to reassign space, equipment, supplies and personnel as necessary, to expedite the flow of work.\nTo review and evaluate state and federal laws, rules and regulations to ensure compliance with the provisions of these rules, laws and regulations in the plans and proposals.\nTo determine the effectiveness of policies, procedures and methods and to initiate alterations as determined by professional review.\nTo perform varied public relations duties such as preparing news releases and writing and delivering speeches, and meeting with community groups to explain program goals, services and objectives to engender public interest and participation.\nTo assist a superior by performing administrative tasks and research in preparation of the agency's annual budget.\nTo do related work as required.\nRequired Qualifications for Appointment\nKNOWLEDGES, SKILLS AND CAPACITIES: A thorough knowledge of the principles, practices and techniques of program management as it relates to developing programs on a departmental/divisional basis for the purpose of providing new or improved services/programs; a working knowledge of the standard principles, practices and techniques of research as it applies to evaluating program planning and programming service; the ability to analyze data, draw conclusions and develop programs based upon such data; the ability to forecast the need for such programs and the requirements of the programs for personnel, equipment and space; and related capacities and abilities.\nEDUCATION AND EXPERIENCE:\nEducation: Such as may have been gained through: graduation from a college of recognized standing with specialization in business management, social sciences or a related field; and\nExperience: Such as may have been gained through: employment in a supervisory position in a private or public agency involved in the development, management, reorganization, and/or operation of a service program.\nOr, any combination of education and experience that shall be substantially equivalent to the above education and experience.\n\nSupplemental Information\nThe Programming Services Officer is preferred to have exceptional quantitative problem-solving skills, fluency with data management tools, excellent communication skills, and a passion for improving the grants management and the grant business processes.\nPreferred Experience and SkillsExperience with Federal Grants/Federal Financial AssistanceDemonstrated experience in training, effective outreach and communicationAbility to work independently, manage multiple deadline driven projects simultaneouslyAbility to work with a variety of teams with different management styles and objectivesStrong communications skills and ability to translate complex data concepts to non-technical and/or executive-level staffAbility to navigate complexity and ambiguityCuriosity and a strong desire to learn\nResponsibilities include:\nGrants Administration\nRespond to grant inquiries from state agencies and subrecipient entities.\nAssist in daily management of COVID-19 grant funds compliance and oversight\nSupport the design and implementation of grants management processes\nAdvise on process improvements to increase efficiency, standardize, and document processes and procedures.\nSupport state agencies and community-based partners in the overall grants management process, including ensuring regulatory compliance requirements are met.\nDocument findings of studies and prepare recommendations for implementation of new systems, procedures, or organizational changes.\nDesign, implement and deliver ongoing training related to Grants Management Office core functions.\nAssist Grants team members with required federal and state reporting as needed.\nSupports routine Grant Management Office functions including data analysis and verification, assistance with policy research, development and analysis; and\nDoes related work as needed.\nGrant Management System\nActs as the liaison among internal and external (subrecipients) stakeholders to analyze, document, communicate and validate business and system requirements;\nEffectively and efficiently facilitates knowledge transfer between IT, vendors, and units within the department;\nConfigures and tests system to support implementation of agencies, enhanced grants processes, or new grant programs in accordance with system standards.\nResearches and recommends innovative and automated approaches for system processes and tasks. Identifies approaches that leverage resources and provide economies of scale.\nPerforms daily system monitoring, verifying the integrity and availability of the system including the review of processing logs.\nCreates, changes, and deletes user accounts per request.\nProvides Tier I/other support per request from agencies and community-based users. Investigates and troubleshoots issues.\nCoordinates and communicates any software outages or issues with impacted agencies and entities.\nParticipates in the coordinating software upgrades and testing. Configure and add new functionality as necessary.\nDevelops and maintains operational, configuration, or other procedures.\nProvides recommendations improvement by collaborating with agencies to determine more effective and efficient processes\nProvides system training and ongoing support to agencies.", "url": "https://www.indeed.com/viewjob?jk=887211766d875344&from=serp&vjs=3"},
{"job_title": "newHooters Girl", "summary": "Hooters Management Corporation owns and operates 25 Hooters restaurants in the Chicago area, Tampa Bay and Manhattan and 2 hoots locations in Chicago with…", "company": "Hooters of North Tampa Inc", "location": "Tampa, FL 33613", "job_description": "Description:\nHooters Management Corporation owns and operates 25 Hooters restaurants in the Chicago area, Tampa Bay and Manhattan and 2 hoots locations in Chicago with several more planned for early 2020.\n\nThe first Hooters restaurant opened in 1983 in Clearwater, Florida. Hooters is known for its brand of great food and fun and not taking ourselves too seriously. Our casual beach-themed restaurant, serves up a menu that features seafood, sandwiches, salads, and of course of our world famous chicken wings.\n\nOur mission is to provide a carefree dining experience in a casual, yet high energy atmosphere with signature menu items served by friendly Hooters Girls.\n\n. Requirements:\nDo you have what it takes to be a World Famous Hooters Girl? Come work with friends in a fun environment! Hooters Girls enjoy flexible schedules along with promotional opportunities to give back in the community at outside events. Must be able to come to work with a smile on your face and give your guests a great dining experience.", "url": "https://www.indeed.com/viewjob?jk=bbe3442bfa9cdf20&from=serp&vjs=3"},
{"job_title": "newAdministrative Assistant", "summary": "College training in the secretarial sciences may be substituted for the General Experience on the basis of 15 semester hours equalling one-half (1/2) year of…", "company": "State of Connecticut - Connecticut State Library", "location": "Middletown, CT+3 locations", "job_description": "Are you an administrative professional looking for a career with the State of Connecticut? If so, we are looking for you to join our team! Read below & apply today!\nThe State of Connecticut, Connecticut State Library (CSL) is seeking qualified agency employees for an Administrative Assistant in the Division of Library Development. This position reports to the Director, Division of Library Development. This is a Monday through Friday position with a work schedule of 8 am - 4:30 pm. This role is located at the Middletown Library Service Center.\nIn this role, you will provide complex office administrative support to the Division of Library Development including the Library for the Blind and Physically Handicapped and the statewide delivery service. Duties include, but are not limited to:\nWriting meeting minutes from rough draft\nTaking notes using shorthand or speedwriting\nOrganization and maintenance of physical and electronic filing systems\nComposition of letters and memoranda\nArrangement and coordination of meetings\nPreparation of travel documents and expense reimbursement forms\nCoordination of a multi-line phone system\nPhysical office organization\nReception duties\nOther tasks and duties as assigned to support the Division and the Division Director\nThe mission of the Connecticut State Library is to preserve and make accessible Connecticut’s history and heritage and to advance the development of library services statewide.\nThe CSL is an Executive Branch agency of the State of Connecticut. The State Library provides a variety of library, information, archival, public records, museum, and administrative services for citizens of Connecticut, as well as for the employees and officials of all three branches of State government. The State Library also serves students, researchers, public libraries and town governments throughout the state. In addition, the State Library directs a program of statewide library development and administers the Library Services and Technology Act state grant. In conjunction with the Department of Higher Education, the State Library also administers researchitct.org – Connecticut’s source for free online resources.\nDiscover the opportunity to:\nProvide administrative support at the Division level\nWrite minutes from rough draft to final document\nDraft correspondence to outside organizations\nCoordinate meetings both virtual and in person\nOrganize and maintain physical and electronic filing systems\nSupport the administrative needs of Division level grant projects\nArrange travel and preparing supporting documents\nDevelop vendor and customer relations\nWork with the Microsoft Office Suite\nMaintain logs of customer communications\nManage a multi-line phone system\nWhat We Can Offer You: Competitive salary, excellent State benefits package including health/dental insurance, generous paid time off, retirement plan options, and a culture that encourages work-life balance!\nSelection Plan\nAll state employees shall follow Executive Order 13G (as amended by Executive Order 14C).\n\nIn order to comply with Public Act 21-69, the State of Connecticut is no longer asking for resumes during the initial application process.\n\nThe immediate vacancy is listed above, however, applications to this recruitment may be used for future vacancies in this job class.\n\nNote: At any point during the recruitment process, applicants may be required to submit additional documentation which support their qualification(s) for this position. These documents may include: a cover letter, resume, transcripts, diplomas, performance reviews, attendance records, supervisory references, licensure, etc., at the discretion of the hiring agency. Applicants must meet the minimum qualifications as indicated to apply for this position.\n\nThis posting may require completion of additional referral questions (RQs). You can access these RQs via an email that will be sent to you after the posting's closing date or by visiting your JobAps Personal Status Board (Certification Questionnaires section). Your responses to these RQs must be submitted by the question's expiration date. Please regularly check your email and JobAps Personal Status Board for notifications. Please check your SPAM and/or Junk folders on a daily basis in the event an email provider places auto-notification emails in a user's spam.\n\nThe minimum experience and training requirements must be met by the close date on the job opening, unless otherwise specified.\n\nAlthough applicants will receive correspondence via email, as a backup they are also encouraged to sign on to their Personal Status Board on a daily basis to monitor their status, view all emailed notices and complete tasks required in the recruitment process.\n\nFor questions regarding this recruitment, please contact Michelle Gara at Michelle.Gara@ct.gov.\nPURPOSE OF JOB CLASS (NATURE OF WORK)\nIn a state agency this class is accountable for independently performing the most complex tasks in providing both office administration and secretarial support for a major program.\nEXAMPLES OF DUTIES\nPerforms the most complex office administrative duties as described in the following areas:\n\n1. TYPING: Using a personal computer or other electronic equipment, formats and types a full range of correspondence, reports, bills, drafts, etc. from rough draft, transcription, dictated notes, etc.; proofreads for content; edits using knowledge of grammar, punctuation and spelling.\n\n2. FILING: Designs office filing systems; organizes and maintains files (including confidential files); maintains, updates and reviews references materials and manuals.\n\n3. CORRESPONDENCE: Composes complex letters and/or memoranda, etc. (e.g. explaining department practices and/or policies) for own or manager's signature.\n\n4. REPORT WRITING: Researches and assembles information from a variety of sources and prepares statistical and/or narrative reports; analyzes information and may make recommendations.\n\n5. INTERPERSONAL: Acts for manager by interpreting established policies and procedures, etc.; troubleshoots by relieving manager of as much administrative detail as possible; acts for and regularly makes decisions in manager's absence (within prescribed limits of authority).\n\n6. PROCESSING: Screens letters, memos, reports and other materials to determine action required; may make recommendations to supervisor.\n\n7. PERSONAL SECRETARY: Arranges and coordinates meetings (including space and equipment); researches, assembles and coordinates meeting materials (e.g. charts, graphs, reports); writes minutes of meetings, lectures, conferences, etc. from rough draft; takes notes using shorthand, speedwriting or machine transcription; prepares expense accounts; makes travel arrangements.\n\n8. OFFICE MANAGEMENT: Authorizes purchases and payments (within prescribed limits of authority); develops input and prepares documentation for office and/or department budget; coordinates budget control and monitoring; develops office and/or department procedural manuals; assists in interviewing and hiring office support staff; trains office support staff; may supervise office support staff; performs related duties as required.\nKNOWLEDGE, SKILL AND ABILITY\nConsiderable knowledge of office administration and management; considerable knowledge of department and/or unit policies and procedures; considerable knowledge of proper grammar, punctuation and spelling; considerable knowledge of business communications; knowledge of business math; considerable interpersonal skills; ability to operate office equipment which includes personal computers and other electronic equipment; ability to operate office suite software; ability to take notes (shorthand, speedwriting or other method acceptable to manager).\nMINIMUM QUALIFICATIONS - GENERAL EXPERIENCE\nFour (4) years' experience above the routine clerk level in office support or secretarial work.\nMINIMUM QUALIFICATIONS - SPECIAL EXPERIENCE\nOne (1) year of the General Experience must have been as a Secretary 2 or its equivalent.\nMINIMUM QUALIFICATIONS - SUBSTITUTIONS ALLOWED\nCollege training in the secretarial sciences may be substituted for the General Experience on the basis of 15 semester hours equalling one-half (1/2) year of experience to a maximum of two (2) years.\nPREFERRED QUALIFICATIONS\nExperience in office administration\nExperience communicating with internal and external customers via oral and written communication\nExperience managing multiple (two or more) tasks with competing deadlines\nExperience with taking meeting minutes\nExperience managing electronic and print filing systems", "url": "https://www.indeed.com/viewjob?jk=97462f19931f1fc3&from=serp&vjs=3"}