[
{"job_title": "newCashier", "summary": "Cashiers play a critical customer service role by providing customers with fast, friendly, accurate and safe service.", "company": "The Home Depot", "location": "El Centro, CA 92243+126 locations", "job_description": "Job Description\nPosition Purpose:\nCashiers play a critical customer service role by providing customers with fast, friendly, accurate and safe service. They process Checkout and/or Return transactions, as well as monitor and maintain the Self-Checkout area. They proactively seek product/project knowledge to provide customers with information and identify selling opportunities. They follow all policies and procedures to ensure that shrink is minimized. A Head Cashier will position Cashiers and support them by expediting price checks, approving Point of Sale transactions and markdowns for mainline registers, Self-Checkout, Returns, Pro Desk, Special Services, and Tool Rental. They provide first level escalation for customer issues and assist in the supervision, coaching and training of other Front End Associates by participating in the training of new Cashiers and utilizing all available tools to coach and develop other Cashiers. The preferred qualification for a Head Cashier is 1+ years of Cashier experience.\nPay Rate: -", "url": "https://www.indeed.com/viewjob?jk=30597fc0da85a6bf&tk=1freqv9oqnpv6800&from=serp&vjs=3&advn=408043805857178&adid=382682755&ad=-6NYlbfkN0BAuTfAu5ThYozS55O8p5sS5gWZMb8bifg5H3ftdCgDuBriRxBvjCN-v9pIEM4HZVZb4UoyoZ4NLiCljNHodV6tIZ4FQtdtz8EeUX8IqB-s-C0F9oUOjj0AmV0yWw9X51_Kyxry36zUCxvIwuennuVuoNmkpIO1exrQqVIwWI0sw2XY47gOrg4VN042PHHoi9MaUbXdYXTirjMMMiUg4u0AiccjrkDY1biKv8gEyQfO5AVhvby3U6PdGd6N3P5WJHJfBuPCRAbWqUwazorMifBcmH-7yzUWnirjzL8bYwCICtZalxkfz3cRjiXhIjBxA7OT393-ce2Vhck-cu1WbeGWiqT7Z-zYsWunXuqQawlb82EtQQfmJZxo&sjdu=QWF4TUFyrHvH7u082A4fa7M39mv_xVu3eHfGEh0bObw"},
{"job_title": "Executive Assistant", "summary": "Work part-time or full-time hours.\nOur diverse team includes parents, military spouses, caregivers, and those with unique life situations where working remotely…", "company": "Boldly", "location": "Remote in California", "job_description": "Why you?You are an experienced professional with a positive outlook and a passion for helping others succeed. You are looking for a long-term career opportunity with a company that is committed to work-life balance, and that promotes a culture of respect, kindness and transparency. You are an excellent communicator, you take great pride in the quality of your work, you are a stickler for details, you are tech savvy, you excel at multitasking - and you do it all with a smile!Why us?As a premium executive assistant company we set the standard for remote professionals. We are proudly certified as a Great Place to Work, and our accolades include being named by Fortune Magazine as one of the “50 Best Small Workplaces”, and Entrepreneur Magazine in their Entrepreneur 360 List as one of the “Best Entrepreneurial Companies in America”. Military Friendly named us as part of the Top 10 Military Spouse Friendly Employers, and FlexJobs as a Top 100 Company to watch for. We are also accredited by Flexa as a truly flexible employer.We believe that it is possible to have a rewarding career that doesn’t conflict with your personal responsibilities and life choices. Our diverse team includes parents, military spouses, caregivers, and those with unique life situations where working remotely, part time and on a flexible schedule is not just a ‘nice to have’. As a woman owned business, we are intimately familiar with the challenges women and minorities face in the workplace and we are committed to maintaining a diverse, equitable, and inclusive workplace for all. And of course, as a remote first company since our inception in 2012, we are long time established experts at leading and succeeding in a remote work environment!For more information about our company culture and to hear from team members about their experience in roles filled with variety and new learning - visit our jobs page at https://boldly.com/jobs/About the positionThis is a rewarding long-term career opportunity to work alongside established Fortune 500 companies, senior-level executives, and successful business owners of small and medium size businesses as they make a greater impact in the world. As an executive assistant, you will have the opportunity to choose the companies that you support based on company values and your preferences, and to create long-term partnerships with the executives that you support as you develop new skill sets and get exposure to a variety of industries. You will join our team as a part-time W2 employee with the opportunity to become full-time in due course, based on performance.As an executive assistant you’ll apply your professional skills in a wide range of tasks including: Maintaining appointment schedules and calendars.Planning and scheduling meetings, conferences, and travel.Making travel arrangements including flight and hotel bookings.Maximizing the executive’s time by reading, researching, and routing correspondence; drafting letters and documents; collecting and analyzing information; initiating phone calls on their behalf.Email management.Creating PowerPoint presentations.Managing expenses.Conducting research on various topics.Providing customer/supplier support.Other executive admin responsibilities as needed.Your Skills and Experience: A minimum of 7 years of direct hands-on experience in a role related to executive assistance and administration.Ability to multitask and prioritize work as needed.Excellent time management skills.Advanced knowledge of online tools and software such as Google Drive, Outlook, and Zoom.Ability to learn new tools quickly.Excellent interpersonal communication.Strong writing skills.Highly organized.A team player who is proactive, flexible, results-oriented and comfortable in a rapidly changing environment.Ability to work independently and under the pressure of deadlines.Benefits you’ll love: W2 employment statusOpportunities for pay raisesGenerous PTOPaid holidaysPaid parental leaveTechnology stipendCompetitive pay (starting at $22 an hour)Show me the Perks, Perks, Perks!Flexible work hoursWork part-time or full-time hours100% remote (work from home)Steady work with the same clients for years!Choose the clients who you want to work withJoin a team of like minded professionalsPaid onboardingWork with a dedicated Team Leader to help you succeed with ongoing mentorshipIn house Technical SupportOpportunities for collaboration with other members of the Boldly teamCamaraderie and all around support with our Team SlackLearning and development opportunities in different industriesA positive and thriving company culture that understands work/life balanceAn opportunity to grow with a leader in the remote work spaceCompany newsletters, team shares, quizzes, prizes, charity events, and celebrationsFun company swag!We are just getting started and the future is bright! Don’t miss out on joining us!Boldly is currently hiring in the following 23 states:ArizonaCaliforniaColoradoDelawareFloridaGeorgiaIllinoisKansasMassachusettsMichiganMinnesotaMontanaNew HampshireNew JerseyNew YorkNorth CarolinaOhioPennsylvaniaSouth CarolinaTennesseeTexasVirginiaWashington''Work Location: Fully RemoteWork Remotely  YesJob Type: Part-timePay: From $22.00 per hourBenefits:Flexible schedulePaid time offParental leaveSchedule:Day shiftMonday to FridayWork Location: Multiple Locations", "url": "https://www.indeed.com/viewjob?jk=c26dedb12965b7f4&q=Office&l=CA&from=web&advn=6550110154777366&adid=380719644&ad=-6NYlbfkN0CpPP9DwnhXfZGfrLbSYiRHtUdaesnKgVk6yuUYdgfP844RgljxUl8XN506jcyn9KHHuio913WTajjknn6CLRpQ_r9BmBz47kCH49-fc9CRnqahuUZ3_i6QYAivuE08PyfNhtX3mG11Lr-5XqDbxRLzbnqjgmCZv-Pn2EomDDifOXtNNmXhn6N-WkjjA9Q70HhV8bYFulTbJSu0Uj7l8GuH6wCcAt0nas8Pi25ucQp_vmnOwTUvHhlMDKK4F5W-cs2pMQJc1yM9k6AVsmHUZP41MNylksodMew48IDNHnlL9sJjDnzjtUnXINVHE-Elnw1MIof_RO5t8BkE_jOvN2hhGZeIJAhtSlT-RTKFBq93TuL2h_WGtr2w&pub=4a1b367933fd867b19b072952f68dceb&vjs=3"},
{"job_title": "newADMINISTRATIVE SECRETARY", "summary": "Schedule appointments, make reservations and complete trip authorizations;\nRequest and submit insurance documents;\nUnderstand and follow complex instructions;", "company": "Stanislaus County", "location": "Stanislaus County, CA", "job_description": "About the Opportunity\nTHE IDEAL CANDIDATE\nThe Public Works Department is looking for an organized, detail-oriented person that is able to maintain consistency in a high pressure, quick-paced environment with tight deadlines. This candidate will be customer-oriented and able to multi-task with multiple demands from our Engineering Division.\n\n To learn more about the Public Works Department, click here.\n\nABOUT THE POSITION\nThe Administrative Secretary performs difficult and specialized secretarial work of a varied and sensitive nature often involving the exercise of independent judgment and initiative based upon skills, knowledge, and abilities gained through prior experience in the performance of high level secretarial work. Individuals in the Administrative Secretary classification are journey-level employees who are highly skilled and independently perform a wide variety of complex and general clerical duties associated with the immediate clerical support of a particular manager or organizational unit of County government. This classification requires a thorough knowledge of office procedures and regulations and the ability to perform these duties with minimum direction or supervision. The Administrative Secretary is distinguished from the Executive Secretary (Confidential Assistant IV) in that he/she normally provides secretarial services in support of an office or division head or an identified management employee rather than a Department Head. This classification also supervises subordinate employees and may relieve supervisors of routine operating details. This position is subject to overtime, standby, and callback assignments. Performs related duties as assigned.\nUnless otherwise provided, this position is part of the Classified Service of the County and is assigned to the Office Worker/Clerical bargaining unit for labor relations purposes.\n\nIndividuals who are in a full-time classification position are required to serve a twelve-month probationary period, which may be extended an additional six months, for a total of eighteen months.\n\nThe Job Task Analysis provides information detailing the physical and functional demands of the classification. For the complete job task analysis, visit the Risk Management website at http://www.stancounty.com/riskmgmt/ under \"Disability Management\".\n\nIncumbents may also be subject to overtime, standby, callback, weekend, holiday and shift assignments as identified in their MOU (Memorandum of Understanding).\n\nTypical Tasks\n\nType letters, reports, records;\nAssist with answering the main line and routing calls accordingly;\nUse the Government Outreach portal to record constituent requests;\nMaintain informational and operational records;\nReview material for completeness and accuracy;\nMaintain and improve files and filing systems;\nRecording and filing with the Clerk Recorder;\nAssemble data and information, and assist in the preparation of reports;\nSurvey map logging, tracking, and filing;\nRequest and submit insurance documents;\nDo purchasing and requisitions as requested;\nAct independently, or in accordance with instructions;\nCompose correspondence;\nProcess mailings via USPS and FedEx;\nAssist with routing documents such as contracts and agreements between Morgan Rd and our Tenth Street Place office;\nSchedule appointments, make reservations and complete trip authorizations;\nInterpret and disseminate instructions, department rules, and policies and procedures;\nTime card review and submittal for Engineering Divisions;\nProcess Traffic Delay Notifications;\nProvide website updates;\nRefer incoming mail to proper staff members;\nAttend and take notes at meetings, hearings and conferences, and prepare summaries; And\nDuties as assigned.\nMinimum Qualifications (Skills, Abilities, Knowledge, Education/Experience)\nSKILLS/ABILITIES\n\nPerform a variety of difficult clerical work;\nUnderstand and apply laws, rules, procedures and policies relating to the work of the department;\nUnderstand and follow complex instructions;\nCompose difficult letters independently;\nSupervise the work of a small group of employees;\nOperate office equipment related to the job;\nCompile data for and prepare reports of average difficulty;\nFollow oral and written communication;\nType at a speed of at least 45 WPM from handwritten, printed or typewritten material; and\nTake shorthand and/or use a Dictaphone machine.\nKNOWLEDGE\nPrinciples and methods of statistical clerical work, including business letter writing;\nPrinciples of supervision and training; and\nCurrent office practices and procedures, including familiarity with filing systems and method.\n\nEDUCATION/EXPERIENCE\n\nTwo (2) years of journey-level clerical experience; AND\nTyping certificate, within four years, of 45 wpm (net corrected) from any temporary agency or comparable institution. The certificate must be a three to five minute timed test.\nApplications without proof of typing speed will not be considered.\nApplication and Selection Procedures\nAPPLICATION PROCEDURES/FINAL FILING DATE\n\nApplications cannot be submitted later than 5:00 p.m. on the final filing date. Make your online application as complete as possible so a full and realistic appraisal may be made of your qualifications.\n\nResumes will not be accepted in lieu of a completed application.\n\nAttaching your resume and cover letter are an optional feature for those who wish to do so in addition to completing the required application. Information on your resume and cover letter will not substitute for the education, work experience and required fields on the County application. The online County application is the primary tool used to evaluate your job qualifications.\nEXAMINATION PROCESS\nMost County recruitments consists of the steps detailed below and are governed by Merit Principles. The examination process ensures that all applicants are given the same opportunity to gain employment within Stanislaus County.\nApplication Review and Screening. Applications are carefully screened based on information provided. Those who submit incomplete applications that lack relevant qualifications or do not submit all required documents will not be invited to move on.\nWritten Examination. Applicants will be invited to participate in a written exam that tests knowledge for the position.\nOral Examination. Applicants are invited to a panel interview in which they will be evaluated by County subject matter experts.\nEligible Lists. Candidates who pass the examination will be placed on an eligible list for that classification. Eligible lists are effective for six months, but may be extended up to eighteen months.\nTENTATIVE RECRUITMENT SCHEDULE\n\nApplication Deadline: February 21, 2022\nOral Examination: Week of February 28, 2022 through March 4, 2022.\n\nNote: The eligible list generated from this recruitment may be used to fill future extra-help, part-time and full-time vacancies throughout Stanislaus County.\n\nFinal appointment will be conditional upon successfully passing a County paid pre-employment drug screening (if applicable for position) and a job-related background investigation.\n\nStanislaus County supports the good health of its workforce. More information is available at http://myclubwellness.org\n\nCell phones are typically incompatible with the online application format or browser. We recommend using a desktop or laptop computer. If you are still having technical difficulties, please call NEOGOV at 1-855-524-5627.", "url": "https://www.indeed.com/viewjob?jk=b7d697c7114549cb&from=serp&vjs=3"},
{"job_title": "Securities Lawyer-Remote", "summary": "Develop and maintain policies and procedures to ensure compliance with SEC and other securities-related regulatory requirements applicable to publicly-traded…", "company": "AlignTech", "location": "Remote in California", "job_description": "Join a team that is changing millions of lives.\n\nTransforming smiles, changing lives\nAt Align Technology, we believe a great smile can transform a person’s life, so we create technology that gives people the confidence to take on whatever’s next. We revolutionized the orthodontic industry with the introduction of the Invisalign system, and we have never lost sight of that spirit of innovation. Our diverse and collaborative teams are constantly pushing the boundaries of what’s possible.\nReady to join us?\nAbout this opportunity\nWe are looking for a talented lawyer to support our Vice President and Associate General Counsel, Corporate Securities. This is a newly created position due to growth and offers the opportunity to work closely with various cross-functional teams and make an immediate impact with your analytic rigor, business judgment, and ability to get things done.\nIn this role, you will…\nDevelop and maintain policies and procedures to ensure compliance with SEC and other securities-related regulatory requirements applicable to publicly-traded companies, including the Sarbanes-Oxley Act, Dodd-Frank Act and stock exchange listing standards and corporate governance initiatives\nSupport the preparation and review of SEC filings, including registration statements, Forms 10-K, 10-Q and 8-K, proxy statements (including shareholder proposals and proxy solicitations)\nSupport earnings preparation and reporting, including IR presentations, scripts and earning releases\nAssist with Insider Trading Policy revisions, processes and procedures, including revisions, training on best practices, and FINRA and SEC investigations, along with the review of 10b5-1 trading plans, and assist with preparation and review of Section 16 forms (including Forms 3 and 4) and Rule 144\nOversee the creation, management, compliance and dissolution of domestic and foreign entities, including the policies and procedures for establishing entities, managing and approving corporate powers, assisting with annual reporting and compliance and performing periodic compliance audits\nAssist in overall corporate secretarial functional matters, including preparation of notices, agendas and materials for board of directors and committee meetings, including board minutes, resolutions and actions, and leading preparation for annual shareholder meetings and for all company subsidiaries\nProvide counseling and training regarding Regulations FD and G and related party transactions review\nAssist with various strategic transactions including due diligence, drafting and negotiation of transactions involving mergers and acquisitions, joint ventures, and other investments\nLegal support for finance department (including global corporate reporting; tax; investor relations; the corporate communications department, and the executive compensation/human resources department)\nSupport Treasury transactions and matters, including debt offerings, credit facilities, dividend and stock repurchase programs and charitable support or foundations\nSupport the stock administration team, including review of equity plans and compliance with local securities regulations worldwide\nAssist in evolving the company’s risk management program and assist with the company’s insurance portfolio\nIdentify, prioritize and implement crisis management program enhancements and expansion across the regions\nManage the D&O Questionnaire process, including updating questionnaires, coordinating distribution, review of completed questionnaires for disclosure issues, and reviewing and assessing compensation and expenses for perks disclosures\nResponsible for tracking, executing, designing, facilitating, monitoring and collaborating with Tax concerning intercompany work relationships and transactions among and between the various corporate entities (intercompany transactions, drafting occasional make/buy analyses and price-cost analyses and noting any significant, and/or unique contract requirements, special provisions and terms and conditions to ensure compliance with applicable laws, regulations and corporate policies)\nStay abreast of new and proposed securities law and corporate governance developments, best practices and trends to ensure continued compliance and anticipate trends and changes\nAssist with other legal corporate projects as requested\nIn this role, you’ll need …\n4+ years of corporate experience with a sophisticated law firm or in-house legal department; *must include significant dedicated experience advising public companies on and preparing U.S. public company securities reporting requirements.\nExcellent communications and interpersonal skills with the ability to communicate complex legal subject matter to colleagues, as well as senior executives and board members. Adaptability and ability to self-start; must be proactive in providing counsel to internal and external clients.\nTo be a detailed-oriented and a critical thinker. You must be proactive and possess the ability to think strategically and give practical advice with a global mindset focused on creating operational efficiencies in a rapidly growing, cutting-edge company. You will have a track record of conducting a careful and thoughtful analysis of complex corporate governance and securities law issues and applying such analysis to produce high quality work.\nSound judgment; ability to clearly make reasoned decisions and recommendations; ability to cross think and determine who should be kept informed.\nTo be a self-starter with good business sense and a sense of urgency, honesty and fairness.\nTo demonstrate leadership and be comfortable working in a fast-paced, highly collaborative, team environment and demonstrate the ability to successfully handle frequent changes in priorities, deadlines, and workload. To be successful, you will need to be self-confident and inspire confidence from colleagues and clients.\nA Juris Doctorate from an accredited law school and a license to practice law.\nA strong commitment to be a legal business partner to internal clients.\nTo travel periodically, both domestically and internationally, primarily to Align locations in the United States and abroad.\nA willingness and the ability to work in a global environment, which includes handling calls outside normal working hours on a regular basis.\nExperience supporting corporate charitable organizations or foundations a plus.\nHigh integrity and ethics in all dealings.\nA good sense of humor, openness to learning, resiliency and collaborative personality.\nFamiliarity with Wdesk/Workiva a plus.\nSound like a good fit?\nGreat! Click the \"Apply\" link to let us know you are interested. Not the right fit? Don’t worry, Align is quickly growing so we are creating more opportunities to expand our Align family. Please consider joining our Talent Network to receive notifications about future jobs or sharing this opportunity with others in your network.\nAbout Align\nAlign Technology is a publicly traded medical device company that is transforming smiles and changing lives. Our global team of talented employees develop innovative technology, tools and treatment options to help dental professionals worldwide achieve the clinical results they expect. Our digital ecosystem combines the power of technology to create beautiful smiles through the integration of AI and machine learning, digital imaging and visualization, biomechanics and material science to develop the Invisalign system, the most advanced clear aligner system in the world; iTero Intraoral Scanners and OrthoCAD digital services. Did you know? Align is the world’s largest manufacturer of custom 3D-printed materials.\nBy joining Align, you will be part of a global, fast-growing company in one of the most dynamic industries. Great people, innovative technologies, and meaningful work – these are just some of the things employees say make Align Technology a great place to work.\nWe respect your privacy. Please review our Applicant Privacy Policies for additional information.\nGlobal Diversity Statement:\nAt Align, we believe in the power of a smile, and we know that every smile is as unique as our employees. As we grow, we will continue building a workforce of diverse cultural backgrounds and life experiences and fostering a culture of open-mindedness and compassion for all our employees. We live our company values by promoting healthy people and healthy communities. All with the intent of changing millions of lives, one unique smile at a time.\nUS EEO Statement:\nAlign Technology is an equal opportunity employer. We recruit, employ, train, compensate and promote regardless of race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, age, veteran or disability status.\n#LI-32160401_MB1", "url": "https://www.indeed.com/viewjob?jk=6c7ddcbce3ce5432&from=serp&vjs=3"}