[
{"job_title": "Administrative Assistant I", "summary": "Hulu’s Marketing team is seeking an Administrative Assistant to our VP, Consumer Insights and VP, Brand & Content Marketing. As an Assistant, you will be…", "company": "Hulu", "location": "Santa Monica, CA 90404+1 location", "job_description": "Hulu’s Marketing team is seeking an Administrative Assistant to our VP, Consumer Insights and VP, Brand & Content Marketing. As an Assistant, you will be responsible for administrative and other supportive tasks. The right person for this role is organized, efficient, and capable of achieving amazing results in a very fast-paced and constantly changing environment. If you are someone who obsesses over details, thrives in a collaborative environment, and jumps at the opportunity to take on new challenges, then this is a great role for you.", "url": "https://www.indeed.com/viewjob?jk=1aa4d37a2f71c009&from=serp&vjs=3"},
{"job_title": "newOnline Environmental Science Tutor", "summary": "*Introduction to Environmental Science: * Introduction to environmental field science.\nWork Schedule Schedule will vary between 8:00am-9:00pm (Including…", "company": "Brainstream LLC", "location": "Remote", "job_description": "Online/In-person: Online/RemoteWorking Title: Environmental Science Tutor.Position InformationWork Schedule Schedule will vary between 8:00am-9:00pm (Including weekends)Department Required Skills-Must be able to teach academic success strategies to a diverse student population in a one-on-one or small group setting.-Ability to work a flexible schedule.-Preference can be given to individuals who have tutoring experience or other educational qualifications.-Must have the ability to effectively communicate verbally and have skills to develop written reports.-Must be attentive to detail and accurate in record keeping.-Ability to work a flexible schedule including nights and weekends.Courses Descriptions: Introduction to Environmental Science:  Introduction to environmental field science. Case study approach. Exposure to basic field equipment and techniques, analysis of data.Habitable Planet:  Introduction to the origin and evolution of Planet Earth, creation of the universe and the elements, early history of Earth, radioisotope geochemistry and the timing of events in the universe, the galaxy, and on Earth. Formation of the atmosphere and oceans. Climate.Earth Processes: An introduction to earth materials and processes.RecruitmentBrainstream Tutoring is an equal opportunity and affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, national origin, religion, sex, gender identity, age, sexual orientation, genetic information, status as an individual with a disability, or status as a protected veteran.Job Types: Full-time, Part-time, ContractPay: From $20.00 per hourSchedule:Monday to FridayWeekend availabilityApplication Question(s):Have you completed or are you completing a degree in Environmental Science?Have you tutored or taught Environmental Science before?Education:High school or equivalent (Required)Work Location: Remote", "url": "https://www.indeed.com/viewjob?cmp=Brainstream-LLC&t=Online+Environmental+Science+Tutor&jk=986397b902e34e43&vjs=3"},
